[
  {
    "review_id": "careerbliss_DG_0",
    "rating": 5.0,
    "title": "100% recommend NOT working for Dollar General,they don’t care about their employees at all. My manag",
    "pros": "100% recommend NOT working for Dollar General,they don’t care about their employees at all. My manager was great but the district manager was completely rude to everyone and only picked who he liked and didn’t like, I lost my job unfortunately over a story that was told that was not true and they took the word of that other person and I tried to get my job back but HR took the word of the district manager…. Who again… only likes who he wants,so he lied to keep me fired. It’s all drama and it’s absurd.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.335350+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_1",
    "rating": 3.0,
    "title": "While I thoroughly enjoyed my job, I was disappointed in the lack of professionalism of the store ma",
    "pros": "While I thoroughly enjoyed my job, I was disappointed in the lack of professionalism of the store manager. If someone did something wrong, the way they found out is through gossip. A good manager would address the issue with the employee and help them improve. There is nothing positive about creating drama or having favorites in the workplace.  If looking cool is a priority, a job in management isn’t the place to be. Working at DG isn’t extremely hard, but the work is never finished. I considered that a blessing as I like staying busy. Unfortunately, because the manager wanted to be cool, she wouldn’t communicate with her assistant manager, but with her 21-year-old favorite person who worked there. Conflicting information was scattered around to where you couldn’t determine if you were working a puzzle or playing Go Fish. I applied for the job knowing it was entry-level paying minimum wage. For that reason, I have no right or reason to complain about the pay. I can’t speak for upper-level management, but from my own experience and reading these reviews, store-level management deserves very little respect.  In fact, the turnover would be much lower if corporate would require 50+ year-old managers to lose the high school mentality.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.336347+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_2",
    "rating": 1.0,
    "title": "I used to love working at DG till management changed the new manager is a joke her name is Ashley Gi",
    "pros": "I used to love working at DG till management changed the new manager is a joke her name is Ashley Gingerich she is completely rude to her employees always threatening to punch them employees in their face she shows no compassion and gets a hold of her is impossible at times when something at work is messed up we haven’t even been trained properly and at times we sell stuff that’s like two months old nothing is getting done right I quit today unfortunately because my son got hurt and had to go to the ER not once did she show compassion but instead kept asking when I’d be in because she wasn’t doing a double but yet says she isn’t being pushy I highly recommend not working or shopping at this store",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2026-02-12T23:47:39.337348+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_3",
    "rating": 1.0,
    "title": "Don’t work for this company they pay you less then what you’re worth.. Management sucks half of them",
    "pros": "Don’t work for this company they pay you less then what you’re worth.. Management sucks half of them need to take a training course on how to be a good leader.. I’m a former employee that unfortunately came back after being gone for 8yrs but I see now nothing has changed.. My manager now is rude disrespectful and a total ***bitch***!! Came in my first day first thing I see is my file with my personal information just laid out on desk so everyone can see, then you have to make your own badge, then your not apart of the group text messaging., what a way to make a person feel welcomed.. Dollar general needs to do better plus there are no safety measures at all none of the doors have locks on them if it’s a crime we have absolutely nowhere safe to go hide.. but yet they have cameras everywhere smh … ***fuck*** DG and everything it stands for….",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.339345+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_4",
    "rating": 5.0,
    "title": "I worked for this company for about 2 years. I was let go over a customer complaint the company had ",
    "pros": "I worked for this company for about 2 years. I was let go over a customer complaint the company had no proof of. A gentleman who claimed I was rude to him and his daughter because his card wouldn't work. Couldn't remember what day, what time he was in, or my name. But because he was a \"big landowner\" in the county I got axed anyway. I reached out to the corporate office but they agree with the decision of the district manager and regional manager, who again I know had no proof. Nothing on camera, audio, paper, hell even the cashier who was working with me the suppose day said she didn't remember me being rude to anyone. I worked hard and got treated like crap. Needless to say, I still see quite a few of the regulars whose use to see me when they came in tell me that the place has gone to sh*t and that I was always so nice.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.340346+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_5",
    "rating": 1.0,
    "title": "This location I thought this was great it's super busy. But our resources like the registers and pri",
    "pros": "This location I thought this was great it's super busy. But our resources like the registers and printers don't work and it's frustrating working there. Customers have to wait for long periods when it's a simple phone call to take care of it. The list of duties we have to do in a certain time frame plus ring our customers and stock. Management over schedules calls in our your day off. Doesn't know how to talk to people. I used to like to go now I dread it. 3 people have already quit.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.341345+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_6",
    "rating": 1.0,
    "title": "On my first day here, the manager told me I was going to be the only one working for my training. I ",
    "pros": "On my first day here, the manager told me I was going to be the only one working for my training. I had to stock, rotate stock, run cash, and keep the store clean. She got to sit in the backroom and play on her phone. At one point I had a long queue and asked for help. She said she wasn't allowed to help me. I got complaints against me for not being fast enough.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.342346+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_7",
    "rating": 3.0,
    "title": "Corporate\" policy changes from store to store based on your manager's attitude.  They expect you to ",
    "pros": "Corporate\" policy changes from store to store based on your manager's attitude.  They expect you to break company policy when they tell you to, treat you like a slave, and pay you garbage wages.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2026-02-12T23:47:39.342346+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_8",
    "rating": 5.0,
    "title": "Dollar General had a chance to compete with Walmart due to Walmart's lack of customer care. However,",
    "pros": "Dollar General had a chance to compete with Walmart due to Walmart's lack of customer care. However, DG has instead decided it is important to compete with Walmart as the most hated corporation. It is only profits over people at every turn. The poor managers are overworked and rightfully stressed out. No help from the district manager but they are sure to come in as a tyrant throwing around their authority. Pay is laughable and expectations are ridiculous. Employees are mistreated at every turn which is surely to sour even the most loyal people. The poor customers are expected to use self-checkout because the employees have way too many tasks to complete per shift.  Please save yourself the headache and find somewhere else to work. I hear at least Walmart pays better for their mistreatment of humans.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.344874+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_9",
    "rating": 1.0,
    "title": "I just quit Dollar General. Here's the breakdown of the 3 days I lasted there. On my 1st day, the ma",
    "pros": "I just quit Dollar General. Here's the breakdown of the 3 days I lasted there. On my 1st day, the manager told me to be there at 7:30. She didn't get there until 10 mins to 8. They open at 8. She talked a mile a minute and was darting all over the place like a rabbit on drugs. (i found out later that she drinks coffee and red bulls all the time). Every time she showed me something she rushed me through it, and when I asked questions, especially if it was about something she had already shown me she acted so irritated and sighed and said okay give me a minute and I will be right there in such a bitchy way. On the 2nd day she had me work till closing because she needed to show me the closing procedures, she rushed me through that too. I left not feeling good at all about her training. I was off the next day and then was supposed to work the next day but since she has me feeling very confused about everything and her training was too rushed and left me feeling miserable and coming back I called in sick. The next day I worked but had a job interview with another company when I got off work. Dollar General needs to have a person designated as a trainer to train employees, not the managers, then the employees would not feel so rushed and be able to retain the information they are given. The other issue I has was if I'm scheduled to be off at a certain time then I should be able to leave at that time, not 15, 20, or 30 mins later. Sorry, Dollar General but you don't have it going on in the employee department. It's no wonder that every time I go to a Dollar General there are always new people working there and the old people have quit.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.345874+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_10",
    "rating": 1.0,
    "title": "Don't file a complaint, because nothing will be done.   They don't care how their employees are trea",
    "pros": "Don't file a complaint, because nothing will be done.   They don't care how their employees are treated.  If you do file a complaint, all you get told is that it will be over soon or some other response, that is after 3 months of complaints.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.346876+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_11",
    "rating": 3.0,
    "title": "Listen, it was a good place to work at till this recent woman got hired now it's a nightmare she tal",
    "pros": "Listen, it was a good place to work at till this recent woman got hired now it's a nightmare she talks behind your back and the other lady that works there can do no wrong, and in the manager's eyes it's all high school drama",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.347882+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_12",
    "rating": 1.0,
    "title": "I have worked for DG for just about a year. I love my job and I'm good at it.i have a toxic boss. Sh",
    "pros": "I have worked for DG for just about a year. I love my job and I'm good at it.i have a toxic boss. She is Store Manager but all she really is is a salaried stocker. She saw me work on truck day I can put stock on shelves fast and accurately (in right place) now she puts me on register now we have isle that you can't walk down. She belittles certain employees and stops talking to you even about work things.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.348873+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_13",
    "rating": 1.0,
    "title": "Low pay boss is very outspoken has no filter. embarrasses you in front of others. She doesn't talk t",
    "pros": "Low pay boss is very outspoken has no filter. embarrasses you in front of others. She doesn't talk to you about employee benefits.Hours are basically set but work is hard. Cameras everywhere and computer monitors every input and marks can and will be used against you. This is a bad job expect way too much. corporate wants ROBOTs",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.349648+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_DG_14",
    "rating": 5.0,
    "title": "I’ve worked for Dollar General going on three/four years now, and if I could find somewhere else to ",
    "pros": "I’ve worked for Dollar General going on three/four years now, and if I could find somewhere else to go I would do it in a heartbeat. Within these 3/4 years I have seen six different District Managers, three Managers, two Assitant Managers, and close to one hundred cashiers.\n\nIf you genuinely enjoy working for people without being recognized, rewarded, valued, or even paid well then you might like this job.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Dollar General Employee",
    "review_date": "2026-02-12T23:47:39.351461+00:00",
    "source": "careerbliss"
  }
]