[
  {
    "review_id": "glassdoor_DG_102793780",
    "rating": 5.0,
    "title": "Not bad",
    "pros": "Part time is a good thing",
    "cons": "Low hours / wages, too much drama often",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Part Time Cashier",
    "review_date": "2026-02-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102791789",
    "rating": 3.0,
    "title": "Heading downhill",
    "pros": "Mostly this is an easy going environment.  There is stress, but not excessive and most upper management (director level) care about their teams.",
    "cons": "Senior management is out of touch with the people that work in the store support center and probably the stores too.  They decided to have a return to work from a hybrid system, but left one day at home.  Now they are taking that away too.  They claim we asked for it, but that's all obvious lie.  If it were true the change would be unnecessary since everyone would just come in.  It's crazy how 90% of my meetings are on teams and not in person.  It's just stupid management that will hurt DG in the long run.  Back out to the job market I guess.",
    "advice_to_management": "Be visible.  I rarely see VPs and they require us to be in the office when many aren't there themselves.  Go back to hybrid working conditions.",
    "is_current_employee": true,
    "job_title": "Accounting Manager",
    "review_date": "2026-02-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102743900",
    "rating": 2.0,
    "title": "Lots of room for improvement",
    "pros": "Some flexibility \nYour team\nYou do have some say on your store",
    "cons": "Pay, micro management, lack of decent management above you, they give you no hours to effectively run your store, solo shifts, a lot of hours you work",
    "advice_to_management": "If you hire quality store managers. Give them the tools and leeway to manage that store. Your company would prosper and your customers will thank you. There is much more to be said but this is the shortest and simplest.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-02-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102783642",
    "rating": 5.0,
    "title": "Customer Service Professional",
    "pros": "Leadership; advancement, associate degree in criminology; civil law, currently, obtaining bachelor’s degree in psychology with an LPN license private and family primary caregivers travel!",
    "cons": "Consider to advance, more knowledge, updated technology techniques, creative credentials for career development and opportunities!\nNONE",
    "advice_to_management": "LEADERSHIP; ACCOUNTABILITY, RELIABILITY, ALUMNI, LEADERSHIP PROFESSIONAL!",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2026-02-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102179757",
    "rating": 1.0,
    "title": "The store manager is trying but is limited by higher-ups",
    "pros": "Flexible scheduling for those who study or have other duties",
    "cons": "Poor organization, management trying to push you harder and work faster despite knowing their employees have debilitating injuries. \n\nExpect to work with 1 other person at most during your shift.\n\nUpper management urging store manager to fire low productivity workers while they're already struggling to hire, yet refuses to pay people higher wages. \n\nThe back storage area is filled to the brim, you seriously cannot get through that area. The inventory ordering system seems to be at least partially automated and keeps sending the same items even though they never sell - it's very flawed and the place is not run well. While I was there, it seemed that the manager was at least trying, but upper management does not give many resources",
    "advice_to_management": "For upper management, please pay staff better, both the store associates and the store manager, they deserve higher wages for what they're going through working here. Better pay and better working conditions. Give the store higher budgets to allow for more employees to work simultaneously so the back warehouse area can also be sorted out.",
    "is_current_employee": true,
    "job_title": "Store Associate",
    "review_date": "2026-01-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102456134",
    "rating": 1.0,
    "title": "Lack of understanding and support from management",
    "pros": "Stocking work was straightforward and enjoyable.\nFirst manager was supportive, respectful, and gave positive feedback.\nJob can be manageable with proper expectations and structure.\nCoworkers were generally fine to work with.",
    "cons": "Management after the first manager left was unsupportive and dismissive.\nConstantly expected to do multiple people’s jobs at once.\nNo consideration for employees who work best focusing on one task at a time.\nCommunication issues and lack of appreciation for good work.\nWhen I explained that I am autistic and have anxiety, accommodations or understanding were not provided.\nRepeatedly pushed beyond reasonable limits, which created unnecessary stress.",
    "advice_to_management": "Listen to your employees and recognize individual strengths. Not everyone works the same way, and productivity improves when people are assigned tasks they do well instead of being overloaded. Be more understanding of mental health and neurodiversity, and don’t ignore employees who are genuinely trying and putting in effort. Appreciation and basic respect go a long way toward retaining good workers.",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-01-24T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102788721",
    "rating": 2.0,
    "title": "First time management only",
    "pros": "Make your own schedule.401k was good.",
    "cons": "You are the schedule. Expectations don't meet pay.",
    "advice_to_management": "Control work home life when building schedule this will take over if you are truly invested",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-02-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102710218",
    "rating": 2.0,
    "title": "It was alright",
    "pros": "I got paid weekly and Sometimes I would get an hour break",
    "cons": "My main keyholder/person who would lock up the store and take care of most things would constantly sit in the break room and make me do all the work\nThere was only one register\nManagement was very lackluster",
    "advice_to_management": "Be more attentive and make sure your workers are actually doing there jobs",
    "is_current_employee": false,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2026-02-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102738049",
    "rating": 1.0,
    "title": "Run far away as quick as you can",
    "pros": "None that I can think of",
    "cons": "Extremely Inadequate training. Poor upper management. Endless work load. Inability to focus on your job as manager when you spend most of your time on a register during your shift. Always and I mean always short staffed.  Low pay. Massively high turnover and I see why. I could go on for days about the cons...",
    "advice_to_management": "Don't bother. You will burn out rapidly. They don't care about you.",
    "is_current_employee": true,
    "job_title": "Manager",
    "review_date": "2026-02-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102781190",
    "rating": 5.0,
    "title": "Salary  in Dollar general",
    "pros": "great salary and work life balance",
    "cons": "no cons for this company",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "IOS Engineer",
    "review_date": "2026-02-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102758490",
    "rating": 2.0,
    "title": "Meh job",
    "pros": "if you like meeting new people and making friends with regulars then this is something you will enjoy",
    "cons": "corporate will punish for almost anything and will over work you and barely be of help",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2026-02-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102596729",
    "rating": 4.0,
    "title": "Better Days",
    "pros": "The employees at this DG store are nice, friendly, and build relationships with the customers, bring them back everyday.",
    "cons": "While employees are stocking and straightening out the store, it's sometimes difficult to see when customers are ready for check out. They are focused on the task given to them and some customers understand, others are just rude about it.",
    "advice_to_management": "Keep doing a wonderful job satisfying each customers experience!!",
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2026-01-31T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102591976",
    "rating": 5.0,
    "title": "Choose where you want to go each day and do .",
    "pros": "Work at you own pace.No one telling you how to do your job.",
    "cons": "40 hrs a week no OT . Pay for mileage is too low. 8 hr work day .Hourly pay could be better.",
    "advice_to_management": "8 Hr work day is not enough time to get anything done if driving  2 to 3 hrs one way .",
    "is_current_employee": true,
    "job_title": "Field Maintenance Technician",
    "review_date": "2026-01-31T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102653965",
    "rating": 4.0,
    "title": "Outdated review, but good experience",
    "pros": "Welcome and friendly staff, plenty of opportunities to grow.",
    "cons": "Some unsavory customers, as is given in retail positions.\nThe crew I worked with has since left, but the new crew seems friendly too.",
    "advice_to_management": "Nothing to note, but it would be good to train new employees for Fedex packages if they don't already.",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-02-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102739429",
    "rating": 2.0,
    "title": "DG",
    "pros": "Good job to start with after High School, and while in college",
    "cons": "Depending on position you don’t really have any benefits that are beneficial to you as a worker.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2026-02-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102763493",
    "rating": 3.0,
    "title": "Review",
    "pros": "Good hours for part-time position",
    "cons": "Too much for one person to do",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Key Hoder",
    "review_date": "2026-02-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100439581",
    "rating": 4.0,
    "title": "It completely depends on your location and team",
    "pros": "-If you have a good team, dollar general can be a fairly straightforward retail job that offers a broad range of skills needed for day-to-day operations in a relatively friendly work environment. I really liked my team and customers overall, and it offered me an opportunity to get started again after a gap in my resume with consideration for my health issues. They were extremely supportive and I was so thankful for the opportunity; but that only applies to this location, not the broader company.",
    "cons": "-Since staffing is so light as a policy, not only do you juggle many hats at all times, but it can be a safety hazard. (A coworker may not hear you fall or a customer can easily corner you.)\n-Female employees were made to feel unsafe by customers at times and coworkers had to watch each other's backs, as the manager would not ban them unless it happened in front of her. She was often also a victim of this behavior and was trying her best, it was a difficult situation all-around.\n-DG Corp cares more for profits than employee safety and cameras are to catch employee theft, not monitor and document workplace safety/harassment.\n-Shifts were often staffed by 1-3 employees max, with people often opening alone. Corporate limits of assignable hours were cited as a constant issue by management.",
    "advice_to_management": "-Make a formal method of complaint for inappropriate customer interactions to be documented and acted on so this isn't an ongoing issue. It emboldens these creeps when there's no consequence.",
    "is_current_employee": false,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-10-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101647424",
    "rating": 1.0,
    "title": "Hardest you’ll ever work for the lowest you’ll ever be paid",
    "pros": "Fantastic job security because no one wants to work here, for many, many very good reasons.",
    "cons": "Almost everything else.  The company has zero consistency, and does not appear to be serious about improving anything at all.  At this point it’s more of a ponzi scheme.  Their same-store year-over-year growth is around 1%, because when you only build in small towns that do not grow in population, your stores’ customer base never increases, but to attract investment you must show growth.  This is why they keep building new stores.  So they need the investment to build stores, but they need to build stores to show growth to attract investment.  All this means is this company is a “growth” company and not a “retail” company, meaning they do not care about their stores at all beyond the first year, which means they do not care about their employees’ wellbeing at all, so much so that they treat employees as an expense they’d rather not have.",
    "advice_to_management": "Honestly, because it’s a “growth” company and not a “retail” company, keep doing what you’re doing.  It’s up to employees to figure out your game and decide whether or not they want to participate.",
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-12-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102744643",
    "rating": 3.0,
    "title": "Starter Job",
    "pros": "Teaches you about customer service",
    "cons": "There’s little room for growth",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate/Key Holder",
    "review_date": "2026-02-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102724820",
    "rating": 3.0,
    "title": "Save yourself",
    "pros": "it's a job so there's that",
    "cons": "you do everything yourself, clean, run counter, stock shelves, price goods, receive goods",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2026-02-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102618128",
    "rating": 1.0,
    "title": "Delivery driver",
    "pros": "The was beautiful when I first started making  1500 to 2000 a week take home",
    "cons": "I left because they've cut pay down to 1000 a week.",
    "advice_to_management": "This was a back breaking hard job and Dollar General should pay their drivers a higher income for all they do for this company. Pay these guys there due and stop playing with these guys money.",
    "is_current_employee": true,
    "job_title": "Truck Driver",
    "review_date": "2026-02-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102714124",
    "rating": 1.0,
    "title": "Dollar General Wage",
    "pros": "Not many to speak of. Pay is consistent I guess",
    "cons": "No raises. The amount of work you're responsible for there does not equal the compensation. Corporate couldn't care less about the store employees.",
    "advice_to_management": "Not much, no. Have some empathy for the workers",
    "is_current_employee": false,
    "job_title": "Key Carrier",
    "review_date": "2026-02-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102342445",
    "rating": 3.0,
    "title": "Entry level job",
    "pros": "Flexible\nEasy\nDibs on penny items\nMost of the time customers where great.",
    "cons": "Favoritism\nLow pay\nDM was rude\nHigh turnover rate\nMaintenance took forever to fix store issues.",
    "advice_to_management": "Regional and Distric Managers need to stick up for the Store managers more. Most of the time the store managers are having to pull teeth just to get anything done. When the store managers are in a bad mood the associates suffer a lot.",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-01-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102544908",
    "rating": 2.0,
    "title": "Not Great",
    "pros": "What is expected of you is clearly outlined, no surprises or confusion.",
    "cons": "There's not enough time to get things done. You get management duties without management pay or benefits.",
    "advice_to_management": "Poverty wages will never inspire loyalty or hard work.",
    "is_current_employee": false,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2026-01-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102672986",
    "rating": 4.0,
    "title": "Review",
    "pros": "Good way to gain experience\nSteady work",
    "cons": "Hours get cut sometimes\nHeavy work load",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2026-02-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102677560",
    "rating": 4.0,
    "title": "cashier",
    "pros": "chill, easy, funny, flexible, scenic",
    "cons": "pay, hours, certain customers, pay for parking",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2026-02-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102601582",
    "rating": 2.0,
    "title": "Over hire",
    "pros": "Laid back easy tasks and light cleaning",
    "cons": "No training or help next to no hours to give system crashes all the time rude coworkers",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2026-02-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102602180",
    "rating": 3.0,
    "title": "DOLLAR GENERAL",
    "pros": "Daily Pay, Work is easy.",
    "cons": "Demographic of customers leads to the workers being yelled at by strangers.",
    "advice_to_management": "Add Self Pay Lanes",
    "is_current_employee": true,
    "job_title": "Team Member",
    "review_date": "2026-02-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102623129",
    "rating": 3.0,
    "title": "Fine Stepping Stone",
    "pros": "Not many to note, it's a retail job.",
    "cons": "Short staffed on purpose. Low pay. Terrible shifts.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2026-02-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102241162",
    "rating": 2.0,
    "title": "Store manager ruled the roost",
    "pros": "The customers are what kept me clocking in each day. The same faces became Mr or Mrs and helped to keep a friendly smile on my face",
    "cons": "Low, very low pay. Very limited hours per week. Very",
    "advice_to_management": "Put a smile on your face just as we do each shift. Delegate responsibility  to others so maybe u won't look, act, and show how run down you are and feel.",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-01-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102621653",
    "rating": 4.0,
    "title": "Not enough pay",
    "pros": "It’s a job not a career",
    "cons": "Terrible hours and poor mng",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-02-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99728419",
    "rating": 2.0,
    "title": "Could have been better...",
    "pros": "Acquired understanding of store operations such as inventory control, cash handling, and loss prevention. This varied greatly from experience in a big-box store, and it was an interesting change in work atmosphere.",
    "cons": "The job fostered a culture where employees were expected to prioritize the company above all else, leaving little room for independence.\n\nCompensation was limited to base pay, as opportunities for wage progression were not provided or explained.\n\nDespite bringing significant years of retail experience, the role did not provide opportunities that reflected prior skills and contributions.\n\nManagement initially communicated that my role was being elevated; however, the upgrade did not occur, and further explanation was not given.\n\nCompany guidelines were not always fully adhered to at the location level, which affected workflow and expectations.\n\nThere were ongoing issues with morale at the store level, stemming from leadership and communication challenges.\n\nThere were situations where inaccurate assumptions led to misplaced accountability.",
    "advice_to_management": "Acknowledge the skills and background employees bring with them. Providing fair opportunities for wage growth and advancement shows that experience is valued and encourages retention.\n\nWhen discussing promotions, upgrades, or policy changes, clear communication and consistent follow-through build trust and credibility. Employees thrive when they understand the reasons behind decisions.\n\nEnsuring that store policies are followed fairly and consistently helps create stability, reduces confusion, and builds employee confidence in leadership.\n\nA positive work environment depends on open communication, respect, and recognition. Investing in team morale leads to higher motivation and better overall performance.\n\nDemonstrating accountability, fairness, and professionalism sets the tone for the entire team and strengthens workplace culture.",
    "is_current_employee": true,
    "job_title": "Associate",
    "review_date": "2025-09-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102628806",
    "rating": 4.0,
    "title": "Assistant manager",
    "pros": "Easy to learn management position",
    "cons": "Busy store and large trucks",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2026-02-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102628251",
    "rating": 2.0,
    "title": "Review",
    "pros": "Great company to work for",
    "cons": "Do not pay well at all",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Retail Sales Associate",
    "review_date": "2026-02-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102562834",
    "rating": 5.0,
    "title": "Great place to start",
    "pros": "Days off during the week",
    "cons": "Standing all day\nScanning a lot of items\nStocking shelves",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Shift Leader",
    "review_date": "2026-01-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102471726",
    "rating": 2.0,
    "title": "DG Review",
    "pros": "I had a great store manager.",
    "cons": "Skeleton staff. Low pay. Not enough help.",
    "advice_to_management": "Management for store did their best but company really fails in providing an enjoyable job environment.",
    "is_current_employee": true,
    "job_title": "Key Carrier",
    "review_date": "2026-01-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102392983",
    "rating": 2.0,
    "title": "Its a job.",
    "pros": "lucked out on good coworkers. the work itself isnt horrible",
    "cons": "inconsistent hours, making their \"top performers\" take the reins on all the things they cant be bothered to train the rest of the staff on. overworked and underpaid. favoritism in management.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Keyholder",
    "review_date": "2026-01-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102571410",
    "rating": 2.0,
    "title": "Sucks",
    "pros": "Good people to be honest",
    "cons": "Bad pay for what is asked of you",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2026-01-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102469870",
    "rating": 3.0,
    "title": "High tournover",
    "pros": "The pay to effort is not bed",
    "cons": "Anti union, will try to screw you over if\nIt is more convenient than other options",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2026-01-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102014535",
    "rating": 3.0,
    "title": "Hiring Mgr suffered Home Destruction",
    "pros": "Still calling to inform candidates you’re Hired, and continued working herself, said my family all got out, none hurt, I work, to recoup as fast as possible.",
    "cons": "$add, add, add, create more solid bz Mgmnt upward trajectory opportunities",
    "advice_to_management": "🔑Rural America genuinely needs these stores they’re supplying, particularly for the elderly ambulatory &amp; energy conditions that hinder them from 19 mi pkg lot Walmart to 19 mi indoor trek once made it in, DH is providing 💎🔷 Svcs for the elderly",
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-12-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101994433",
    "rating": 1.0,
    "title": "TERRIBLE PLACE TO WORK!!!!!",
    "pros": "None, hours are terrible and you’re expected to finish an entire work week of work in 5 hours, there isn’t any full time and they cut hours and think you can live with that! THERE IS NO HEAT AND THEY DONT CARE BECAUSE THEY WILL DO ANYTHING TO CUT COSTS AT THE EXPENSE OF THE EMPLOYEES!",
    "cons": "Customers are constantly concerned that there is only one person working which is a big safety issue and corporate doesn’t care! If you have to go to the bathroom forget it they expect you to stay at the register! This company is a joke.",
    "advice_to_management": "Manager is great but the higher ups above him are absolutely terrible and useless!",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-12-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102541589",
    "rating": 2.0,
    "title": "Pay more",
    "pros": "Atleast It’s a paying job",
    "cons": "They don’t pay nearly enough",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Keyholder",
    "review_date": "2026-01-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102243431",
    "rating": 5.0,
    "title": "Amazing People",
    "pros": "Great experience at a major company hq. People were great and taught me a ton about corporate finance and business in general.",
    "cons": "Project was somewhat ambiguous but everything about the experience was great",
    "advice_to_management": "Focus in on intern workflow and maybe an excel training class",
    "is_current_employee": false,
    "job_title": "FP&A Intern",
    "review_date": "2026-01-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102470007",
    "rating": 2.0,
    "title": "ok",
    "pros": "There was never a dull moment.",
    "cons": "Short-staffed, higher-ups got all the perks.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Associate",
    "review_date": "2026-01-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102281573",
    "rating": 3.0,
    "title": "Hard work",
    "pros": "Fast paced able to earn weekly incentive bonuses",
    "cons": "They need to have the right people in the zones they are best at instead of always moving them to different zones where they are unfamiliar with the product",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Order Picker",
    "review_date": "2026-01-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101923996",
    "rating": 2.0,
    "title": "District 226",
    "pros": "Really hard to find good things to say here",
    "cons": "Favoritism, greedy company, possible lawsuits just waiting to happen, can but wont follow state law in some cases.",
    "advice_to_management": "GET A GRIP! all these people out here trying to work to make it and you people cant even give enough payroll when we all know its there? WE make you money and you cant acknowledge anything other than managers getting bonuses for the work the team does? A 30% coupon here and there is a joke.",
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-12-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102406574",
    "rating": 2.0,
    "title": "Doesn’t pay",
    "pros": "Store is Clean, nice people,",
    "cons": "Dollar General expects you to do too much for little pay",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Store Associate",
    "review_date": "2026-01-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102408495",
    "rating": 2.0,
    "title": "Good",
    "pros": "Good work friendly truck registers",
    "cons": "All good things to say",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-01-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102265483",
    "rating": 5.0,
    "title": "Great coworkers &amp; atmosphere",
    "pros": "It’s a great culture with great benefits. Very family oriented.",
    "cons": "You may occasionally work evenings or weekends but extremely rare!",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-01-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102065775",
    "rating": 3.0,
    "title": "Ehh",
    "pros": "Laid back atmosphere. Good for a first job.",
    "cons": "Cleanliness, pay.Attracts the wrong group of people to the point its dangerous. Greatful to have had a fellow good employee who had my back or I wouldnt have made it so long.",
    "advice_to_management": "Literally everything.",
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2026-01-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102351969",
    "rating": 4.0,
    "title": "Friendly staff",
    "pros": "-Friendly\n-flexible\n-very helpful peers",
    "cons": "-multiple teams, some miscommunications are bound to happen",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Jr. Designer",
    "review_date": "2026-01-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102097601",
    "rating": 1.0,
    "title": "0/10 Would not recommend",
    "pros": "My experience was the equivalent to slave labor. The store has been upgraded, but what I went through was not normal. This review doesn't reflect on all store, but I have worked for 2 and they have both been terrible.",
    "cons": "Unorganized, bad management from top to bottom, unregulated and employees are 70% of store theft.",
    "advice_to_management": "Do better. Walmart has way more sku's and are larger stores and they run smoothly....take note.",
    "is_current_employee": false,
    "job_title": "Front Line/Cashier",
    "review_date": "2026-01-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102315936",
    "rating": 5.0,
    "title": "Great",
    "pros": "It's a great entry level job",
    "cons": "I wished they had more room for growth.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-01-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102049319",
    "rating": 1.0,
    "title": "Overworked Understaffed",
    "pros": "No pros in the management level",
    "cons": "all these stores are massively understaffed. You’ll find yourself alone at the cash register not being able to do freight or any other tasks. Shoplifting rate is high.  freight never gets put away and is on the floor all the time. Unrealistic goals district manager is unqualified to manage anything.",
    "advice_to_management": "District  managers need to be more realistic about what one person could do in these monster stores.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-01-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101164757",
    "rating": 1.0,
    "title": "Horrible company",
    "pros": "There is nothing good about this company.",
    "cons": "Six days training at another store.  Then sent to my store to manage.  Didn't know much of anything.  Scheduled 25 hours average out of my 48 by myself to run register.  Could not go to the bathroom.  Those 48 hours I was scheduled, only get paid for 40.  They already got 8 hours a week from me.  Call outs, I had to cover.  43 weeks in a row no days off.  Just did 22 days off in a row also.  Could not leave when I was sick, no hours.  Thank goodness no emergencies with my family.  District manger has favorites, dose not return phone calls or texts.  Company does not pay for 6 major holidays.  Stole money because of health insurance.",
    "advice_to_management": "Just don't work here.  They will take advantage of you. District 686 is the worse",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102239651",
    "rating": 4.0,
    "title": "Was a good time",
    "pros": "flexible scheduling, easy work pace, nothing too bad",
    "cons": "there is a low pay",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate/Keyholder",
    "review_date": "2026-01-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102130576",
    "rating": 4.0,
    "title": "Dollar General",
    "pros": "Fun to work at, not much to do sometimes, and the customers are cool most of the time.",
    "cons": "Having to clean the bathroom is not fun.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2026-01-07T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102463368",
    "rating": 1.0,
    "title": "Anything is better than DG.",
    "pros": "There were no pros here.",
    "cons": "Low pay. Expected to be on call.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-01-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102205296",
    "rating": 4.0,
    "title": "Decent place to work",
    "pros": "Manager always listened to concerns\nCoworkers were nice",
    "cons": "Never enough staff for each shift",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-01-12T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97978743",
    "rating": 3.0,
    "title": "Alright - depending on where you go",
    "pros": "Beginner-friendly\nOccasional employee discount coupons\nLenient Dress code",
    "cons": "Damages only done once a week (Not good when you have so much at a time aside from Produce)\nOnly having two people during night shift (usually one cashier &amp; one keyholder with the store needing to be recovered)\nOccasionally sending too-much of one product (sometimes that no one buys / low buyer rate)\nNot removing self-checkouts (especially if your store is a market and adding another register area)\nAmount of products in stock on the DG app being incorrect\nNeeding \"Manager\" signature for DoorDasher receipts (literally no reason for this)\nWasteful (If a case of water comes damaged, we can no longer keep them to have to drink as said by company management)\nSignal-dropping in store (Especially when customers are door-dashing or adding money to cash App)\nNot-so well done operating doors",
    "advice_to_management": "Give stores more hours, allow the hiring of more people, update POS system, increase wages for all positions, have better bathrooms, fix the way breaks are put in/work without rounding up/down, allow cashiers to void, increase pay for working on holidays, more frequent employee discounts, make the flush power in bathrooms stronger (just make the bathrooms better overall), add cameras outside of building for increased safety, make sure the ADS are correct (there's almost always something incorrect with the sales), bigger checkout counter with more space to put bags on the spin thing, Allow manual AC controls, allow employees to listen to their own music (several studies have shown that it increases productivity in workers), actually have a prototype store and make sure the all products can fit on the shelves/pegs comfortably",
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2025-06-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102352783",
    "rating": 1.0,
    "title": "Horrible",
    "pros": "There are no pros working here",
    "cons": "You are definitely under paid and over worked. One day off if you're lucky. No hours to manage a store with.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-01-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102406243",
    "rating": 1.0,
    "title": "Would not recommend",
    "pros": "You gain experience with cash handling as well as computer skills",
    "cons": "Management is almost always terrible, not very flexible",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2026-01-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101889505",
    "rating": 1.0,
    "title": "Never again",
    "pros": "Got experience multi-tasking and working in a fast-paced environment. Met a few members of the community.",
    "cons": "The building was overloaded with freight, and I had a great team. It is impossible to keep up while maintaining the store's appearance and checking customers out. Meanwhile, in the summer it was 90 degrees in the building. An hour to put away milk, but there's no room in the back for it and no room in the front because the freezer was out. The smell of rotten milk is stuck in my nose.",
    "advice_to_management": "Do better.",
    "is_current_employee": true,
    "job_title": "Sales Associate/Key Holder",
    "review_date": "2025-12-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101895053",
    "rating": 2.0,
    "title": "People Are great, Company never gives stores enough resources to do job properly",
    "pros": "-The People you work with are awesome and want to do a good job\n-Can be fast pased but overall pretty steady and relaxing job\n-Not to difficult to learn",
    "cons": "- Perpetually Understaffed\n- Disorganized\n- Expected to pull results out of nothing with no help",
    "advice_to_management": "Hire more people and pay better",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-12-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102136451",
    "rating": 4.0,
    "title": "Management",
    "pros": "They pay upper management well",
    "cons": "Not a good work life balance",
    "advice_to_management": "Make it a fun environment people are stressed",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-01-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102189126",
    "rating": 1.0,
    "title": "Exhausted",
    "pros": "There are no pros to working at Dollar General",
    "cons": "As a store manager you work 7 days awake. At least 10+ hours a day. If I get a day off I get a call from my DM asking when will I be at the store",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-01-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102212993",
    "rating": 2.0,
    "title": "Review",
    "pros": "always have something to do",
    "cons": "job pays minimum wage that’s it",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Customer Service Representative (CSR)",
    "review_date": "2026-01-12T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102182657",
    "rating": 4.0,
    "title": "Ok place",
    "pros": "Very laid back, flexible atmosphere",
    "cons": "Not enough hours or employees",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Team Lead",
    "review_date": "2026-01-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101646331",
    "rating": 3.0,
    "title": "I enjoyed my jib.",
    "pros": "The company provides great benefits . The people are were easy to work with and the customer base was loyal.",
    "cons": "They overlook desiring people that could and would do an excellent job.",
    "advice_to_management": "Look within your stores for people that want to better themselves and give them the respect they deserve. I realize DG platform is to corner low incime areas but that doesnt mean the people or the customers should be treated in the same manner.",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-12-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102128548",
    "rating": 3.0,
    "title": "It was what you’d expect",
    "pros": "Decent pay, simple job requirements",
    "cons": "Inconsistent hours, unclean break room and back areas",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2026-01-07T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101919158",
    "rating": 4.0,
    "title": "Decent job lots of overtime",
    "pros": "Decent I was last overtime was a put away driver never know when it was time to leave but at least 10 1/2 11 1/2 hours",
    "cons": "Normal job still for everybody to complain about but if you work hard, don’t talk too much you’ll be OK",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Warehouse Worker",
    "review_date": "2025-12-20T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102191866",
    "rating": 1.0,
    "title": "I don't recommend working here",
    "pros": "The only good part about working here was the Coworkers that I met.",
    "cons": "The pay was terrible, and the store was poorly run. If you ever work part-time, be careful because they cut your hours out of nowhere.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2026-01-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102148268",
    "rating": 4.0,
    "title": "Good for part time job",
    "pros": "Weekly pay and nice coworkers",
    "cons": "Paid less than 12 an hour",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-01-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102032476",
    "rating": 3.0,
    "title": "Former Store Manager",
    "pros": "If you work hard, it’s easy to grow within the company.",
    "cons": "You usually will have to work many hours and won’t have much time off for family.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-01-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102141446",
    "rating": 3.0,
    "title": "Just okay",
    "pros": "Easy to balance with school",
    "cons": "Not the best management at my specific location",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2026-01-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102100899",
    "rating": 2.0,
    "title": "Don’t do it",
    "pros": "Hour lunch breaks \nGreat food\nClean bathrooms \nVending machines",
    "cons": "Supervisors \nHours \nPassive aggressive coworkers",
    "advice_to_management": "Do bettter",
    "is_current_employee": true,
    "job_title": "Human Resources",
    "review_date": "2026-01-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101708736",
    "rating": 3.0,
    "title": "Fast Paced, Good For Experience",
    "pros": "A good first job. You learn how to multitask, customer service, etc.",
    "cons": "Went through coworkers and managers extremely quickly. No one seemed to like it much outside of myself, and I learned in the end why - the company cares more for itself, than you.\n\nBut make no mistakes, or at least attempt not to, and you shouldn’t have a problem. Tasks are manageable.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-12-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101891313",
    "rating": 2.0,
    "title": "Poor Work-life Balance",
    "pros": "Team was great, everyone was nice/helpful, leadership was supportive.",
    "cons": "Expectations were unrealistic, difficult to set boundaries, amount of work for the amount of pay was not aligned. Each person gets assigned 3-4 regions, but reach region ranges drastically on how many stores they are over.",
    "advice_to_management": "Adjust workload per recruiter.",
    "is_current_employee": true,
    "job_title": "Recruiter",
    "review_date": "2025-12-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101488939",
    "rating": 1.0,
    "title": "got sm experience",
    "pros": "supportive district with 18 stores, 10 of which were all in the next town over and were almost always able to find shift coverage from another store for call ins or emergencies. DM with company for like 23 years or so and so she knows the job and has high expectatons of her SMs .",
    "cons": "Sm overworked. At my lowest (the last month) I work between 55 and 60 hours a week. At my height I worked 107 hours in one week. Dm can be seen as blunt, cold, and to the point with the way she words her comments but her intention is to follow policy and make sure insturctions/expectations are direct and clear.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102083777",
    "rating": 4.0,
    "title": "Good place",
    "pros": "Easy work, friendly people, cool stuff",
    "cons": "Sometimes customers were not very nice",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Associate",
    "review_date": "2026-01-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102096468",
    "rating": 1.0,
    "title": "Awful workplace",
    "pros": "I can’t think of even one",
    "cons": "Most everything, specifically upper management, tons of hours for horrible pay, no one is competent enough to help anyone or even do their own job, they don’t drug test and constantly hire people who are doped up. AWFUL.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2026-01-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102237275",
    "rating": 1.0,
    "title": "What a company",
    "pros": "Meet great customers and people you can share experiences with",
    "cons": "I feel like there is no support system set in place",
    "advice_to_management": "Be a supporter of your people",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-01-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102014513",
    "rating": 3.0,
    "title": "Okay enough job",
    "pros": "Scheduled regularly \nRoutine is similar",
    "cons": "Not a large pay amount in 2020 (last year I was there) \nConstant interruption in restocking",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-12-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102302456",
    "rating": 1.0,
    "title": "Corporate could care less",
    "pros": "It's a paycheck, sort of",
    "cons": "Overworked and under appreciated by corporate.",
    "advice_to_management": "Be realistic with hiring practices.",
    "is_current_employee": false,
    "job_title": "Sales Associate/Key Holder",
    "review_date": "2026-01-16T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102018839",
    "rating": 3.0,
    "title": "Customer",
    "pros": "Flexible schedule, customers okay be just be careful",
    "cons": "Low pay no flexibility with schedule customers okay",
    "advice_to_management": "Please help",
    "is_current_employee": false,
    "job_title": "",
    "review_date": "2025-12-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101618327",
    "rating": 1.0,
    "title": "Crap hours. Part time hours  or overtime. There is no in between or just 40",
    "pros": "Weekly pay, starting benefits, nothing more sadly since new supervision took over/ got moved around",
    "cons": "I do have to say when I started it wasn’t bad with the supervision we had. It’s when the new ones came in it got worse. It is a very sexist work environment and they have favorites who get away with everything. Short hours one week not making over 30 hours. Forced to work overtime outside your availability or be fired the next week. Company expects you to never use the restroom unless your on your break. Some breaks are almost 4 hours apart but they want you to keep drinking water because the warehouse gets hot. There’s no room for growth because they keep changing how they allow you to cross train and push your back further and further seems like the only choice for growth is to get a new job because they are always over staff but somehow short staffed at the same time. Training get pushed around until your points accumulate and then you can no longer train anywhere else for months at a time. Can’t assist other departments or areas of your department because “it’s outside our job” and it messes up your rate but it affects others job functions and flow because half the staff that supports and moves pallets out the way are too busy elsewhere and we have to assist with there functions without any downtime because it doesn’t get approved because keep getting told it’s not in our job function but if we don’t do it, it slows our rate down not there’s. Management is very micromanaging towards the picker mod specifically but will never step up to help when we are behind but they sent our staff to other departments then make us work a mandatory Friday. Around holidays your forced to work wierd schedules which include working Friday and Sundays even though your hired to work Monday-Thursday only. Only two clock in the whole warehouse visible and you get written up for pulling your phone out to look at the time because your trying not to be late to break or you like to see how long your books take but it backfires and they issue you a canal write up even if it’s your first ti",
    "advice_to_management": "Get some empathy courses, stop playing favorites with some workers and actually treat everyone as equals actually work in all the functions in the building and see if you hit rate while being forced water and told not to use the restroom because it’s affecting your rate. Hood manager and supervisors to the no phone in warehouse rules because there on they’re all the time, no option for you to be written up for it cuz you won’t write yourself up. Supervisors stand around talking a lot",
    "is_current_employee": true,
    "job_title": "General Warehouse Worker",
    "review_date": "2025-12-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101891049",
    "rating": 1.0,
    "title": "Great multi-unit experience, not sustainable long term",
    "pros": "Quarterly Sales Bonus, Annual Shrink Bonus, Annual Salary, company car and fuel provided, company phone, company laptop, printer, and tablet provided",
    "cons": "Personal Safety, Employee Safety, inner city homeless trespassers, so many shoplifters, lmpd will only respond to emergencies, interface is useless, stores have 109-120 hours weekly on average, never enough hours for workload, rolltainers are dangerous,  vendors are rude, little accountability in leadership, zero work/life balance",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-12-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102014570",
    "rating": 4.0,
    "title": "Decent job",
    "pros": "Reasonable schedule\nCommute wasn’t to far",
    "cons": "Low pay\nBad customers\nTraffic at certain time of day",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Retail Store Associate",
    "review_date": "2025-12-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101449653",
    "rating": 5.0,
    "title": "Worked at this store for 8 months - a good experience overall.",
    "pros": "The store hours are 8 am - 9 pm and this is good because a closing shift with approximately a half hour to clean and prep the store -- leaves workers enough time for a meal, a shower and a good night's sleep --before returning at opening the next day.",
    "cons": "Very busy at peak times - with 2 check-out lines.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Store Associate",
    "review_date": "2025-11-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102146701",
    "rating": 1.0,
    "title": "Customers were great",
    "pros": "The customers were great and entertaining",
    "cons": "The corporate structure was a joke. My trainer came in visibly drunk and slurring her words",
    "advice_to_management": "Just start over",
    "is_current_employee": true,
    "job_title": "Store Mansger",
    "review_date": "2026-01-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101969814",
    "rating": 5.0,
    "title": "Good",
    "pros": "Advantages for raises, we all worked together",
    "cons": "Hard working hours, it was a commission job",
    "advice_to_management": "Pay us better",
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-12-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101557669",
    "rating": 2.0,
    "title": "Its a job",
    "pros": "Flexibility in schedule,  if you work at one you can also pick up shifts at other stores to get hours of they need help",
    "cons": "Honestly its really difficult to do what needs done if you dont have a solid team. About 3 days a week im there for 6 to 7 hrs by myself.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-11-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101918439",
    "rating": 4.0,
    "title": "Decent first job",
    "pros": "Easy work, good hours, not super late",
    "cons": "Horrible pay and lack of care from management",
    "advice_to_management": "Raise pay",
    "is_current_employee": false,
    "job_title": "Customer Service",
    "review_date": "2025-12-20T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101762832",
    "rating": 2.0,
    "title": "Awful",
    "pros": "Not really any pros it was awful",
    "cons": "Terrible hours, promises rarely kept for employees, inventory expectations were impossible. Couldn't keep decent managers because no good manager would stay and be that taken advantage of by their company.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-12-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102078391",
    "rating": 1.0,
    "title": "Horrible",
    "pros": "Everything was horrible inconsistent and illegal",
    "cons": "Horrible help desk not enough hrs expect managers to work 60 70 hrs a week",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Manager",
    "review_date": "2026-01-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101907369",
    "rating": 3.0,
    "title": "Overwhelming, poorly managed",
    "pros": "Okay pay and available shifts",
    "cons": "Busy and poorly managed, often leaving one cashier to handle long lines",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-12-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101924838",
    "rating": 2.0,
    "title": "ok place to work",
    "pros": "nice mangers and co workers",
    "cons": "not enough employees on shifts",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-12-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102030326",
    "rating": 1.0,
    "title": "Run",
    "pros": "Decent pay but that's about all",
    "cons": "Long hours, constantly on call 24/7, never a true day off, unrealistic expectations for staff",
    "advice_to_management": "Do better",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2026-01-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102002625",
    "rating": 1.0,
    "title": "Anywhere but here",
    "pros": "None what so ever. There are absolutely no benefits working for this company",
    "cons": "Literally from the pay to the employee environment and work place are all problems",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Shift Supervisor",
    "review_date": "2025-12-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101865294",
    "rating": 3.0,
    "title": "Store",
    "pros": "Solid Work I suppose not that much to do.",
    "cons": "Not that much pay but it's to be expected",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Store Clerk",
    "review_date": "2025-12-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_102097092",
    "rating": 1.0,
    "title": "Money",
    "pros": "No pros for this job",
    "cons": "Sucks not paid well at all",
    "advice_to_management": "Grow up",
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2026-01-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101792269",
    "rating": 2.0,
    "title": "Review",
    "pros": "Flexible Hours for any position.",
    "cons": "Dollar General App coupons don't always go through and dollar general isn't obligated to force any discounts generated through the app.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-12-12T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101743321",
    "rating": 2.0,
    "title": "High expectations, low pay",
    "pros": "Paid weekly, very casual atmosphere",
    "cons": "Schedule changes multiple times a week, sometimes hours are deducted for lunches or breaks not taken, high expectation with minimal compensation",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2025-12-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100683890",
    "rating": 2.0,
    "title": "Typical part-time",
    "pros": "Good co-workers\nDecent pay\nWeekly schedule",
    "cons": "Terrible management wanted us to put away 4-5 metal rolling containers of stock in one night (that's about 6 totes full of stock items per-cart) and fired me without even letting me know, I was just all of a sudden not being scheduled and then my login stopped working one day.",
    "advice_to_management": "When y'all get behind on shelf stocking don't take it out on your employees and assign them impossible tasks and then decide to fire them for not completing said impossible task and not tell them about it, don't do that, communication is KEY.",
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-10-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101742174",
    "rating": 3.0,
    "title": "Not bad. Not Great.",
    "pros": "Good office location and office space. Great people to work with.",
    "cons": "Bad pay and lack of clear communication from C suite.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sr Global Inventory Analyst",
    "review_date": "2025-12-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101493129",
    "rating": 3.0,
    "title": "Low Pay and High Expectations",
    "pros": "Engaging Team\nActive DM\nClean Environment",
    "cons": "You're a manager without the pay and with 95% of the responsibilities.",
    "advice_to_management": "Spirit Halloween pays more to dress up and play with costumes, plus your only an associate. Pay should reflect responsibilities. DG has a lot or responsibilities.",
    "is_current_employee": true,
    "job_title": "Key Carrier",
    "review_date": "2025-11-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101631879",
    "rating": 3.0,
    "title": "Not Bad, great for high school employment",
    "pros": "Weekly Pay, Thanksgiving “Extra Pay”",
    "cons": "Same thing everyday, typical cooperate job with lots of dumb policies, not great pay and little room for advancement.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-12-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101120762",
    "rating": 1.0,
    "title": "Deplorable store conditions",
    "pros": "The pay was good after 18 years of terrible stress and back breaking work with a tiny staff due to corporate greed.",
    "cons": "After 18 years the company has gotten so much worse and so embarrassing to work for as most stores are  in deplorable conditions .Even after my last store in Venice was remodeled. It was a dirty disaster and  I  was expected to open with filthy and dangerously slippery floors after so called remodel.",
    "advice_to_management": "NONE District and  Regional managers dont listen and dont care about  you or store teams .",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101070442",
    "rating": 4.0,
    "title": "Great place to work",
    "pros": "Good money straight out of CDL school, but you are definitely earning it through 100% touch freight.",
    "cons": "Lots of back roads and rural driving. \nThey don't always salt driveways at stores for deliveries during the wintertime.",
    "advice_to_management": "Listen to drivers, especially when they feel uncomfortable about something. We are the ones on the road, and we would like to make it home to our families.",
    "is_current_employee": true,
    "job_title": "Class A Truck Driver",
    "review_date": "2025-11-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101956569",
    "rating": 1.0,
    "title": "Not worth it",
    "pros": "Great benefits\nRegulars\nSome great upper management",
    "cons": "Low pay\nNot given enough hours for employees \nExpected to do it all\nWork over 80 hours week",
    "advice_to_management": "Run",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-12-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101128583",
    "rating": 3.0,
    "title": "Great for a while, don’t anger people in management though.",
    "pros": "Great flexibility, the crew itself is pretty nice, and the store itself is kept a lot cleaner than most others.",
    "cons": "When you make management mad, you get docked hours, and a heavy dose of workplace drama.",
    "advice_to_management": "While I understand why is come cases, playing favorites isn’t the way to keep employees.",
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-11-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101760391",
    "rating": 3.0,
    "title": "Pay",
    "pros": "Schedule was easy to work around",
    "cons": "Pay not enough for the work",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-12-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101671495",
    "rating": 3.0,
    "title": "Bad place",
    "pros": "Weekly pay, yearly raises good district manager",
    "cons": "No work life's balance no promotion",
    "advice_to_management": "Uphold your end of deals",
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-12-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101460183",
    "rating": 2.0,
    "title": "Be perfect at your job and you’ll be ok",
    "pros": "Opportunity for incentive and leadership development program",
    "cons": "Micromanaging and lack of understanding from leadership about realities of the job. Very sexist environment and unfair treatment from HR",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Order Selector",
    "review_date": "2025-11-24T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101665746",
    "rating": 3.0,
    "title": "Okay for first job",
    "pros": "The work is simple and consistent.",
    "cons": "Dealing with rude customers occasionally \nHours are kinda crappy",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-12-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100663414",
    "rating": 3.0,
    "title": "Company management needs qork",
    "pros": "Flexible schedule, per diem, decent middle management",
    "cons": "Little compliance from local management, not enough resources, physically demanding, not enough hours for scheduling store teams",
    "advice_to_management": "Inventory management needs a complete overhaul. Most stores I've assisted with barely have enough hours to keep their locations open, much less stocked and tidy. Some of my stores have as few as 110 labor hours per week and all employees are stressed over not being able to complete necessary tasks. Store managers are burning out.",
    "is_current_employee": true,
    "job_title": "Asistant Manager",
    "review_date": "2025-10-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_9401183",
    "rating": 5.0,
    "title": "District Manager",
    "pros": "This company gives you just about every tool possible to succeed. I have never seen a more patient and focused company in my life. They really give you an opportunity to grow and teach people how to grow. People I have been with this company for going on 7 years and 75% of the people that quit or get terminated would love to come back. You can jump on the Wal-Mart express and believe that they are 'creating jobs' but this company truly is doing thar. They are not shutting down stores, down sizing, and leaving 25-50% of their employees out of luck. Dollar General is changing the face of America and hopefully soon the globe because they improvise for human error already. I feel truly blessed, proud, and determined to work at this company. I came here a young African American man who dropped the competition for personal reasons and knew that I was sacrificing a pay cut. I realized quickly that that money I gave up was nothing compared to the experience and opportunity this company has to offer. I tell anyone that has a sense of pride, stuck behind fear, hope and possibility at this company, it is definitely possible. I worked from the bottom to my current position and to be honest I don't regret a single bit of it. Come experience a real company if you really really want your hard work to pay off.",
    "cons": "None that cannot be outweighed by at least 5 pros",
    "advice_to_management": "Keep up the great work. I am not looking for a raise or accolades this is truly how I feel l",
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2016-01-31T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101525462",
    "rating": 1.0,
    "title": "Bad business",
    "pros": "Absolutely nothing, litterally a pay check.",
    "cons": "Poor communication, hostile, poor pay, no help from corporate with their whats suppose to be a open door policy, they steal your PTO time, managers take advantage of you. Under staffed",
    "advice_to_management": "Do better you know what your doing is wrong yet you dont care all you care about is your huge profit",
    "is_current_employee": true,
    "job_title": "Asisstant Manager",
    "review_date": "2025-11-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101897640",
    "rating": 1.0,
    "title": "Not a good company",
    "pros": "None to list for this company",
    "cons": "Very few hours, lousy pay, terrible working conditions, no security.",
    "advice_to_management": "Nothing positive to add for management.",
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-12-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101666140",
    "rating": 4.0,
    "title": "Solid place to work",
    "pros": "Positive place to work and grow",
    "cons": "Long hours and work balance",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Senior Human Resources Manager",
    "review_date": "2025-12-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98811568",
    "rating": 2.0,
    "title": "MINIMUM WAGE FOR ADULTS ONLY !",
    "pros": "Other staff is nice &amp; easy to get along with",
    "cons": "Minimum wage, can't afford to live but bust butt everyday.  No AC. in summer. Customers walk out. Or trying to fly in n out from heat. It's about 103 in there in summer.  Was told corporate was in control of old thermostat but they want us to suffer? About to pass out????  It's summer! I think actual unit is bad for AC.  It's beyond crazyyy everyday. I got retail to NOT be sweating to death &amp; nauseous daily. \nInsurance- never signed up for, never signed a paper. But 135$ gone from check. Can't get anyone to even give me a booklet, my cards, nothing. So I'm paying it for nothing. \nPlus another random 65$ comes out every week &amp; they say don't know what it is.   I'm loosing 400$ a month.",
    "advice_to_management": "AIR CONDITIONING!!   More easy to get info on your own self &amp; pay.",
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-07-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101094301",
    "rating": 5.0,
    "title": "Great Internship",
    "pros": "Large company. \nOpen to role changes. \nWelcoming environment.",
    "cons": "Half the company is remote. \nIf you are a new hire, you will have to go in person. \nThey have grandfathered in their old employees into their remote policy, however, any new hires will have to move to Goodlettseville.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Intern",
    "review_date": "2025-11-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101298471",
    "rating": 2.0,
    "title": "N/A",
    "pros": "Not really much pros that I can tell you.",
    "cons": "The people were very shady and talked behind others backs. Also, there was old food items on shelves that had mold and stuff.",
    "advice_to_management": "Create a safer environment for the customers and be more professional.",
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-11-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100254504",
    "rating": 2.0,
    "title": "Only if you're desperate.",
    "pros": "• Weekly pay\n• Fast-paced work environment \n• SOME benefits \n• Flexible scheduling (varies by store)\n• Operation time decent \n• Easy to learn",
    "cons": "• Unsupported hours (They decrease hours during holidays and do not supply stores with enough adequate hours to operate a store smoothly)\n• Irresponsible Store Mangers (varies by location, but majority of the time all of them)\n• No consistent scheduling\n• Retaliation \n• Mangers being pinned for \"loss of product\" even in bad areas\n• WORKERS UNDERPAID \n• Favoritism in upper management \n• TIME THEFT for Store Mangers \n• Disregard for employees safety \n• Poor building management\n• ADVISES AGAINST UNIONIZING\n• work life balance\n• START DATE OF PAY\n• holiday pay dates and special pays\n• The stores on fire? Oh it didn't burn down? Just air it out and reopen. Oh, you said you'll literally quit on the spot if you have to do that? That's okay, just close the store.\n• oh you see rat droppings? Just close your eyes and keep going. Oh that product totally didn't come from a moldy fridge with 10 day old spilled milk. \n• nah, your milk was totally not left out way longer than it should have because I'm the only person here who has to stock freezers, and dairy, and run the register. \n\nMORE CONS IN ADVICE BELOW",
    "advice_to_management": "Oh where do I even begin. \n1. Drop the \"unionizing is bad act\" for those who do not know, when you unionize, it means you get treated with respect and DG will be forced to you know, give you a livable wage. \n2. Maybe pay the unconventional pay rate. If everyone else is being paid $15, don't pay some of your employees the actual minimum wage and expect them to be bend over backwards. \n3. Stop penalizing your store managers for the loss of product. What do you expect when you place your locations in low-income areas and have insanely high prices. \n4. Penalize store managers for time theft. They're not always leaving when they should, nor are they always showing up too. Make them clock in like the rest of us. \n5. HIRE MORE EMPLOYEES, minimum of three workers per shift, when people call out, then it becomes a problem which leads me into my next one.\n6. More employees = more coverage, neater stores, less theft. You expect employees to be ringing up customers, leads to stock and also keep on register and expect employees to watch for theft? Wild. \n7. If the store managers get a bonus for their inventory, why don't the employees either? You want your inventory to be better, we'll give your employees who are actually doing the work a bonus too. You guys can give $100 to customers who complain but can't do the same for your employees? Yes I literally WITNESSED this. \n8. ERC/HR is a joke. You have so many automated areas it's genuinely CANT get in contact with the right people. HR will send you to ERC, and ERC would end up confused why HR didn't handle something they can't. \n9. Your HR employees actually f**cking suck. Enough said. \n10. Work-life balance, do you really expect me, and any other employees to cover the store managers a** when it's their job to run their store, but instead they force their other employees who probably just pulled a 7 day work day to come in?\n11. There's a good reason why you guys start your new pay start dates on Saturday and I'm not dumb. It's to deter employees from not working weekends. \n12. Mental health, of you know it's bad when an employee is on the urge of offing themselves and your store managers only concern is who's going to fill your shift\n13. The only time your damn stores are nice is during inventory. I wonder why they are, maybe because you have the district manager, and 4 other store managers AND the normal employees working all at once. Wow shocking. \n14. All employees should accumulate PTO and sick time. End of story. Your full time employees aren't the only ones working full-time. \n15. Easter, Thanksgiving and Christmas? Are you joking? It's crazy how all of these days are religious says, not like fourth of July isn't important when most of your parents or anyone wants to be there. But no, let's let them work normal hours. Or you know, memorial day? What happened to the care of your veterans now? Or let's even talk about labor day, and maybe Juneteenth, and you know what, let's even add NEW YEARS. Cheapskates. \n16. Why is it only your full-time employees get paid automatically 8 hours on holidays and now part-time, even if it's the one day out of 365 days that you're closed, Christmas. Oh on top of that, if the full-time employee wants to pick up a holiday they still get that 8 hours on top of the time-in-a-half? \n17. Overworking your loss prevention and your own district managers is a whole different level of stupid. \n\n\nLet's get to the actual point. Your CEO makes millions and millions of dollars just to underpay your employees, understaff stores, and to give the big bucks to your store managers who either A. Time theft or B. So overworked they mentally break. Maybe change that, food for thought. Health inspections, mandatory. Give your workers the holiday pay of all federal holidays, maybe then they'll want to show up. Restart your paydays on Sunday, this gives store managers the opportunity to work employees EVERY OTHER WEEKEND, give them you know, a break? CLEAN and MAINTAIN a store. Why in the hell is an ASM job to beg the district manager for someone to redo the asphalt and lines in the parking lot? All of your cigarettes should have a pulldown and lock option. Maybe then people wouldn't be so eager to break in, idk. All stores need their panic buttons back. Would have saved me, and my old coworkers from being assaulted. No employees should be by themselves, doesn't matter what time of day it is. 15 unpaid break, and 30 paid if hours are acceptable. Oh yeah, just so everyone knows they definitely are overcharging you. Target and Family Dollar have better and lower prices. On top of that, any family dollar I've been in thus far, it has been so clean and smooth, yes even in the low-income areas. \n\nAt the end of the day, you'll never do this. Because you don't care, as long as you price gouge poor people. Make them so desperate they endure physical and verbal abuse. This is the worse company to work for.",
    "is_current_employee": true,
    "job_title": "Asistant Manager",
    "review_date": "2025-09-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100842572",
    "rating": 1.0,
    "title": "Worst Company",
    "pros": "I wish I didn’t have to leave the minimum one star. There are not any good things other than maybe the coworkers.",
    "cons": "This company will abuse you if you let them or not. They pay very minimum but will work you every day without days off. Sometimes 8+ hours and require you to clock out for breaks but don’t allow you to leave. They don’t have working A/C in the summer. The line gets long and you get sick from the heat. They have all employees sign a heat acknowledgment to cover their …..\n\nThey will have you doing everything from opening, closing, money counting, training over and over bc the turn over is of course very high, checking in vendors, stalking, cleaning, sweeping and mopping the store, the weekly add. putting up a very large cold food truck once a week by yourself. Which is at least a 3 person job. You only have a few hours to do it bc they want you to be out of the store by 10:15 no later. There’s also a once a week truck that brings in tons that you have to get out by the next week and now they have the produce too. This is not everything but you get the idea. You will be doing all these things plus the register which the line is always long and people get hot and grouchy because you’re the only one there to help them. All for $minimum wage. They will tell you that they are going to pay you x amount an hour but do not end up following through. They just hire your replacement and expect you to train them. \n\nThey take advantage of disabled and young employees the most. \n\nI won’t even shop or spend any money there anymore because I can not contribute to it. \n\n You can’t afford a box of uncrustables if purchased from them after working an hour there. Also, if you do shop there make sure you check what you are purchasing. They sale products that are not worth the prices and the expiration dates and food and meds are always past date due to the lack of help and turn over.",
    "advice_to_management": "They already know what they are doing but my advice would be to stop taking advantage of your customers and employees. This company doesn’t deserve to exist at all. Its ways are inhumane.",
    "is_current_employee": true,
    "job_title": "Shift Lead",
    "review_date": "2025-10-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100110150",
    "rating": 4.0,
    "title": "Ok to work for",
    "pros": "The customers satisfaction, working with the right people work is good, pay is okay just depends on available hours, benefits are decent, learn a lot of interesting business information.",
    "cons": "Short staffed at some locations, high turnover, some co workers don’t pull their weight, upset customers when store is not running like it should.",
    "advice_to_management": "Screen perspective employees better, allow employees to fill in at other stores without putting limits on how many hours they work( after all each store has their own set of hours allotted) and assure employees and staff are safe from harm and harassment.",
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-09-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100937398",
    "rating": 3.0,
    "title": "Fast-paced role with unique challenges",
    "pros": "Pros: The position offers exposure to a large national real estate portfolio and frequent collaboration with multiple departments. There are opportunities to learn about site selection, deal negotiations, and development processes.",
    "cons": "Cons: The workload can be demanding and priorities shift quickly. Communication and decision-making can sometimes feel siloed due to the size of the organization.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Real Estate Manager",
    "review_date": "2025-10-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101534231",
    "rating": 5.0,
    "title": "Great benefits",
    "pros": "Provided with everything you need to succeed",
    "cons": "Fast paced environment, a lot of turn over.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-11-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99647759",
    "rating": 2.0,
    "title": "Dollar General, don't waste your time....",
    "pros": "Weekly pay as well as daily pay if you choose",
    "cons": "Being a full time employee , I had to work 6 days to get my hours because of the short shifts. Employees are asked to do a substantial amount of work ,effort , and still manage to keep customer relations. The pay is not good at all , I can't speak but for all but my area it was very unsubstantial. You bend over backwards to accommodate and not be insubordinate and it's not appreciated or acknowledged in any way .",
    "advice_to_management": "Take better care of the employees, we are what keeps those stores moving , the cashier's or sales team do most of the work with absolutely no reward .",
    "is_current_employee": true,
    "job_title": "Sales Lead/Key Holder",
    "review_date": "2025-08-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101427318",
    "rating": 1.0,
    "title": "Cut hours, no feedback",
    "pros": "I'd love to share positive feedback, if I had any.",
    "cons": "Despite my ongoing attempts to question why my hours were being cut and the manager's promises to amend the issue, My hours never got raised, and even got cut to zero without explanation as to if I was doing something which might be affecting my hours.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2025-11-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100656232",
    "rating": 2.0,
    "title": "Not the worst job ever but wouldn't recommend.",
    "pros": "Decent amount of hours, very polite customers sometimes, good finds before all the customers get them.",
    "cons": "Very poor management communication, a lot of theft goes on, you have very ignorant customers that often try to make you upset, no raises, typically can't get a break depending on the store due to only one cashier yourself only being available and the line is insanely long.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-10-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100966989",
    "rating": 1.0,
    "title": "Toxic Management",
    "pros": "Part time hours should be flexible",
    "cons": "Poor management is the worst part of this job. Small town location, customers are generally pleasant and the workload is manageable but for high turnover rates due to poor management of this location. Corporate should listen to the multiple complaints issued for this reason. A job you can transfer to another store but for toxic management.",
    "advice_to_management": "Find another career path. We all know you dislike your role but you make everyone else feel the same way.",
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-10-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101424448",
    "rating": 3.0,
    "title": "It's aight",
    "pros": "Fairly easy job, get to know a lot of locals.",
    "cons": "Standing on your feet for up to 8 hours a day.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-11-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101776036",
    "rating": 1.0,
    "title": "Not for you if you have a family",
    "pros": "Getting to interact with the public",
    "cons": "Doesn't care if you have a family to take care of",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-12-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101452981",
    "rating": 4.0,
    "title": "Good when in need",
    "pros": "Flexible hours and decent scheduling",
    "cons": "Pay is somewhat low when compared to competitors",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-11-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101869152",
    "rating": 1.0,
    "title": "Sucks",
    "pros": "The customers can be great.",
    "cons": "The pay sucks for everything you have to do.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Store Manager",
    "review_date": "2025-12-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100410014",
    "rating": 3.0,
    "title": "Pay and work",
    "pros": "The pay is very good especially if your young and new to Trucking. You get paid per mile and per stop with I easily averaged 350 to 450 a day.",
    "cons": "The unloading was a bit much sometimes. The division out of Westville, IN was refers so there were rolltainers that had to be offloaded with wasn't bad because they were on wheels but the frozen part was hand unloading and could give you a pretty good workout.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Regional Driver",
    "review_date": "2025-10-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101588417",
    "rating": 1.0,
    "title": "Bad Experience",
    "pros": "Absolutely none, I'd put nothing if I could",
    "cons": "Having to work multiple stores to make money\nManagement is either lazy or doesn't care\nStores are dirty or cluttered\nCheaply made items",
    "advice_to_management": "Treat your Sales Associates better, please",
    "is_current_employee": false,
    "job_title": "Bad Experience",
    "review_date": "2025-12-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101473824",
    "rating": 5.0,
    "title": "nice",
    "pros": "good management styles in the store",
    "cons": "sometimes can be very busy",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-11-24T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101450344",
    "rating": 3.0,
    "title": "Good pay, poor flexibility",
    "pros": "Good pay, multiple shifts, opportunities for advancement.",
    "cons": "Flexibility for work life balance",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Warehouse Associate",
    "review_date": "2025-11-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101018894",
    "rating": 1.0,
    "title": "Avoid at all cost",
    "pros": "There is nothing beneficial to work for this store location or this district.",
    "cons": "Used employees , not compensated for any gas mileage, was the only key holder that had no vehicle rode to work with Uber and it was the closest store to my house but they'd want me to travel rather other key holders knowing it was effecting my paycheck every week",
    "advice_to_management": "Management reevaluation , people skills, get some common sense",
    "is_current_employee": false,
    "job_title": "Key Holder",
    "review_date": "2025-11-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101219317",
    "rating": 2.0,
    "title": "Unrealistically high expectations",
    "pros": "Job security for the most part",
    "cons": "High expectations for very little pay, constant changing priorities, reactive vs proactive leadership, micromanagement, employees not treated well and seen as replaceable",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2025-11-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101491336",
    "rating": 2.0,
    "title": "meh",
    "pros": "Depending on the store, coworkers are awesome",
    "cons": "Unrealistic expectations and severely understaffed",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Keyholder",
    "review_date": "2025-11-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101449445",
    "rating": 2.0,
    "title": "Don't do it",
    "pros": "Customer engagement and room for advancement",
    "cons": "Lack of support from higher ups",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99988589",
    "rating": 3.0,
    "title": "Good for a short time or secondary job",
    "pros": "Paid weekly, Routine, All responsibilities are very easy to learn and complete",
    "cons": "Corporate will randomly cut hours for your store, no matter how well your store is doing. Even if you're full time, you may end up randomly working less because of company cut backs. Theft is common. Alot of work expected to be completed in very limited time. Company definitely cares more about their bottom line then their workers.",
    "advice_to_management": "There needs to be a better HR set up in order to report harassment and unprofessional managers.",
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-09-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101286159",
    "rating": 3.0,
    "title": "Good first job",
    "pros": "If you’re just needing a first job and something simple this would be good for you",
    "cons": "Staffing is always a struggle",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Team Leader",
    "review_date": "2025-11-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101484919",
    "rating": 3.0,
    "title": "Review",
    "pros": "Easy\nMostly chill\nNot too hard",
    "cons": "Hours\nWorking alone sometimes\nDirty bathrooms",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-11-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100734043",
    "rating": 2.0,
    "title": "Everything it's true",
    "pros": "Convenient to get to it's in middle of town",
    "cons": "Understaffed overworked underpaid and always put down you can never do enough they're never happy slim chance of promotion and even with promotion have to fight to get the raise store managers are never there but claim they do all the work",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Asm Assistant Store Manager",
    "review_date": "2025-10-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101361370",
    "rating": 5.0,
    "title": "DG",
    "pros": "Work life balance is decent",
    "cons": "Pressure to continously develop talent",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-11-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101016679",
    "rating": 2.0,
    "title": "Meh",
    "pros": "Right district, region, staff and customers can make a difference.",
    "cons": "Your store is treated like a glorified warehouse\nBare bones minimum for hours given to operate the store, but still expected to maintain show room quality appearance",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_96605400",
    "rating": 2.0,
    "title": "It's Fine",
    "pros": "Whether you are looking for your first job or something on the side it is fine getting into, the work is not difficult and the atmosphere is generally laid back. The majority of the people you work with should be fairy laid back and easy to get along with to help build a strong culture. So long as you are proficient you can work at various locations and be compensated for travel, though in some districts those opportunities are harder to come by.",
    "cons": "The company is not afraid to outsource for positions of District Manager or greater, and so mobility can be rather stagnant at times. Additionally stores are occasionally under budgeted for working hours, as they have a system in which certain positions essentially get counted as a 1 and 3/4 person, so some peak business hours can feel understaffed as a result. Stores also have not received additional scheduling hours to compensate for the removal of self checkout from nearly a year ago. Associates don't receive much communication beyond their store managers as well, leading to a disconnect between District Managers and those at Assistant Store Manager and below.",
    "advice_to_management": "Promote from within and budget more hours for store locations that relied on self-checkout prior to its removal. Have consistent standards of each store within districts.",
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-04-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101268746",
    "rating": 2.0,
    "title": "Company Doesn't Care About Employees",
    "pros": "Easy work, simple interview process, nice coworkers",
    "cons": "Company policies that aren't flexible. View employees as disposable.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Retail Sales Associate",
    "review_date": "2025-11-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101160023",
    "rating": 2.0,
    "title": "Bone grinder",
    "pros": "Easy to get the job",
    "cons": "They will take advantage of your desperation for least pay",
    "advice_to_management": "Treat customers like humans, not your poverty profit class",
    "is_current_employee": true,
    "job_title": "Department Manager",
    "review_date": "2025-11-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101169938",
    "rating": 2.0,
    "title": "There's a reason they're union busters",
    "pros": "It's a job... all I can say.",
    "cons": "Nowhere near enough pay or hours given to stores.",
    "advice_to_management": "LET YOUR WORKERS UNIONIZE",
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-11-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100425255",
    "rating": 1.0,
    "title": "Favoritism",
    "pros": "The customers thats basically it",
    "cons": "Manager, co workers, favoritism,  wrongfully termination, no gratitude,  no appreciation, talking bad about workers behind there backs back stabing, and list goes on and on to much to list hare.",
    "advice_to_management": "See people for there hard work doesn't matter if you don't like the person or not hard work is hard work don't get read of the number one worker keeping you afloat for no reason the managers should have a legitimate reason to fire you  like theft or something thats actually a problem for the store or company not being able to fire you just because you don't like them and say it's insubordination and HR really needs to get both sides because the managers lie to get there way and to someone they don't like out of there even if they have been there longer then the new manager and know more then them and do there jobs very well we need to be like it's supposed to be work your butt off move up and be recognized for it not work your butt off and get fired for doing everything your supposed to by the book and them some DG we need you to do batter. And don't put people on the no higher list that don't deserve it I didn't deserve it I could have went to another one ware i was a better fit but the no higher list has stopped that and ruined my hole life lossing my home cant eat or feed my elderly dog theres no jobs around hare and the ones that are hare won't higher me because that and the lie of a insubordination I never did anything wrong at all just asked why my hours got dropped thats all it's not right",
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-10-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101291701",
    "rating": 5.0,
    "title": "Mantenimiento",
    "pros": "Mantener el trabajo en tiempo",
    "cons": "No permitir que se mantenga desorden",
    "advice_to_management": "Siempre optimista",
    "is_current_employee": true,
    "job_title": "Empleada de limpieza",
    "review_date": "2025-11-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101170195",
    "rating": 4.0,
    "title": "Alot of work",
    "pros": "Day shift go in early get off early",
    "cons": "Produce is a hassle you have so much to throw away",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-11-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101292328",
    "rating": 5.0,
    "title": "Great Place",
    "pros": "Good training and working environment",
    "cons": "Hours can fluctuate due to staffing",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-11-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101174007",
    "rating": 4.0,
    "title": "Decent pay",
    "pros": "Able to work around my school schedule",
    "cons": "Difficult to get a lot of hours on weekends",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Key Holder",
    "review_date": "2025-11-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101171188",
    "rating": 3.0,
    "title": "Needs improvement",
    "pros": "Flexibility\nand good team\nNo difficulty",
    "cons": "Disorganization\nStore was in many problems regarding storage",
    "advice_to_management": "Needs better storage and stock system",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-11-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100795677",
    "rating": 3.0,
    "title": "Job satisfaction = dependent on direct management",
    "pros": "Laid back easy job &amp; first access to sale items",
    "cons": "Discriminated against for being a heterosexual woman , poor management",
    "advice_to_management": "More actively involved district managers would assist in individual store staffing experiences",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-10-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101552144",
    "rating": 1.0,
    "title": "A job for now",
    "pros": "Customers are nice\nThat’s it",
    "cons": "Too much is expected to be done with no help or payroll to get help",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101629357",
    "rating": 1.0,
    "title": "too much",
    "pros": "none at all except not unemployed",
    "cons": "salary low. work life balance not possible. demanding leadership",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-12-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101192641",
    "rating": 3.0,
    "title": "Alright",
    "pros": "Easy job to do while also going to school",
    "cons": "Manager was not very understanding",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-11-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100623515",
    "rating": 4.0,
    "title": "Mixed feelings",
    "pros": "Always room to grow, fast pace job, people work together and good management support.",
    "cons": "No work life balance, hours are cut short and can be a safety hazard.",
    "advice_to_management": "Put money into creating a work safe environment and more hours per store to have more employees.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98200907",
    "rating": 2.0,
    "title": "Toxic and lacking integrity",
    "pros": "The role was never too challenging nor engaging.  The company has a professional environment with a basic benefits package.",
    "cons": "My experience was marred by a significant breach of trust from leadership. I was actively encouraged by my manager and Sr. manager to apply for a role in another department, receiving weeks of support and well-wishes during the interview process. I confirmed with the hiring director that I was selected to move forward, only to be blindsided by my leadership team placing me on a performance improvement plan (PIP) to block my transfer a few days later. It became clear my management team leveraged their connections with HR. These are not trustworthy people nor is the department. There's a reason this role has had roughly 8 people over the last 5yrs.\n\nThe role is not hard, but working for this leadership team can be very unhealthy. I would highly advise you look elsewhere.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "SALES & CASH AUDIT ANALYST SR",
    "review_date": "2025-06-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100590942",
    "rating": 2.0,
    "title": "If you want grey hairs and vericose veins by the time you leave.. this job is for you!",
    "pros": "I loved my coworkers and the manager the 2nd time I was employed.",
    "cons": "Stressed out daily.\nNever really had any time to spend with my kids because I never really had a day off..",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate/Key Holder",
    "review_date": "2025-10-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100790797",
    "rating": 2.0,
    "title": "Bad company to work for",
    "pros": "Wasn't too physically demanding, was walking distance from my house",
    "cons": "Poorly run. My first manager got fired shortly into my start at the store. Eventually, my hours got cut to just 4 a week.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Associate",
    "review_date": "2025-10-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101033318",
    "rating": 3.0,
    "title": "Eh",
    "pros": "Its a job. It is not hard.",
    "cons": "The responsibility is going to be very dependent on the manager of yor location.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2025-11-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101064390",
    "rating": 4.0,
    "title": "Dollar General",
    "pros": "Decent coworkers, easy to call out if needed",
    "cons": "People dont know how to use the digital coupons.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "",
    "review_date": "2025-11-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100908852",
    "rating": 2.0,
    "title": "Don't do it",
    "pros": "Convenient location considering they're basically everywhere",
    "cons": "Over worked and under paid.",
    "advice_to_management": "Pay more, or hire more people instead of putting unrealistic expectations on employees at busy stores.",
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-10-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101468617",
    "rating": 1.0,
    "title": "Just no",
    "pros": "I don't think there are any pros.",
    "cons": "Terrible pay, no benefits, bad hours. Avoid at all costs if you need something reliable",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-11-24T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101080862",
    "rating": 3.0,
    "title": "Depends",
    "pros": "Paid weekly\nDiscounts\nVacation hours",
    "cons": "Stressful\nLack of hours for store\nNo work life balance",
    "advice_to_management": "We are humans, not machines",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100165732",
    "rating": 1.0,
    "title": "WORST COMPANY EVER!!!",
    "pros": "NONE! ZERO! BIGGEST TURN OVER RATES EVER BECAUSE OF HOW POORLY MANAGMENT, HIGHER UP MANAGEMNT AND HR ARE!",
    "cons": "Minimum wage for the work of 5 people, never enough staff, ordering system is VERY flawed so you ALWAYS have WAY TO MUCH STUFF and no where to put it, constant expiring things due to overstock, treated like you don't matter, screamed at in front of customers, managers who don't show up or even open the store or answer their phone. Drugs and hostility reported to District manager only to have nothing done. Not safe! NOT WORTH IT",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-09-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101068497",
    "rating": 2.0,
    "title": "Ok",
    "pros": "Easy, not a lot of paperworw, nothing overly complicated",
    "cons": "No help, no hours, sometimes no days off",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-11-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100983488",
    "rating": 2.0,
    "title": "Upper Management Doesn't Care",
    "pros": "Flexible Work hours\nDecent Stocking Training",
    "cons": "Constantly Understaffed\nStore Managers always under pressure from Upper Management",
    "advice_to_management": "Actually take care of your workers",
    "is_current_employee": false,
    "job_title": "Keyholder",
    "review_date": "2025-10-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101051921",
    "rating": 4.0,
    "title": "Pay is great.",
    "pros": "Pay is great. Company car. Stock options.",
    "cons": "Work life balance could be better",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-11-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100663760",
    "rating": 4.0,
    "title": "I enjoyed this",
    "pros": "If you’re willing to work at several stores you will get all the overtime you can eat!",
    "cons": "Your superiors super don’t know what benefits are extended to everyone",
    "advice_to_management": "Review the employee handbook before giving advice",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-10-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100786083",
    "rating": 3.0,
    "title": "Hard work",
    "pros": "Some people were great to work with.",
    "cons": "Zero work/life balance. Non stop phone calls, LP issues HR issues, all on the DM.",
    "advice_to_management": "Great learning experience but a lot of work.",
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-10-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100887701",
    "rating": 3.0,
    "title": "Everyday all day",
    "pros": "Customers are pretty nice and work is ok if staffed correctly",
    "cons": "Over worked &amp; underpaid. Not appreciated for the work you do",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Asst Manager",
    "review_date": "2025-10-26T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100475987",
    "rating": 2.0,
    "title": "Cuts hours, upper management makes things harder on lower level workers",
    "pros": "Work culture\nRelatively easy work (If you have enough workers)",
    "cons": "Lack of hours\nExcessive workload\nNot enough workers",
    "advice_to_management": "Don't make things harder on your lower level workers by refusing to let them use basic tools that would greatly improve efficiency.",
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-10-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99078404",
    "rating": 3.0,
    "title": "Decent if you don't mind balance between work and life",
    "pros": "- Many hours for this position \n- You can try to negotiate higher pay \n- Holiday pay and vacation days after 3 months in the position",
    "cons": "- Overworked to the max, always called in or being bothered on your days off \n- It's never a guarantee for days off even if you request it off weeks in advance\n- Pay is okay but depends on where you're located and how well your manager fights for you \n- Corporate is always on a roll with everything and anything, there's always rules changing",
    "advice_to_management": "Listen to your employees more, do better in the management and humane department.",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-07-31T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99351988",
    "rating": 1.0,
    "title": "Run",
    "pros": "A paycheck that's all you really get in return.",
    "cons": "Zero work life balance. You will always be shorthanded. They pile sale promotions and deliveries to happen all at once. Throw a perishable load in 3 hrs or less while running the register then change the ad with 200 plus tags. Expect to be swimming in freight and modular resets. I cannot recommend this place to anyone. Take the job only to bridge a gap to something better. You have been warned!",
    "advice_to_management": "Give the store labor hours to staff it for success. Actually reduce the price of discounted items to get them out of the store. Customers know it's full price with a clearance sticker. Fire Driveline and give the labor to your crew before the reset not after the fact.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-08-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99367775",
    "rating": 1.0,
    "title": "Overworked, low pay",
    "pros": "Can't think of any; didnt even get an employee discount.  Instead, loss prevention lectured us that 70% of store theft comes from employees; meanwhile I watched customers steal from us every day because they knew we were understaffed and stuck on register and nothing to do about it.",
    "cons": "Too many negatives to list. As assistant manager I was also required to help (slow) cashier whenever there were more than 3 people in line... even on my unpaid lunch break.  Despite labor law saying I should have a 30 minute uninterrupted lunch break.  Also had to answer phone for random questions during lunch break, and perform merch returns during lunch break as Im the only one there that can do that (cashiers cannot) on my lunch break.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-08-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101019947",
    "rating": 2.0,
    "title": "Omg stop making me review",
    "pros": "The customers are nice I guess",
    "cons": "My manager was mean not nice",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-11-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99697942",
    "rating": 2.0,
    "title": "Laid back environment",
    "pros": "It was laid back mostly. Close family type of interactions with coworkers and customers. Leniency to take smoke breaks and no multiple managers at your back",
    "cons": "Having to do  multiple peoples jobs at once in the time span of half of what it would take if multiple people to fid actually do it.",
    "advice_to_management": "Don’t complain about stressed employees if you’re not supplying enough hands to do your job and make YOUR money for 5% of what you make per week",
    "is_current_employee": false,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-08-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97837456",
    "rating": 3.0,
    "title": "Dollar General hates their employees",
    "pros": "Having a job\nWeekly Pay\nPOS is easy to learn/User Friendly",
    "cons": "The unbelievable amount of Items thrown into the garbage,  when most items are perfectly good and could be given to employees or even the homeless or shelters or Charities.. somewhere other than the trash. They make enough money they should be able to do this honestly.\n\nExhausting amount of responsibilities. \n\nGoing out of their way to stop the penny Shoppers from succeeding in there Quest. They'd rather throw it on the way than to sell them for a penny. Which to me the penny shoppers create tons of additional advertising.\n\nNo employee discount...well one day a year.... but that's bs.",
    "advice_to_management": "None for instore management.  He has enough on his plate. Upper management needs a reality check when it comes to the amount the amount of hours managers are required to work vs. The amount of responsibilities vs. Payroll hours allowed .",
    "is_current_employee": true,
    "job_title": "Assistant Store Manager",
    "review_date": "2025-06-05T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100993720",
    "rating": 3.0,
    "title": "DG employee",
    "pros": "Being able to assist the customers",
    "cons": "Pay should be more than what it is",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-10-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_95615729",
    "rating": 1.0,
    "title": "Work life balance… none!",
    "pros": "VP is smart, appreciative, and approachable. Employees are great and eager to help new hires. Decent pay and flexibility",
    "cons": "Loved what was doing…. At first. Promised 2 months training to learn the process and responsibilities to perform my job. 3 weeks after my first day, I was told that training isn’t going to continue. No better way to learn than to be thrown in head first. That’s fine, Ive been there before. My director threw me in head first with an anchor tied to my neck. Never had a chance to come up for air. Worked every weekend sometimes from 7am till 1am. Not a typo. My “leader” was too scared to tell their boss or other directors “no”. Always saying “yes” to every request regardless of how much it buried the team. Then would be all nice during Teams calls while others were online. Then ask you to stay on after the call and their whole demeanor changed from nice to condescending, blaming, accusing you of lying or not doing enough. Berate, berate, and berate. Made to feel stupid after just a few weeks. Most people at DG are great. Can’t say the same for my “leader”. Unapproachable and accusatory. Benefits are some of the most expensive around. And most meds are not even covered.",
    "advice_to_management": "Ask people why they are walking away from a job they are definitely qualified to do. Some “leaders” are in their position because of their knowledge, not because of their leadership qualities or people skills.",
    "is_current_employee": true,
    "job_title": "Sr Analyst - transportation ",
    "review_date": "2025-03-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_95106072",
    "rating": 1.0,
    "title": "No supervision, easy to milk, policies not inforced",
    "pros": "as a key or manager you pretty much can do whatever you want with no ramifications, and correct your own times. They are desperate enough for employees, they will believe whatever you tell them and never really look into it. you can vape in the store and get high in the lot and they wont say a word because they cant keep people. easy way to milk pay without real effort.",
    "cons": "DM and above treat employees poorly, belittle them and dont care about their work life balance and expect impossible results, but cant support it. Their HR process is nonexistent, if it worked, i wouldve been fired and finally on unemployment. Everything has went so downhill and shady and not just in this store, but also the ones in immediate area as family connects us all, the DM doesnt give a damn as long as store stats are good and you dont mention the policy violations. several of us used to like this job. RM and DM changes, its went very trashy and ghetto very quickly. Cant beat them join them right?",
    "advice_to_management": "Dont pick and choose which policies to follow, or which employees must follow. All same standards. If the work isnt being done, hold them accountable. If customers complain, listen. When you dont care we dont care. Half my family works for the same company, your a bad company because you do nothing about those that learned to manipulate store info, refunds, shortages and budgets for our personal gain which we are entitled to due to your treatment.",
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-02-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101405404",
    "rating": 1.0,
    "title": "Horrible Pay, Callous Management",
    "pros": "Literally none to speak of.",
    "cons": "Horrible pay. Terrible upper management. Nobody cares here. Please, work anywhere else.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-11-20T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100958701",
    "rating": 5.0,
    "title": "Good job",
    "pros": "Employees \nTeam\nEnvironment \nFramework\nPay",
    "cons": "Amount of work with no proper guidance \nAlways changing requirements",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Agile Project Manager",
    "review_date": "2025-10-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_94521888",
    "rating": 2.0,
    "title": "Company doesn't care about its employees",
    "pros": "There are good people at the company, and it's consistent and stable. Flex scheduling makes it possible to manage life to some small degree, though it's not as good as it was when the company was work from home.",
    "cons": "Company operates on a lean, skeleton crew ideology. There is never proactive staffing for growing business needs. The company has refused to pay bonuses for 2 years despite record breaking profits of over 1 billion. The company does not make cost of living increases, and annual pay raises are arbitrarily assigned and can be as low as .5%, or refused entirely. The company participates in union busting efforts and recently forced a mandatory return to office despite the fact that nearly all corporate employees had been WFH for 5 years. When I started at the company, their salaries and benefits were competitive in the market, but they have failed to keep up with cost of living. They also have recently begun \"cost saving\" layoffs, despite being on track for over $1 billion in profits.",
    "advice_to_management": "Lower management at the company is supportive and cares, but upper management either doesn't care about the rank and file, or they are being forced to enact harmful decisions by the board. Employees need a living wage, and if the company continues to show that it doesn't value its employees, it's going to lose all of its talent.",
    "is_current_employee": true,
    "job_title": "HR Coordinator",
    "review_date": "2025-01-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100913364",
    "rating": 3.0,
    "title": "Pay",
    "pros": "Alright place to work at",
    "cons": "Work life balance can be off",
    "advice_to_management": "Strive to be better each day",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-10-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100433814",
    "rating": 1.0,
    "title": "Sub par",
    "pros": "Very interesting to work for",
    "cons": "Very weird scheduling no hours to give employees too much work is expected but once truck comes they're expected to get the whole truck out in like 48 to 72 hours but they send so much stuff that they're so there's a lot of backstock and then they complain about having back stock to the point that you can get your store shut down or wrote up",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-10-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98323348",
    "rating": 2.0,
    "title": "A shame…",
    "pros": "When there, my district manager. Benefits were average",
    "cons": "Overworked, not enough staff, not enough allocated hours for support.",
    "advice_to_management": "If you plan on entering as a GM, realize that DG is the front runner on “the most controllable line on the P&amp;L is labor” execution. You’re expected to run a store, show increases Y over Y, keep an organized store and hire. Problem? Not enough allocated hours in a week to hire what you need and provide enough incentive to have people want to stay, let alone enough hours to accomplish your job responsibilities. The best part of my tenure was my DM. He has since left…realized the same things. He was awesome and was the only reason I even considered staying at the time. And work-life balance is a Turkey shoot at best.",
    "is_current_employee": true,
    "job_title": "General Manager",
    "review_date": "2025-06-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100738098",
    "rating": 4.0,
    "title": "Great",
    "pros": "Nice environment. Good people employees and customers.",
    "cons": "Stocking setup is terrible and takes a lot of time the way they distribute everything to be stocked.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-10-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100927437",
    "rating": 4.0,
    "title": "front end",
    "pros": "i like to help people",
    "cons": "long hours and being on your feet",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-10-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100780092",
    "rating": 2.0,
    "title": "Former employee",
    "pros": "Company in business over 85 years",
    "cons": "they do not have employees best interest at heart. Customers are more important than employees",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-10-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100104397",
    "rating": 2.0,
    "title": "Last Resort Job",
    "pros": "• You get paid for working",
    "cons": "• Low pay compared to most other retail jobs\n\n• Customers are a real hit or miss— you never know if they will be nice or the rudest person on the planet.\n\n• Honestly, a very gross job. Lots of messes to clean up, including the bathroom that people love to destroy.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Keyholder",
    "review_date": "2025-09-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99904975",
    "rating": 1.0,
    "title": "cooperate does not care about the store employees",
    "pros": "My team and customers were the best part of my job",
    "cons": "No help from up above, demanded more work than the pay was worth. Double standards all the way across the board. No 2 employees were ever treated the same.",
    "advice_to_management": "Treat the employees running the stores better and you would t have a huge turnover. Your a multi million dollar company so pay the employees more. They deserve more. I think each of you should go run a store for a month and do the exact job that you expect",
    "is_current_employee": true,
    "job_title": "Store Training Manager",
    "review_date": "2025-09-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_93716252",
    "rating": 2.0,
    "title": "Hard work, little pay",
    "pros": "The majority of the customers are so friendly and we know each other on a first name basis. Lots of walking helped me shed a few pounds.",
    "cons": "Being an ASM, and the only employee that had young kids, I was to cover all the call outs. Didn't matter when, if it was before or after my shift or on a day off. If I was sick, vomiting, or when my child had lice, I was told \"that's not an excuse to call out of work.\" Constantly running the store alone. Doing the job of 5 people. The yellow guns never work so you might have to check in that vendor 3 or 4 times before it actually accepts it. Just don't make a mistake. If you put in a wrong number and try to change it you'll have to start all over. I was making top dollar, $17.50, as an ASM, being expected to live and breathe DG.... not worth it. I had no time for my kids or myself. They never fix anything! The roof leaked when it rained, the scan gun at the registers barely worked. In the middle of summer both air conditioners broke. Didn't fix it until fall. Even tho corporate has the ac unit set to 78°F for summer.",
    "advice_to_management": "Corporate needs to increase the hourly rate for employees and allow stores to hire more help based on their needs and sales. Quit stretching the good workers so thin, it burns us out quicker. The better you are at your job, the more you get screwed!",
    "is_current_employee": true,
    "job_title": "Assistant Store Manager",
    "review_date": "2024-12-16T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99756754",
    "rating": 1.0,
    "title": "An utter mess at the best of times",
    "pros": "Coworkers can be great, but they won't be rewarded for it\nWorkload can be decent at certain stores\nIt's convenient working at a general store, despite the usually bad prices.",
    "cons": "Coworkers can be terrible, and the company will protect them\nencouraged to do the job of 10 employees in one shift\nZero training, so if this is your first job then good luck\nUnclear workflows, every store does things differently\nCulture is intentionally based around high turnover, they want you to quit.\nYou are never given enough hours as a part timer, schedules flip around from 4 to nearly 30 hours constantly.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-09-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99923494",
    "rating": 2.0,
    "title": "DG management is  not for the weak",
    "pros": "never ending work, stable job",
    "cons": "never ending work, corporate has zero care, fun for the hills, you will work  50-70 hours a week with no over time or help, 7 days  a week and  will have no work  life balance",
    "advice_to_management": "try and treat your team as well as  you can",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100748790",
    "rating": 2.0,
    "title": "Not the place to work",
    "pros": "None unless you like to work all the time",
    "cons": "Left alone alone the time no support upper management",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Training Manager",
    "review_date": "2025-10-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97106456",
    "rating": 1.0,
    "title": "You're worth more than this",
    "pros": "The other people there were hard-working and impressive in all that they managed.",
    "cons": "The way corporate manages hours forces understaffing. We could have enough people to fully staff all shifts, but the manager wouldn't be allowed to schedule enough hours to do so. Corporate changes systems with little to no notice and is carelessly unsupportive to those who run their locations. I applied and was hired as a part-time employee, but by the time I left I was working 40-50 hours as a shift lead, almost always only having one other employee in the store. They still expect stocking, organizing, cashiering, cleaning, on-the-floor assistance, and more to be done constantly throughout each day. I watched managers work themselves to the point of collapse. No one should feel that they are worth so little to deserve a job like this. I worked there for half a year and by the time I left I had the most experience out of anyone still there, with the exception of my manager. People don't last there very long, and it's almost never their fault.",
    "advice_to_management": "It doesn't matter how good the management is when corporate refuses to treat any of you with any decency.",
    "is_current_employee": false,
    "job_title": "Shift Lead",
    "review_date": "2025-05-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99048798",
    "rating": 2.0,
    "title": "This is not a good place to start a future, pay is good but not paid for all things expected.",
    "pros": "Always Home wkly for reset, sleep at stores no need to find parking",
    "cons": "only pay for driving and unloading , no wait time at DC or anywhere , breakdown pay starts only after 2hrs but expect you to perform duties for free , seems the office wants to run the show but needs you to drive for them. Its all about Dollar General, You the employee don't count",
    "advice_to_management": "stop acting like you are there for the driver when the truth is your not",
    "is_current_employee": true,
    "job_title": "Otr Delivery Driver",
    "review_date": "2025-07-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101002041",
    "rating": 1.0,
    "title": "Expected to be superman",
    "pros": "Never a lull in the action",
    "cons": "Stock shelves, but while you don't forget you're running the register. And cleaning the bathrooms. And answering the phone. And ending world hunger. All at the same time!",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-10-31T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100621323",
    "rating": 2.0,
    "title": "Don't",
    "pros": "You'll be trauma bonded with your teammates.",
    "cons": "Overworked. Often worked 9hrs with no break and only person in the store.",
    "advice_to_management": "Don't consider your employees to be expendable.",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99983808",
    "rating": 1.0,
    "title": "Overworked and Underpaid",
    "pros": "Small retail environment that allows you to get to know your regular customers.",
    "cons": "- Not enough payroll to adequately maintain the stores with the given volume of customers.\n- Unrealistic expectations from upper management.",
    "advice_to_management": "Invest more in your stores by providing more payroll and better pay. Dollar General has become the laughing stock of the retail world because of how bad the majority of the stores look. This is because managers are expected to either work 24/7 for no additional pay to maintain the store or let it rot.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100804657",
    "rating": 2.0,
    "title": "Review",
    "pros": "People and environment were amazing",
    "cons": "Pay and hours not so great and favoritism by higher management",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-10-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100630397",
    "rating": 2.0,
    "title": "Job sucks",
    "pros": "Corporate cares abt employees more then local level",
    "cons": "Alot of work for the pay which is.not great",
    "advice_to_management": "Maybe do better at recognizing good employees",
    "is_current_employee": true,
    "job_title": "Fleet Supervisor",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_96860915",
    "rating": 3.0,
    "title": "DG",
    "pros": "Helped me with school, 401k, health benefits.  If you hire the right talent, and work beside them, leading by example, you're job is great!",
    "cons": "Hire the wrong talent, dont lead but manage, you will be miserable. People quit, walk out, get hired and dissappear, and you are short staffed, impacted back room, can't get any help. Always cutting hours. Wont give employees except manager and assistant manager a raise. Never notified for inventory. Work 60 to 80 hours a week, while training 2 key holders and new cashiers, for weeks and weeks. Caused serious health issues, mental and physical. So exhausted you can't hold your eyes open and literally fall asleep anywhere. Forced into FMLA, told I could return when I shouldn't have. Worked a week for free. Makes a person feel crazy and forces really good workers and managers out the door.",
    "advice_to_management": "Stop micromanaging, give hours for more staff, dont schedule 2 trucks in one day at the busiest time. Give raises when deserved. Treat your people better and maybe you wouldn't have such a high turnover.",
    "is_current_employee": true,
    "job_title": "Store Training Manager",
    "review_date": "2025-04-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100627181",
    "rating": 3.0,
    "title": "Assistant",
    "pros": "Better than minimum wage but not enough",
    "cons": "Work your butt off with the higher ups micro managing",
    "advice_to_management": "Make sure you're team is a team",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100741785",
    "rating": 1.0,
    "title": "Employee beware",
    "pros": "District manager pay is competitive.",
    "cons": "Bonus structure unrealistic as most stores cannot keep staff and maintenance of critical infrastructure is unhead of.",
    "advice_to_management": "Operations and human resources speak separate languages. \n\nOperations is a fire first mentality.  HR peaches stable and engaged but cowtows to poor regional leadership decisions.",
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-10-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100075695",
    "rating": 3.0,
    "title": "Good Job to get back into the swing of things",
    "pros": "20 hours PTO after 6 months\nPromote quickly",
    "cons": "Don't get paid enough for the work they want you to do",
    "advice_to_management": "Pay your employees more. When employees come to their managers about concern or issues Don't make excuses and not do anything about it.",
    "is_current_employee": true,
    "job_title": "Perishable Manager",
    "review_date": "2025-09-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101127889",
    "rating": 1.0,
    "title": "eh",
    "pros": "flexible schedule\ngood for highschoolers",
    "cons": "will only hire you part time so they dont have to give benefits \nonly care about profits and not the employees",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-11-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101300584",
    "rating": 1.0,
    "title": "cashier",
    "pros": "none really i wouldnt work there",
    "cons": "so many. alot of work for little pay",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-11-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100771423",
    "rating": 2.0,
    "title": "Not great",
    "pros": "Could just do work independently.",
    "cons": "Expect high work pace and flexible hours",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Store Keeper",
    "review_date": "2025-10-20T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100433667",
    "rating": 3.0,
    "title": "Management without the pay",
    "pros": "No attendance policy per company, at store managers will.",
    "cons": "Short staff so expect to work 40 hours, weekends and have only 1 other employee per shift to assist.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Keyholder",
    "review_date": "2025-10-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100348524",
    "rating": 3.0,
    "title": "Overworked and Underpaid",
    "pros": "Its a great place to get your foot in the door as a manager.",
    "cons": "The constant expectation from managment to \"make it happen\" are unrealistic  and create a cruel work environment.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101167532",
    "rating": 1.0,
    "title": "Avoid",
    "pros": "None come to mind now.",
    "cons": "Poor wages and work conditions. It’s an abusive culture that capitalizes on the poor.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "3rd-Key Manager",
    "review_date": "2025-11-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100371645",
    "rating": 1.0,
    "title": "I hated corporate",
    "pros": "The ability to do schedules, meet new people, and work at your home pace as a store manager.",
    "cons": "Corporate is never satisfied even when you've turned the entire store and culture around.",
    "advice_to_management": "Be prepared for racism, discrimination, and unfair treatment. Also working long hours because the pay for others are not as good You will be required to fill those time slots.",
    "is_current_employee": false,
    "job_title": "Manager",
    "review_date": "2025-10-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100412143",
    "rating": 2.0,
    "title": "DG Inside scoop",
    "pros": "Fast growing company with many opportunities",
    "cons": "Company culture\nTalent gaps \nPoor Senior leadership",
    "advice_to_management": "Micromanage less\nIncrease pay to attract better talent\nTake more time and input to build better business plans",
    "is_current_employee": true,
    "job_title": "Senior Distribution Director",
    "review_date": "2025-10-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100629646",
    "rating": 3.0,
    "title": "Fine job",
    "pros": "People were really cool to work with",
    "cons": "Hours were a burden to get used to.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Supply Chain Intern",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100540963",
    "rating": 2.0,
    "title": "Doesnt pay well",
    "pros": "Not difficult, stocking and cashier fairly easy",
    "cons": "Leadership works crazy hours and they put a lot of pressure on them",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-10-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100273491",
    "rating": 4.0,
    "title": "It’s what you make it",
    "pros": "Great leadership \nWork life balance most of the time \nGreat investment into growing your skills and abilities\nAmazing diversity",
    "cons": "Very fast paced \nGroups work as silos in some instances",
    "advice_to_management": "Ditch RTO",
    "is_current_employee": true,
    "job_title": "HR Manager",
    "review_date": "2025-09-26T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100633808",
    "rating": 4.0,
    "title": "Not bad",
    "pros": "Not stressful to say the least",
    "cons": "Annoying work hours especially being an introvert",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Account Manager",
    "review_date": "2025-10-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100707775",
    "rating": 1.0,
    "title": "Don't recommend anyone waste their time",
    "pros": "The pay is ok. 15.00 an hour when your pulling 40 hours a week....",
    "cons": "Not trained properly/at all even and terminated just for that 30 days of employment exact.",
    "advice_to_management": "Don't sale false dreams to people. \nKeep your word\nTrain properly",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-10-16T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99531598",
    "rating": 2.0,
    "title": "NEEDS IMPROVEMENT!!",
    "pros": "Guaranteed paycheck Steady Work and Awesome Customers",
    "cons": "ALWAYS have stuff that needs to be stocked sitting in aisles and stock room!\nALWAYS told the company won't give hours to Managers to give to the workers! So US WORKERS are left doing 5 job duties to 1 person each shift in the short time we are even scheduled-NONE OFF THE JOB DUTIES ARE COMPLETED EACH DAY SO IT BACKS UP!!",
    "advice_to_management": "Nah!!",
    "is_current_employee": false,
    "job_title": "Lead Cashier",
    "review_date": "2025-08-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100478889",
    "rating": 5.0,
    "title": "Great experience",
    "pros": "Always looking out to hire for store manger from with in the company",
    "cons": "Does everything a store manger does",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "ASM- Assistant Store Manager",
    "review_date": "2025-10-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_96128385",
    "rating": 1.0,
    "title": "Don't Do it",
    "pros": "- I loved my DG family, my coworkers and customers were the best \n- We got paid every week with either time and a half on holidays or an extra 8 hours for upper management\n- My SM was the best person in the entire world, she loved and cared for each of her employees",
    "cons": "- The expected workload thrown upon two people is frustrating\n- The fact that only TWO people are expected to work a shift at any given time when at most at least 4-5 people should be working to actually be able to get stuff done\n- The trucks mostly consisted of items we didn't need/it was ALL overstocked items! Never in a million years would we need 50 bags of the same type of dog food!!",
    "advice_to_management": "- Let your workers BREATH! \n- Stop sending huge trucks of things that the store doesn't need!\n- Make a better system where someone is actually ordering the supplies and everything they need vs going based off what is scanned at the registers/what hasn't been bought in awhile! \n- Up the hours and don't dock stores if they can't get workers to work the hours! It's horrible to try and get a huge truck done with only x amount of hours that has to be divided up between 5 people!",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-03-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100622616",
    "rating": 5.0,
    "title": "Stocking",
    "pros": "helping out people\nOrganizing, lifting material.",
    "cons": "There is no cons for job.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate/Cashier/Stocker",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_101047123",
    "rating": 1.0,
    "title": "crap crap crap",
    "pros": "customers, coworkers, nothing else, nothing else",
    "cons": "terrible pay, terrible boss, boring,",
    "advice_to_management": "manage better, be more exciting, pay more.",
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-11-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100630840",
    "rating": 3.0,
    "title": "50/50",
    "pros": "Good hours\nNice coworkers\nFriendly people",
    "cons": "Management\nNo benefits\nAlways called in on days off",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Key Holder",
    "review_date": "2025-10-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100444521",
    "rating": 2.0,
    "title": "This company does not care about their employees",
    "pros": "You get to work with some amazing people",
    "cons": "The company doesn’t care about their employees",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-10-04T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100580814",
    "rating": 5.0,
    "title": "Great team",
    "pros": "The team is very cohesive.",
    "cons": "Pay is slightly lower than average.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Security Analyst",
    "review_date": "2025-10-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_96364337",
    "rating": 1.0,
    "title": "Overworked",
    "pros": "Awesome insurance. Loved my coworkers",
    "cons": "You will be short staffed with the job of 5 people to complete. They literally give you enough hours to keep one person on shift at a time. At times not even enough hours to cover all hours the store is open. They want customers happy, so u must be close to the register at all times, but also recovering the entire store before it closes, also there's a full you boat of totes with products you must complete stocking before the store closes, also you have to clean up after your other lazy coworkers, also the store has set things you are required to do before closing such as mopping, sweeping, cleaning the bathrooms, and coolers. You are not allowed to have anything at your register that makes noise to alert you there is a customer at the register. You are required to work all truck days and have a 2000 piece truck up in three days.... Most your items you already have as back stock will be on this truck. I could go on all day but that's just some",
    "advice_to_management": "Your stores need proper staffing and hours to do what is needed in the stores. When you over work under paid staff they leave.",
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2025-04-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100083763",
    "rating": 1.0,
    "title": "dont work here even if you need a job badly",
    "pros": "they will hire you really fast! totally not because they cant keep a single employee",
    "cons": "horrible pay\nno benefits\nexpected to cashier, security, front face, stock and close up the store in a 15 min rush. This is all in one shift only making a dollar more than minimum wage.  Working at dollar general makes McDonalds look like a dream job",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-09-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97284758",
    "rating": 5.0,
    "title": "Fun and Exciting",
    "pros": "Room for advancement; Laid back atmosphere; accommodating for the most part; learned a lot; always something to do",
    "cons": "Open 7 day/week; open until 10PM-7 days a week; lots of heavy lifting and moving heavy rolltainers with merchandise on them for free; open all but 1 holiday; only 2 holidays qualify for “holiday pay”",
    "advice_to_management": "More hours to schedule people; a little better pay for entry level would help with getting employees who care about the store take advice from employees who are local in the community and knows what the community wants; sale more regional items instead of the same merchandise across the board; if an employee deserves a raise, they should get one instead of saying they have to wait until their work anniversary for their evaluation; reward the employees who step up to work when others call off; reprimand call offs and no shows",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-05-12T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100313434",
    "rating": 3.0,
    "title": "Ok place to work",
    "pros": "Flexible hours\nNice Coworkers\nGreat for job experience",
    "cons": "Cooperate doesn't give the store enough hours so the store is always struggling with scheduling.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-09-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100554807",
    "rating": 4.0,
    "title": "ok",
    "pros": "weekly pay, benefits, 30 min breaks",
    "cons": "overworked, low pay, understaffed, and stressful",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2025-10-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_96894103",
    "rating": 1.0,
    "title": "Ethics is only asked for noncorporate employees",
    "pros": "Before I was blinded by my termination I had nothing but great things to say about Dollar General. Hard work but if you love your job and followed the DG process as i did you always had no problems.",
    "cons": "They do not care about their employees; they only focus on what is immediately in front of them. There is little support for employees, particularly from the store managers. In my 4 1/2 years of working there, I never had any issues. I maintained a great walk-through, low shrinkage, no lost money, low turnover, and stayed under budget. I completed validations and trained new employees. Despite this, I supposedly received a customer complaint and was terminated over the phone five days after the complaint, which still hasn’t appeared in the monthly reports.",
    "advice_to_management": "Let’s focus on trusting the good managers by treating them as they have treated you. We should make a greater effort to retain the good ones rather than the problematic staff. It’s important to recognize that not everything is equal, and upper management needs to take a more active role with the district managers (DMs).",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-04-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100196536",
    "rating": 3.0,
    "title": "If you need go for it",
    "pros": "Quick hire in and start date. Able to work around life situations.",
    "cons": "Hours cut, pay isn’t very good to pay all bills. Pretty struck guidelines",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Keyholder",
    "review_date": "2025-09-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100467042",
    "rating": 4.0,
    "title": "Great place to work",
    "pros": "Great employment and growth opportunities",
    "cons": "Slow in project decision making process",
    "advice_to_management": "None",
    "is_current_employee": true,
    "job_title": "IT Director",
    "review_date": "2025-10-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100079074",
    "rating": 5.0,
    "title": "Experience at Dollar General",
    "pros": "Good job for someone starting to get a job",
    "cons": "Terrible oppurtunities for anyone actually trying to move forward. Boss literally had a stroke from this job and then was forgotten about.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Adovocate ",
    "review_date": "2025-09-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100402013",
    "rating": 4.0,
    "title": "Good Place to Work, Family Friendly",
    "pros": "Balanced Work Life, Good Salary, Good Benefits",
    "cons": "No remote options but it's fair enough",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Analyst",
    "review_date": "2025-10-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100520747",
    "rating": 3.0,
    "title": "Maybe not",
    "pros": "You log off earlier than 5pm",
    "cons": "Lots of layoffs, unstable corportate structure",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Marketing Coordinator",
    "review_date": "2025-10-08T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98860163",
    "rating": 4.0,
    "title": "Overall good place but a few disadvantages",
    "pros": "There is room for growth. They do value your contributions.",
    "cons": "While they value your contributions, if you're good at your job they will take advantage of your time.",
    "advice_to_management": "If you're up for a promotion, do not accept it if your store is short staffed or you don't like the work ethic of your current team because you will have zero work/life balance. But if you have a good team, absolutely take the promotion! Compliment your team! People like to know they're appreciated",
    "is_current_employee": true,
    "job_title": "Sales Associate to Assistant Manager to Store Manager",
    "review_date": "2025-07-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99356852",
    "rating": 2.0,
    "title": "Greedy and don't care enough to reward in any positive way",
    "pros": "Customers and team members make you happy to come to work!",
    "cons": "Higher ups do not care if you have been an invaluable asset. They'll fire you in a heart beat without a thought if they find the smallest thing...watch it! You can do better!!!",
    "advice_to_management": "Please take care of all of your employees and recognize those assets at all levels!",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-08-14T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100472265",
    "rating": 3.0,
    "title": "Alright",
    "pros": "Job is fairly easy to learn",
    "cons": "Drama in the workplace, customers can be confrontational.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-10-06T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_93306999",
    "rating": 1.0,
    "title": "Terrible Pay, unrealistic expectations",
    "pros": "Some coworkers were nice, locations was close to home, did enjoy knowing deals ahead of time tho",
    "cons": "Terrible pay, they expect you to be on call for the fresh truck but dont pay you any extra for it OR you dont get paid if the truck happens to not be able to make its delivery on time, make you work on every single holiday except for Christmas day, nor do the hours get shortened on those days either. Only some holidays got holiday pay. No sick pay, no PTO, no vacation days, no actual benefical benefits. No employee discount (except like maybe 3 times a year where they decide to give you 30% off that is not combinable with any other coupons and only could be used once). Management would make up stupid rules or decide to enforce rules that only applied to certain people and only when they benefitted them. Make you buy your own uniforms then have the audacity to put up signs for uniforms you could buy \n\nThe higher ups literally do not care to listen to anyone on any complaints or suggestions we had. They just came in, not knowing literally anything about how the store worked and then forced us to change everything--which ended up making everything more difficult for customers and employees.",
    "advice_to_management": "Stand up to the district managers. And district managers could actually take our complaints seriously. Also raise the pay for literally everyone? And do actual benefits. And something needs to be done about the warehouse and how they ship stuff to the stores. We would get like insane amounts of toilet paper and other things and have no where to put them.",
    "is_current_employee": false,
    "job_title": "Sales Associate/Key Holder",
    "review_date": "2024-12-01T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100130982",
    "rating": 2.0,
    "title": "Stepping stone job",
    "pros": "I had a Good general manager",
    "cons": "Poor pay, overworked, no benefits",
    "advice_to_management": "Give managers more then one employee and stop making them work half the shift with no help thats wreckless",
    "is_current_employee": true,
    "job_title": "Shift Manager",
    "review_date": "2025-09-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100433142",
    "rating": 3.0,
    "title": "great work",
    "pros": "was able to move up in the company quickly",
    "cons": "long hours and always understaffed",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-10-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100200984",
    "rating": 2.0,
    "title": "Unbelievable",
    "pros": "Our customers were the best!",
    "cons": "No support from District or Regional Managers",
    "advice_to_management": "Expect you will be over worked and working at least 60 hrs with no support.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100139496",
    "rating": 1.0,
    "title": "A stepping stone",
    "pros": "Easy to apply and get hired, most the staff is great to work with.",
    "cons": "The company does not care about the employees. Upper management is clueless. They force a skeleton crew creating an unsafe working environment.",
    "advice_to_management": "You've lost touch with how it is working the floor and the expectations are unrealistic. Do not leave one person to work alone.",
    "is_current_employee": false,
    "job_title": "Associate",
    "review_date": "2025-09-20T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100313222",
    "rating": 3.0,
    "title": "Sales associate position",
    "pros": "The manager was amazing to be around,",
    "cons": "Base pay wasn’t enough for me to make a living",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-09-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99006351",
    "rating": 1.0,
    "title": "Wrongfully terminated",
    "pros": "Can’t seem to think of anything.",
    "cons": "Management is a joke most of them do not care about their employees.",
    "advice_to_management": "I would encourage Dollar General management to place a stronger focus on creating a respectful, supportive, and professional work environment. Employees perform better when they feel valued, heard, and treated fairly. It’s important that all levels of management lead by example, communicate clearly, and handle conflicts or concerns seriously and promptly. Transparency and accountability—especially in situations involving harassment or unfair treatment—are key to earning trust and retaining good employees. Investing more in employee training, store safety, and proper staffing would also improve the overall experience for both workers and customers.",
    "is_current_employee": true,
    "job_title": "Assistant Store Manager",
    "review_date": "2025-07-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100426069",
    "rating": 2.0,
    "title": "Good temp job",
    "pros": "Helpful staff and nice boss",
    "cons": "Bad hours and customers not nice",
    "advice_to_management": "None",
    "is_current_employee": false,
    "job_title": "Customer Service Representative",
    "review_date": "2025-10-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100367306",
    "rating": 3.0,
    "title": "Nope!",
    "pros": "Coworkers and customers are good people",
    "cons": "You are always overworked and underpaid",
    "advice_to_management": "Do better",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-09-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100324776",
    "rating": 1.0,
    "title": "Overworked and Underpaid",
    "pros": "Discounts on Hotels/Cars\nCustomers\nAffordable Benefits",
    "cons": "Required work hours\nPay\nCompany allotted labor hours too small",
    "advice_to_management": "The stores are constantly shorted on labor and reliant almost entirely on the managers salaried hours to meet basic stocking requirements. Corporate is more concerned with new business ventures than supporting their existing stores.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99982136",
    "rating": 3.0,
    "title": "Pay is good",
    "pros": "Pay is the only thing that retains people",
    "cons": "7days a week, HR control of operations due to DEI policies, bad upper leadership and constant turnover even at executive positions",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Fleet Manager",
    "review_date": "2025-09-13T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99752451",
    "rating": 1.0,
    "title": "Run, don’t walk away",
    "pros": "Company car. Once a quarter, you get a one time use 30% off coupon. Stable company",
    "cons": "No work life balance \nWork 60+ hours a week and get crapped on\nNo leadership\nLack of team culture \nLow caliber employees \nExcessive turnover\nLow pay",
    "advice_to_management": "Either pay folks better or don’t ask so much of them. Never in my life have I poured so many hours into a job and felt like an absolute failure…",
    "is_current_employee": true,
    "job_title": "District Manager",
    "review_date": "2025-09-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97036743",
    "rating": 1.0,
    "title": "I dont and would not refer anyone to Bristol locations.",
    "pros": "Meet new people every day",
    "cons": "90% of employees are part time so they dont have to provide benefits. DG believes 3 to 4 people working part time is fully staffed. Store managers are not trained correctly. Turnover rate is high bc the expected work to be done is impossible to keep up with only getting 25 hours a week. We went 3 months with no store manager and the year i was there i had 4 different store managers .\nWhen they dont like you they wright you up constantly. Unsafe stocking methods. Freight is always on floors in boxes. Some employees just stick boxes on the shelves instead of stocking it properly.  Dont expect store managers to help out. They just point and tell you to do a job while they stand there on their phones or sit in the security office and watch camaras.",
    "advice_to_management": "My advise would be to district managers to train the correct people for Store Management and to make sure they do their job.",
    "is_current_employee": false,
    "job_title": "Shift Leader",
    "review_date": "2025-04-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99395982",
    "rating": 4.0,
    "title": "Well",
    "pros": "Pay is decent. It’s close to home and I enjoy talking with customers and seeing my regulars everyday.",
    "cons": "I don’t really know what to say.",
    "advice_to_management": "Take the time to get to know your lower level employees. Sometimes the ones who are under are the ones who are best interacting with customers and helping sales for up.",
    "is_current_employee": true,
    "job_title": "Asstitant Store Manager",
    "review_date": "2025-08-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100355384",
    "rating": 3.0,
    "title": "DG Experience",
    "pros": "-Good, friendly environment and co-workers",
    "cons": "-Terrible pay and common retail woes",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Keyholder",
    "review_date": "2025-09-30T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98360190",
    "rating": 2.0,
    "title": "Was stressful but paid alright",
    "pros": "Good pay, and the job wasn’t too hard offers dental, health, and life insurance I believe they also offered college support",
    "cons": "There a lot of work drama and just not great folks that work at the company my boss at the time would constantly put pressure on me like he or I was about to be fired and they pushed me to promote people who either weren’t ready or comfortable enough for said position or got a big head about it",
    "advice_to_management": "Just do better and set guidelines so your management can’t just force people up",
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-06-29T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100200371",
    "rating": 3.0,
    "title": "Mixed Review",
    "pros": "Job Security (for the most part), Health Benefits",
    "cons": "Out of touch senior leadership, lack of real employee validation",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2025-09-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100029394",
    "rating": 2.0,
    "title": "Dollar General",
    "pros": "Good pay and willing to be somewhat flexible",
    "cons": "Lots of time away from home",
    "advice_to_management": "Do not force drivers to go anywhere they don’t want to go",
    "is_current_employee": true,
    "job_title": "Class A Truck Driver",
    "review_date": "2025-09-15T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100299337",
    "rating": 3.0,
    "title": "ASM",
    "pros": "Health benefits full-time hours paid vacation time",
    "cons": "Heavy workload due to understaffing",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Store Manager Operations",
    "review_date": "2025-09-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99849263",
    "rating": 1.0,
    "title": "My location was great but the company is evil",
    "pros": "Great coworkers, wouldn't have traded them for the world.",
    "cons": "Corporate cut my health benefits without warning me, continued deducting the cost of my benefits from my pay and every time I called to try and remedy the situation they told me I'd have to provide third-party proof that I'm uninsured, which I'm not sure even means anything.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "LSA/Keyholer",
    "review_date": "2025-09-07T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99900735",
    "rating": 3.0,
    "title": "Decent first job",
    "pros": "Not an overly had job if trained.",
    "cons": "Expects to much out of good employees to offset the constant turnover.",
    "advice_to_management": "Schedule better so employees don't get burnt out and leave.",
    "is_current_employee": false,
    "job_title": "Key Holder",
    "review_date": "2025-09-09T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99409246",
    "rating": 2.0,
    "title": "Job",
    "pros": "Close to home.  The people and place are familiar to me so its comfortable.",
    "cons": "Not enough pay or hours ever!",
    "advice_to_management": "People should get a raise every 6 months! They should also be offered the higher positions that open instead of bringing in new employees that have never worked for dollar general",
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-08-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100266837",
    "rating": 2.0,
    "title": "Not the best",
    "pros": "Steady pay and good people",
    "cons": "Unorganized and always a mess",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Cashier",
    "review_date": "2025-09-25T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97728742",
    "rating": 1.0,
    "title": "Understaffed and terrible training practices.",
    "pros": "I'm sure there's some somewhere",
    "cons": "I was recently hired and my experience training has been terrible.  I had exactly one four hour shift where I was given the time to work on my training modules.  The very next shift, I was on register and doing recovery/closing procedures while also having to do the training modules.  \nMy store is chronically understaffed. 99% of the time there is the bare minimum of employees (2) in the store.   Typically, with one person working the register and one working Receiving and/or Recovery or doing chores .  I was doing my modules while also being the only person on the front end.  \nApparently I also need to get them done to stay employed because it's a problem that I haven't finished mine.\nI haven't gotten the modules done because I haven't had the time.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-05-31T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98868769",
    "rating": 2.0,
    "title": "No support",
    "pros": "My store manager appreciates and recognizes my good work.\nCustomers are amazing",
    "cons": "Dm is unprofessional and plays favorites. If you are a tattle tale and a kiss up  you are rewarded but if you work your butt off they wont even speak to you like you are a person.\nThey over work the loyal employees and there is no accountability for those who do nothing.",
    "advice_to_management": "Give better support to stores with little to no employees.",
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-07-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100163567",
    "rating": 4.0,
    "title": "Dollar general",
    "pros": "Easy work and lots of opportunity for growth",
    "cons": "Not a lots of benefits",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Sales Associate",
    "review_date": "2025-09-22T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99653966",
    "rating": 4.0,
    "title": "Good for part time",
    "pros": "Pay, employees, atmosphere customers variety of products",
    "cons": "Too many roles for such underlining threat words like better be done and threats of write ups. None have occurred it an atmosphere of threat.",
    "advice_to_management": "Management is doing great.",
    "is_current_employee": true,
    "job_title": "Sales Accosicate",
    "review_date": "2025-08-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99667231",
    "rating": 2.0,
    "title": "High expectations for low pay",
    "pros": "Depending on the location, great coworkers.",
    "cons": "Their expectations of the store and it’s workers are way too high for how little pay and understaffed it is.\n\nThey make it almost impossible to qualify for full time benefits",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Store Associate",
    "review_date": "2025-08-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100720094",
    "rating": 1.0,
    "title": "avoid working here",
    "pros": "It is a paying job.",
    "cons": "Random hours, daily schedule changes, very stressful environment, low pay, low raises.",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Key Holder",
    "review_date": "2025-10-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100222672",
    "rating": 3.0,
    "title": "flexible schedule",
    "pros": "flexible schedule while attending college",
    "cons": "no benefits available to part time",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Cashier",
    "review_date": "2025-09-24T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100206476",
    "rating": 3.0,
    "title": "Assistant manager",
    "pros": "Cool flow if u understand job",
    "cons": "Small staff hard to request off",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-09-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99289146",
    "rating": 5.0,
    "title": "I Love Dollar General",
    "pros": "Insurance availability \nWeekly pay, and early pay if needed. \nFlexible schedule\nVacation\nSick time\nOpportunity to advance\nAnd they give back to the community",
    "cons": "I have to show up and work while I'm there sometimes with people who want the job, and don't want to work.",
    "advice_to_management": "Listen to your key holders and casheir.",
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-08-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100086658",
    "rating": 3.0,
    "title": "I don't hate it",
    "pros": "I Enjoy pushing freight and organizing",
    "cons": "Adult coworkers unable to get along",
    "advice_to_management": "So much",
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2025-09-17T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100034300",
    "rating": 1.0,
    "title": "To much work load",
    "pros": "Making your schedule ,if its on there workflow",
    "cons": "The amount of work against the hours they base workload on its way to much",
    "advice_to_management": "Treat employees better go back to vendors doing there jobs of stocking some product,stores would look so much better.And employee retention would go up extremely.",
    "is_current_employee": true,
    "job_title": "Manager",
    "review_date": "2025-09-16T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99738409",
    "rating": 4.0,
    "title": "Overall great people to work with",
    "pros": "The staff I worked with are mostly hard workers who make the store work smoothly!",
    "cons": "Typical retail job, suspicious activity from management, favoritism displayed for certain employees",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Full Time Sales Lead",
    "review_date": "2025-09-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_98901324",
    "rating": 2.0,
    "title": "No life",
    "pros": "Job Security\nCloster to home",
    "cons": "Pay not nearly enough for amount for work expected. \n\nRidiculously low hours\n\nNo one should EVER have to be alone at the store due to not having enough hours. It's just dangerous.",
    "advice_to_management": "Try shopping in your stores for once. And then before blaming the store team actually work in that store and then come back and try to convince us it's possible to keep up.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-07-23T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99848529",
    "rating": 2.0,
    "title": "Store Manager",
    "pros": "Get to make your own schedule\nBuild your own team and develop your own style of management",
    "cons": "Long hours\nAlmost impossible to complete tasks without living there",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-07T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99006880",
    "rating": 5.0,
    "title": "The company has been upgrading and changing!",
    "pros": "The food selection is much better and cheaper than any local grocery store.",
    "cons": "Having stock available is tricky at times but the Fairview stores are both well stocked at all times.",
    "advice_to_management": "There have been alot of additional expectations added to help clean the stores up but they are tedious but doable with a great crew.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-07-28T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100231524",
    "rating": 1.0,
    "title": "No work life balance",
    "pros": "None life was hell while working there",
    "cons": "Positions is salary and not enough hours for the team and if someone is absent they spect you to do the job so basically you work for free",
    "advice_to_management": "Don’t donit",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-09-24T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100101235",
    "rating": 3.0,
    "title": "fun place",
    "pros": "low stress and easy work",
    "cons": "had to work weekends and low pay",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Customer Service Representative",
    "review_date": "2025-09-18T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_100745584",
    "rating": 1.0,
    "title": "No",
    "pros": "don't even think about think",
    "cons": "too much work load to handle",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Key Holder",
    "review_date": "2025-10-19T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99753047",
    "rating": 4.0,
    "title": "Good Job IMO",
    "pros": "Pay \n401k matching \nIncentive pay + overtime",
    "cons": "It’s a warehouse. Petty drama. But if tuned out , smooth experience. Management never stays long !",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Order Selector",
    "review_date": "2025-09-02T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99775331",
    "rating": 4.0,
    "title": "Dollar General - Generally a good place to work",
    "pros": "Good place to work with decent pay.",
    "cons": "The only negative might be extensive travel required in some positions.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Real Estate",
    "review_date": "2025-09-03T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99954430",
    "rating": 5.0,
    "title": "Love the Culture!!",
    "pros": "Amazing place to work. Nice people and good culture.",
    "cons": "Not very transparent about pay.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2025-09-11T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99930269",
    "rating": 4.0,
    "title": "Under Staff",
    "pros": "I was able to get my days off",
    "cons": "Pay is low with high expectations for one employee",
    "advice_to_management": null,
    "is_current_employee": false,
    "job_title": "Sales Associate",
    "review_date": "2025-09-10T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99626280",
    "rating": 2.0,
    "title": "Unfair job practices",
    "pros": "Dollar General was easy hire",
    "cons": "They laid me off the day they found out that I was pregnant. Months later after giving birth they brought me back.",
    "advice_to_management": "Seems like unfair employment practice.",
    "is_current_employee": true,
    "job_title": "Sales Associate/Cashier",
    "review_date": "2025-08-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_97497047",
    "rating": 4.0,
    "title": "Corporate has crazy expectations!",
    "pros": "I loved the team I worked with.",
    "cons": "Corporate involvement in scheduling. Disregard of the nones and tons and continuing to send more stock that we already had too much of. The store rooms are so tight that there is no room for weekly truck let alone over stock. Corporate doesn't honor holiday pay of staff who works the day before and day of a holiday.",
    "advice_to_management": "They need to stop punishing the managers who are doing their best to follow corporate expectations which are absurd as far as staffing. Corporate over works the ASM and the managers, but then punishes them for covering the hours that can't be filled due to short staffing.",
    "is_current_employee": true,
    "job_title": "Lead Sales Associate/Key Holder",
    "review_date": "2025-05-21T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_99636360",
    "rating": 3.0,
    "title": "Great people",
    "pros": "It's not a bad job. But the turnover rate is so bad that work life balance is bad. Friendly co workers.",
    "cons": "Pay should be higher, work life balance, turn over bad.",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Assistant Manager",
    "review_date": "2025-08-27T00:00:00+00:00",
    "source": "glassdoor"
  },
  {
    "review_id": "glassdoor_DG_96622992",
    "rating": 1.0,
    "title": "Selling your soul",
    "pros": "The cashier's were great and so was the freight thrower.",
    "cons": "I was told 48 hrs before being hired and I worked 48 hrs a wk for the first 2 weeks. Then 60 and then 72 hrs a wk. I worked 6 days a wk and extremely long days. The backroom was full when I started and no matter how hard I worked, that never changed. I was expected to set pogs, end caps, run register, paperwork, schedules and all the while with only 117 labor hours a wk. Each week, I was told to cut labor and that made it impossible for me to get anything done. They are the worst company hands down to work for. I got to see my husband maybe 2 hours tops a day and I had to miss my daughter's events because of this place.",
    "advice_to_management": "If you want to know why there is a high turn over rate for store manager's then I suggest you look at the workload that DM's are placing on the SM's and staff.",
    "is_current_employee": true,
    "job_title": "Store Manager",
    "review_date": "2025-04-11T00:00:00+00:00",
    "source": "glassdoor"
  }
]