[
  {
    "review_id": "careerbliss_WMT_0",
    "rating": 3.0,
    "title": "I love my job. I've worked at McDonald's, the Buckle, Pizza Hut, and Walmart in that consecutive ord",
    "pros": "I love my job. I've worked at McDonald's, the Buckle, Pizza Hut, and Walmart in that consecutive order. Walmart has by far been my favorite job. I started as a cashier the first few years and then became a customer service manager. It can be stressful at times, but overall I really enjoy it. I like working with so many different people and customers. It's a lot of fun. The pay could be better, but recently Walmart has stepped up its game and increased its wages, which is a definite plus. If you're interested in Walmart, I definitely recommend it. I've had a good time with Walmart. It's a home away from home.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-02-12T23:53:08.250181+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_1",
    "rating": 3.0,
    "title": "I love my job. I've worked at McDonald's, the Buckle, Pizza Hut, and Walmart in that consecutive ord",
    "pros": "I love my job. I've worked at McDonald's, the Buckle, Pizza Hut, and Walmart in that consecutive order. Walmart has by far been my favorite job. I started as a cashier the first few years and then became a customer service manager. It can be stressful at times, but overall I really enjoy it. I like working with so many different people and customers. It's a lot of fun. The pay could be better, but recently Walmart has stepped up its game and increased its wages, which is a definite plus. If you're interested in Walmart, I definitely recommend it. I've had a good time with Walmart. It's a home away from home.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "",
    "review_date": "2026-02-12T23:53:08.251179+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_2",
    "rating": 4.0,
    "title": "Working in Asset Protection isn’t only for Loss Prevention, someone has to ensure the losses are acc",
    "pros": "Working in Asset Protection isn’t only for Loss Prevention, someone has to ensure the losses are accounted for and the returned or recovered items help the store recoup some of the losses caused by theft, returned items, contamination, issues caused by shipping mishaps, and store neglect. In the claims department, we handle hazardous material, flammable, caustic, acids, or rotten spoiled food caused by issues such as maggot infestation of broken and busted food with damaged packaging. I have a positive view of my job and enjoy working in the back of the store checking merchandise to ensure it’s safe for consumers to purchase. I mark down the returns so that others get to receive enjoyment from things we would have otherwise thrown away. I’m paid pretty fairly in comparison to my peers, and my position pays more than some of the others starting out.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.251179+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_3",
    "rating": 2.0,
    "title": "Walmart's unofficial motto is \"pretend to do what you're supposed to when you think you are being wa",
    "pros": "Walmart's unofficial motto is \"pretend to do what you're supposed to when you think you are being watched.\"  Only new people in the warehouse actually try to do what they were told because the workload is just too great.  Nobody experienced loads the way they were taught at orientation except when the inspector comes.  Everybody uses shortcuts to save time and reduce stress on their body.\n\nBefore I started working at Walmart's loading docks, I was a healthy 29-year-old male with 2 years of prior warehouse experience.  I was in the habit of doing 100 pushups and 100 squats every day and going on occasional jogs.  Now that I've quit, I plan on doing no work for 1 month because my health has deteriorated so much.\n\nWhile working there, I got repetitive stress injuries in 5 joints, I got a stomach ulcer because I took ibuprofen in response to the joint pain, I nearly fainted from exhaustion after my first 5 weeks of mandatory overtime, the skin on my finger tips split open from moving so many boxes (despite wearing gloves and using moisturizer).  I had no such problems working in any other warehouse.\n\nThe management discourages reporting of injuries.\n\nThey give you false information about benefits, and then deny you the benefits because you did not follow the proper procedure.\n\nI got the flu and took off 2 weeks.  Walmart told me to get my leave approved through Sedgwick.  Sedgwick told me that the leave was approved, but Walmart refused to approve it.\n\nI've heard from several employees that the turnover rate in shipping is 90%.  I believe this is true, since when I quit after 7 months with the company, I was already senior to roughly half the loaders on the dock.  \n\nWalmart paid me $25/hr.  The next highest pay I found in a warehouse was $19/hr.  Yet, Walmart cannot keep its employees.  The reason is that the work load is beyond what human biology is capable of.\n\nThe location is actually Ottowa, KS, but this website won't accept that location.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Loader",
    "review_date": "2026-02-12T23:53:08.252181+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_4",
    "rating": 5.0,
    "title": "Walmart treats its maintenance associates like family and has fair working conditions and highly com",
    "pros": "Walmart treats its maintenance associates like family and has fair working conditions and highly competitive pay and benefits.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Maintenance Associate",
    "review_date": "2026-02-12T23:53:08.252181+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_5",
    "rating": 5.0,
    "title": "Fun and easy job. Easiest job I have had for the payment of $15 an hour.",
    "pros": "Fun and easy job. Easiest job I have had for the payment of $15 an hour.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.252181+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_6",
    "rating": 5.0,
    "title": "Great company to be a part of.",
    "pros": "Great company to be a part of.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Market Sales Manager",
    "review_date": "2026-02-12T23:53:08.253180+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_7",
    "rating": 5.0,
    "title": "I’ve worked at Walmart since 2020, I’ll say it’s the best entry-level job to work at, knowing that I",
    "pros": "I’ve worked at Walmart since 2020, I’ll say it’s the best entry-level job to work at, knowing that I’m helping many people and making the community better makes me happy! The staff is excellent at helping you to improve yourself and be a better you. The work is motivational to keep you striving for a better and safe environment.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Team Associate",
    "review_date": "2026-02-12T23:53:08.253180+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_8",
    "rating": 5.0,
    "title": "Its a very good company for professionals",
    "pros": "Its a very good company for professionals",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.254178+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_9",
    "rating": 2.0,
    "title": "I only worked for this company for barely more than a month and I could quite literally not stand th",
    "pros": "I only worked for this company for barely more than a month and I could quite literally not stand this job another day. My immediate problem was with the management. The way the supervisor speaks in pharmacy is condescending and false polite. They are also extremely pushy. Nothing you do as an employee will be enough. They are severely strict on when you clock in and clock out but seemingly only when it comes to just us normies and not managers. I showed up for a shift on time and could not walk in because the pharmacy manager showed up 20 mins late. A little irritating when waking up at 7 in the morning and your boss can’t do the same. So just be careful because it’s honestly a hit or miss with any job. You can’t guarantee if your supervisor will be professional or not. You can’t guarantee you’ll click with them either. From my experience the techs were very nice and helpful though. As for the actual pharmacy, it’s so outdated. If you worked at Walgreens or even CVS, you’d notice it quick. Their computer system they have the techs using is so tedious and overly complicated. It’s obnoxious to use and not worth the headache especially when you’re being taught five different ways to do something when there is only supposed to be one correct way. Also, if you cannot handle interacting with customers or patients, you won’t be able to last here. Just like any other retail, people are rude and obnoxious. That’ll never change. For any pros- they actually have a lot of tech hours. My store was always staffed properly and there was more than a single pharmacist on a shift. They pay really well for techs in my area as well as give a pay bonus for just getting hired. And again, the other techs at my location were very nice and helpful. Other than that, I can’t think of a single other good thing. I didn’t learn anything with these people except how to use their register and lose my sanity.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.254178+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_10",
    "rating": 5.0,
    "title": "Walmart has a great culture and and many benefits. You will put in many hours and work life balance ",
    "pros": "Walmart has a great culture and and many benefits. You will put in many hours and work life balance is tough but well rewarded.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.254178+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_11",
    "rating": 4.0,
    "title": "I recently started working as a personal shopper at walmart as an highschool student and I’ve been a",
    "pros": "I recently started working as a personal shopper at walmart as an highschool student and I’ve been able to choose availabilities that work very well around my schedule. Not gotten my first paycheck yet but the hourly pay is pretty decent. My team leads have been really helpful and my coworkers are friendly. But personnel has half done their job so far. Was never asked for bank account details till i went in to get it figured out myself, info on how to clock in and out etc. It’s been nice having kind team leads that answer whatever questions I have though.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.255180+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_12",
    "rating": 5.0,
    "title": "It's a company that gave me a chance to explore myself and do the work.",
    "pros": "It's a company that gave me a chance to explore myself and do the work.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Business Intelligence Developer",
    "review_date": "2026-02-12T23:53:08.255180+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_13",
    "rating": 4.0,
    "title": "Stay away unless you are desperate for a job. Anyone with character and good work ethic should not a",
    "pros": "Stay away unless you are desperate for a job. Anyone with character and good work ethic should not apply. There is a lot of gas lighting and railroading that goes on at Walmart. Bullying is beyond belief. I have watched numerous hardworking employees be lied on and forced out of their jobs over the last several years...some had been with the company many years. If you don't think it can happen to you, think again.\nThe pharmacy runs on social media. There are two or three technicians who think they run the place and want the pharmacist to do there work where they can play all day. Cross one of them and they will do what they can to get you fired...this includes other technicians and pharmacists. This pharmacy team is very toxic and it is a snake pit. The pharmacy manager is not objective and plays to the beat of the technicians drum! Watch out for the staff pharmacist. Good luck if you have the nerve to go there.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.256182+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_15",
    "rating": 4.0,
    "title": "Worst company to work for in Healthcare. Upper management is completely unrealistic with its expecta",
    "pros": "Worst company to work for in Healthcare. Upper management is completely unrealistic with its expectations of employees. You are expected to work with only the pharmacist to back you up for the last few hours of your shift while last minute customers flood in. Other techs will treat you bad for asking questions and trying to learn the job better. The techs that worked there the longest worked the least hours a week but complained the most about techs who worked full time and were new. Management does nothing to have any type of formal two weeks of training. You have two days of cbls and are thrown on the floor to be treated like a dog. Customers will not respect you and coworkers will be quick to place the blame but do little to nothing to help you. Go through formal schooling first and try to get in a hospital setting as soon as you can. Retail in general is bad but being a technician is worse because you are expected to work at light speed which often causes mistakes and a toxic culture of the blame game.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Walmart Employee",
    "review_date": "2026-02-12T23:53:08.256182+00:00",
    "source": "careerbliss"
  },
  {
    "review_id": "careerbliss_WMT_16",
    "rating": 4.0,
    "title": "I am nearing 2 years at my current store. I am held many different positions here during that time. ",
    "pros": "I am nearing 2 years at my current store. I am held many different positions here during that time. Compensation is ok for most positions, but other positions may require 3 times or more the workload for the same pay. Bonuses were taken away for a ~$0.20/hour raise. No holiday pay, and a heavy penalty for using PTO on those days.",
    "cons": "",
    "advice_to_management": null,
    "is_current_employee": true,
    "job_title": "Digital Associate",
    "review_date": "2026-02-12T23:53:08.256182+00:00",
    "source": "careerbliss"
  }
]