{
  "document_id": "bcaae3b1-e2b0-45e1-af07-994f5f935fc3",
  "content_hash": "f360756d4fa40fb8c1e790cb19dd761ad1ed174c80e80a9c4b7b9e93dbd629d9",
  "ticker": "DE",
  "filing_type": "10-Q",
  "chunk_count": 19,
  "chunks": [
    {
      "chunk_index": 0,
      "section": "item_1a",
      "start_char": 0,
      "end_char": 5921,
      "word_count": 1000,
      "content": "Item 1A. Risk Factors See our most recently filed Annual Report on Form 10-K (Part I, Item 1A). There have been no material changes in this information. The risks described in the Annual Report on Form 10-K, and the “Forward-Looking Statements” in this report, are not the only risks we face. Additional risks and uncertainties may also materially affect our business, financial condition, or operating results. One should not consider the risk factors to be a complete discussion of risks, uncertainties, and assumptions. Item 2. Unregistered Sales of Equity Securities and Use of Proceeds Issuer Purchases of Equity Securities Purchases of our common stock during the second quarter of 2024 were as follows: ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ Total Number of ​ ​ ​ ​ ​ ​ ​ ​ Shares Purchased as ​ Maximum Number of ​ ​ Total Number of ​ ​ ​ ​ Part of Publicly ​ Shares that May Yet Be ​ ​ Shares ​ ​ ​ ​ Announced Plans or ​ Purchased under the ​ ​ Purchased ​ Average Price ​ Programs (1) ​ Plans or Programs (1) Period ​ (thousands) ​ Per Share ​ (thousands) ​ (millions) Jan 29 to Feb 25 ​ 1,049 $ 383.61 ​ 1,049 ​ 28.6 ​ ​ Feb 26 to Mar 24 ​ 1,330 ​ ​ 374.48 ​ 1,330 ​ 27.3 ​ ​ Mar 25 to Apr 28 ​ 505 ​ ​ 404.58 ​ 505 ​ 26.8 ​ ​ Total ​ 2,884 ​ ​ ​ ​ 2,884 ​ ​ ​ ​ (1) We have a share repurchase plan that was announced in December 2022 to purchase up to $18.0 billion of shares of our common stock. The maximum number of shares that may yet be purchased under this plan was 26.8 million based on the closing price of our common stock on the New York Stock Exchange as of the end of the second quarter of 2024 of $393.33 per share. At the end of the second quarter of 2024, $10.5 billion of common stock remained to be purchased under this plan. ​ 39 ​ Sales of Unregistered Securities During the second quarter of 2024, we issued 4,500 deferred stock units under the Deere & Company Nonemployee Director Stock Ownership Plan (“NEDSOP”) to our non-employee directors for their service on our Board of Directors. The deferred stock units convert to shares of common stock on a one-for-one basis following a termination of service as described in the plan. Deferred stock units and shares of common stock issued under the NEDSOP are exempt from registration pursuant to Section 4(a)(2) of the Securities Act of 1933, as amended, and Rule 506 of the SEC’s Regulation D thereunder. During the second quarter of 2024, we distributed 4,399 shares of common stock to a participant account under the 2012 and 2022 NEDSOP. Item 3. Defaults Upon Senior Securities None. Item 4. Mine Safety Disclosures Not applicable. Item 5. Other Information Director and Executive Officer Trading Arrangements On February 26, 2024 , Cory J. Reed , President, Worldwide Agriculture & Turf Division, Production and Precision Ag, Sales & Marketing Regions of the Americas and Australia adopted a trading plan intended to satisfy the affirmative defense of Rule 10b5-1 (c) under the Exchange Act. The plan covers the exercise of 13,370 employee stock options and the related sale of such shares. The plan expires on December 24, 2024 . On March 5, 2024 , Rajesh Kalathur , President, John Deere Financial, and Chief Information Officer adopted a trading plan intended to satisfy the affirmative defense of Rule 10b5-1 (c) under the Exchange Act. The plan covers the exercise of 24,580 employee stock options and the related sale of such shares. The plan expires on August 29, 2025 . ​ 40 ​ Item 6. Exhibits Certain instruments relating to long-term borrowings constituting less than 10 percent of the registrant’s total assets are not filed as exhibits herewith pursuant to Item 601(b)(4)(iii)(A) of Regulation S-K. The registrant will furnish copies of such instruments to the Commission upon request of the Commission. ​ ​ ​ ​ 3.1 Certificate of Incorporation (Exhibit 3.1 to Form 10-Q of registrant for the quarter ended July 28, 2019, Securities and Exchange Commission File Number 1-4121*) ​ ​ 3.2 Bylaws, as amended (Exhibit 3.2 to Form 10-Q of registrant for the quarter ended July 30, 2023, Securities and Exchange Commission File Number 1-4121*) ​ ​ 10.1 364-Day Credit Agreement, dated March 25, 2024, among the registrant, John Deere Capital Corporation, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent ​ ​ 10.2 2028 Credit Agreement, dated March 25, 2024, among the registrant, John Deere Capital Corporation, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent ​ ​ 10.3 2029 Credit Agreement, dated March 25, 2024, among the registrant, John Deere Capital Corporation, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent ​ ​ 31.1 Rule 13a-14(a)/15d-14(a) Certification ​ ​ 31.2 Rule 13a-14(a)/15d-14(a) Certification ​ ​ 32 Section 1350 Certifications (furnished herewith) ​ ​ 101.INS Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document) ​ ​ 101.SCH Inline XBRL Taxonomy Extension Schema Document ​ ​ 101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document ​ ​ 101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document ​ ​ 101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document ​ ​ 101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document ​ ​ 104 Cover Page Interactive Data File (formatted as Inline"
    },
    {
      "chunk_index": 1,
      "section": "item_1a",
      "start_char": 5241,
      "end_char": 11506,
      "word_count": 1000,
      "content": "Rule 13a-14(a)/15d-14(a) Certification ​ ​ 32 Section 1350 Certifications (furnished herewith) ​ ​ 101.INS Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document) ​ ​ 101.SCH Inline XBRL Taxonomy Extension Schema Document ​ ​ 101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document ​ ​ 101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document ​ ​ 101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document ​ ​ 101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document ​ ​ 104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101) ​ ​ * Incorporated by reference. ​ ​ ​ 41 ​ ​ SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ DEERE & COMPANY ​ ​ ​ ​ Date: May 30, 2024 ​ By: /s/ Joshua A. Jepsen ​ ​ ​ ​ Joshua A. Jepsen Senior Vice President and Chief Financial Officer (Principal Financial Officer and Principal Accounting Officer) ​ ​ ​ 42 EX-10.1 2 de-20240428xex10d1.htm EX-10.1 Exhibit 10.1 ​ EXECUTION VERSION ​ ​ ​ DEERE & COMPANY JOHN DEERE CAPITAL CORPORATION JOHN DEERE BANK S.A. ________________________________________ $5,000,000,000 364-DAY CREDIT AGREEMENT Dated as of March 25, 2024 ________________________________________ JPMORGAN CHASE BANK, N.A., as Administrative Agent ​ BANK OF AMERICA, N.A. and CITIBANK, N.A., as Co-Syndication Agents ​ J.P. MORGAN SECURITIES LLC, as Sustainability Structuring Agent ​ ________________________________________ JPMORGAN CHASE BANK, N.A., BOFA SECURITIES, INC. and CITIGROUP GLOBAL MARKETS INC., as Lead Arrangers and Bookrunners ​ ​ ​ Table of Contents Page ​ ​ ​ SECTION 1 DEFINITIONS 1 1.1 Defined Terms 1 1.2 Other Definitional Provisions 31 1.3 Currency Conversion 31 1.4 Interest Rates 32 SECTION 2. THE COMMITTED RATE LOANS; THE NEGOTIATED RATE LOANS; AMOUNT AND TERMS 32 2.1 The Committed Rate Loans 32 2.2 The Negotiated Rate Loans 33 2.3 Loan Accounts 34 2.4 Fees 34 2.5 Termination or Reduction of Commitments; Cancellation of Capital Corporation or JD Luxembourg as Borrower 35 2.6 Prepayments 36 2.7 Minimum Amount of Certain Loans 37 2.8 Committed Rate Loan Interest Rate and Payment Dates 37 2.9 Conversion and Continuation Options 38 2.10 Computation of Interest and Fees. 38 2.11 Inability to Determine Interest Rate 39 2.12 Pro Rata Treatment and Payments 42 2.13 Requirements of Law 44 2.14 Indemnity 48 2.15 Non-Receipt of Funds by the Administrative Agent 48 2.16 Extension of Termination Date 49 2.17 Indemnified Taxes 50 2.18 Confirmations 53 2.19 Replacement of Cancelled Banks 53 2.20 Commitment Increases 53 2.21 [Reserved] 55 2.22 [Reserved] 55 2.23 Defaulting Banks 55 2.24 Judgment Currency 56 2.25 Foreign Currency Exchange Rate 56 2.26 [Reserved]. 56 2.27 Capital Corporation Guaranty 56 2.28 Sustainability Adjustments 58 SECTION 3. REPRESENTATIONS AND WARRANTIES 60 3.1 Financial Condition 60 3.2 Corporate Existence 60 3.3 Corporate Power; Authorization; Enforceable Obligations 60 3.4 No Legal Bar 61 3.5 No Material Litigation 61 3.6 Taxes 61 3.7 Margin Regulations 61 3.8 Use of Proceeds 61 i ​ 3.9 Sanctions Laws and Regulations 61 3.10 Beneficial Ownership Certification 62 SECTION 4. CONDITIONS PRECEDENT 62 4.1 Conditions to Initial Loan 62 4.2 Conditions to All Loans 63 SECTION 5. AFFIRMATIVE COVENANTS 64 5.1 Financial Statements 64 5.2 Certificates; Other Information 64 5.3 Company Indenture Documents 65 5.4 Capital Corporation Indenture Documents 65 5.5 Notice of Default 65 5.6 Ownership of Capital Corporation and JD Luxembourg Stock 65 5.7 Employee Benefit Plans 66 5.8 Compliance 66 SECTION 6. NEGATIVE COVENANTS OF THE COMPANY 66 6.1 Company May Consolidate, etc., Only on Certain Terms 66 6.2 Limitation on Liens 66 6.3 Limitations on Sale and Lease-back Transactions 69 6.4 Equipment Operations Debt 70 SECTION 7. NEGATIVE COVENANTS OF THE CAPITAL CORPORATION 70 7.1 Fixed Charges Ratio 70 7.2 Consolidated Senior Debt to Consolidated Capital Base 70 7.3 Limitation on Liens 70 7.4 Consolidation; Merger 71 SECTION 8. EVENTS OF DEFAULT 72 SECTION 9. THE AGENTS 74 9.1 Appointment 74 9.2 Delegation of Duties 74 9.3 Exculpatory Provisions 75 9.4 Reliance by Agents 75 9.5 Notice of Default 76 9.6 Non-Reliance on Agents and Other Banks 76 9.7 Indemnification 77 9.8 Agents in their Individual Capacities 77 9.9 Successor Agents 77 9.10 Calculations. 78 9.11 Sustainability Matters. 78 9.12 Borrower Communications 78 9.13 Acknowledgements of Banks.. 79 SECTION 10. MISCELLANEOUS 80 10.1 Amendments and Waivers 80 10.2 Notices 80 10.3 No Waiver; Cumulative Remedies 82 10.4 Payment of Expenses 82 ii ​ 10.5 Successors and Assigns; Participations; Purchasing Banks 84 10.6 Adjustments 87 10.7 Confidentiality 87 10.8 Counterparts 88 10.9 GOVERNING LAW 89 10.10 Consent to Jurisdiction and Service of Process 89 10.11 WAIVERS OF JURY TRIAL 90 10.12 USA Patriot Act 90 10.13 No Fiduciary Duty 90 10.14 Headings 90 10.15 Acknowledgment and Consent to Bail-In of Affected Financial Institutions 90 10.16 Bank ERISA Representations 91 10.17 Sustainability Targets 92 ​ ​ ​ ​ SCHEDULES: Schedule I Terms of Subordination Schedule II Commitments Schedule III Sustainability Table ​ ​ EXHIBITS: Exhibit A Form of Borrowing Notice Exhibit B Form of Assignment and Assumption Exhibit C Form of Opinion of General Counsel to the Company Exhibit D Form of Opinion of Special New York Counsel to the Borrowers Exhibit E Form of Extension Request Exhibit F Form of Form W-8BEN-E Tax Letter Exhibit G Form of Form W-8ECI Tax Letter Exhibit H Form of Replacement Bank Agreement Exhibit I Form of Promissory Note Exhibit J Form of New Bank Supplement Exhibit K Form of Commitment Increase Supplement Exhibit L Form of Certificate of Non-Bank Status Exhibit M Form of Pricing Certificate ​ iii 1 ​ ​ ​ CREDIT AGREEMENT, dated as of March 25, 2024, among (a) DEERE & COMPANY, a Delaware corporation (the “ Company ”), (b) JOHN DEERE CAPITAL CORPORATION, a Delaware corporation (the “ Capital Corporation ”), (c) JOHN"
    },
    {
      "chunk_index": 2,
      "section": "item_1a",
      "start_char": 10924,
      "end_char": 16719,
      "word_count": 1000,
      "content": "Extension Request Exhibit F Form of Form W-8BEN-E Tax Letter Exhibit G Form of Form W-8ECI Tax Letter Exhibit H Form of Replacement Bank Agreement Exhibit I Form of Promissory Note Exhibit J Form of New Bank Supplement Exhibit K Form of Commitment Increase Supplement Exhibit L Form of Certificate of Non-Bank Status Exhibit M Form of Pricing Certificate ​ iii 1 ​ ​ ​ CREDIT AGREEMENT, dated as of March 25, 2024, among (a) DEERE & COMPANY, a Delaware corporation (the “ Company ”), (b) JOHN DEERE CAPITAL CORPORATION, a Delaware corporation (the “ Capital Corporation ”), (c) JOHN DEERE BANK S.A., a Luxembourg société anonyme (“ JD Luxembourg ”), (d) the several financial institutions parties hereto (collectively, the “ Banks ”, and individually, a “ Bank ”), (e) JPMORGAN CHASE BANK, N.A., as administrative agent hereunder (in such capacity, together with its successors and permitted assigns, the “ Administrative Agent ”), (f) BANK OF AMERICA, N.A. and CITIBANK, N.A., as co-syndication agents hereunder (in such capacity, the “ Co-Syndication Agents ”), and (g) J.P. MORGAN SECURITIES LLC, as sustainability structuring agent hereunder (in such capacity, the “ Sustainability Structuring Agent ”). The parties hereto hereby agree as follows: SECTION 1. DEFINITIONS 1.1 Defined Terms . As used in this Agreement, the following terms have the following meanings: “ ABR ”: at any particular date, a rate per annum equal to the greatest of (a) the Prime Rate in effect on such day, (b) 0.5% per annum above the NYFRB Rate and (c) the Adjusted Term SOFR Rate for a one month Interest Period as published two U.S. Government Securities Business Days prior to such day (or if such day is not a Business Day, the immediately preceding Business Day) plus 1% ( provided that, for the avoidance of doubt, such Adjusted Term SOFR Rate for any date shall be based on the Term SOFR Reference Rate at approximately 5:00 a.m. Chicago time on such day (or any amended publication time for the Term SOFR Reference Rate, as specified by the CME Term SOFR Administrator in the Term SOFR Reference Rate methodology)). Any change in ABR due to a change in the Prime Rate, the NYFRB Rate or the Adjusted Term SOFR Rate shall be effective from and including the effective date of such change in the Prime Rate, the NYFRB Rate or the Adjusted Term SOFR Rate, respectively. If the ABR is being used as an alternate rate of interest pursuant to ‎subsection 2.11 (for the avoidance of doubt, only until the Benchmark Replacement has been determined pursuant to subsection 2.11(b)), then the ABR shall be the greater of clauses (a) and (b) above and shall be determined without reference to clause (c) above. For the avoidance of doubt, if the ABR as determined pursuant to the foregoing would be less than 1.00%, such rate shall be deemed to be 1.00% for purposes of this Agreement. “ ABR Loans ”: Committed Rate Loans at such time as they are made and/or being maintained at a rate of interest based upon the ABR. “ Act ”: as defined in subsection 10.12. “ Adjusted Daily Simple CORRA ”: an interest rate per annum equal to (a) Daily Simple CORRA, plus (b) 0.29547%; provided that if Adjusted Daily Simple CORRA as so determined would be less than the Floor, such rate shall be deemed to be equal to the Floor for the purposes of this Agreement “ Adjusted Daily Simple SOFR ”: an interest rate per annum equal to (a) Daily Simple SOFR, plus (b) 0.10%; provided that if Adjusted Daily Simple SOFR as so determined would be less than the Floor, such rate shall be deemed to be equal to the Floor for the purposes of this Agreement. “ Adjusted Daily Simple SONIA ”: an interest rate per annum equal to (a) Daily Simple SONIA, plus (b) 0.0326%; provided that if Adjusted Daily Simple SONIA as so determined would be less than the Floor, such rate shall be deemed to be equal to the Floor for the purposes of this Agreement. ​ 2 ​ ​ ​ “ Adjusted Term CORRA Rate ”: for purposes of any calculation, the rate per annum equal to (a) Term CORRA for such calculation, plus (b) 0.29547% for a one month interest period or 0.32138% for a three month interest period; provided that if Adjusted Term CORRA Rate as so determined would be less than the Floor, such rate shall be deemed to be equal to the Floor for the purposes of this Agreement. “ Adjusted Term SOFR Rate ”: with respect to any Term Benchmark Borrowing denominated in Dollars for any Interest Period, an interest rate per annum equal to (a) the Term SOFR Rate for such Interest Period, plus (b) 0.10%; provided that if the Adjusted Term SOFR Rate as so determined would be less than the Floor, such rate shall be deemed to be equal to the Floor for the purposes of this Agreement. “ Administrative Agent ”: as defined in the preamble hereto. “ Administrative Questionnaire ”: an Administrative Questionnaire in a form supplied by the Administrative Agent. “ Affected Financial Institution ”: (a) any EEA Financial Institution or (b) any UK Financial Institution. “ Affected Foreign Currency ”: as defined in subsection 2.11(a). “ Agent ”: the Administrative Agent, the Syndication Agent, or the Sustainability Structuring Agent, as the context shall require; together, the “Agents”. “ Agreement ”: this Credit Agreement as amended, supplemented or modified from time to time. “ Agreement Currency ”: as defined in subsection 2.24(b). “ Ancillary Document ”: as defined in subsection 10.8. “ Anti-Corruption Laws ”: all laws, rules and regulations of any jurisdiction applicable to the Borrowers and their Subsidiaries from time to time concerning or relating to bribery or corruption. “ Applicable Creditor ”: as defined in subsection 2.24(b). “ Applicable Margin ”: (a) with respect to ABR Loans, the rate per annum set forth below for ABR Loans in the column"
    },
    {
      "chunk_index": 3,
      "section": "item_1a",
      "start_char": 16103,
      "end_char": 22199,
      "word_count": 1000,
      "content": "shall require; together, the “Agents”. “ Agreement ”: this Credit Agreement as amended, supplemented or modified from time to time. “ Agreement Currency ”: as defined in subsection 2.24(b). “ Ancillary Document ”: as defined in subsection 10.8. “ Anti-Corruption Laws ”: all laws, rules and regulations of any jurisdiction applicable to the Borrowers and their Subsidiaries from time to time concerning or relating to bribery or corruption. “ Applicable Creditor ”: as defined in subsection 2.24(b). “ Applicable Margin ”: (a) with respect to ABR Loans, the rate per annum set forth below for ABR Loans in the column corresponding to the Prevailing Rating of the Company, (b) with respect to Eurocurrency Loans, the rate per annum set forth below for Eurocurrency Loans in the column corresponding to the Prevailing Rating of the Company, (c) with respect to Term Benchmark Loans, Daily Simple CORRA Loans and Daily Simple SOFR Loans, the rate per annum set forth below for Term Benchmark Loans, Daily Simple CORRA Loans and Daily Simple SOFR Loans in the column corresponding to the Prevailing Rating of the Company and (d) with respect to SONIA Loans, the rate per annum set forth below for SONIA Loans in the column corresponding to the Prevailing Rating of the Company: ​ ​ 3 ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ Level I Rating Level II Rating Level III Rating Level IV Rating Level V Rating ABR Loans 0.00% 0.00% 0.00% 0.00% 0.25% Eurocurrency Loans 0.625% 0.75% 0.875% 1.00% 1.25% Term Benchmark Loans, Daily Simple CORRA Loans and Daily Simple SOFR Loans 0.625% 0.75% 0.875% 1.00% 1.25% SONIA Loans 0.625% 0.75% 0.875% 1.00% 1.25% ​ Each change in the Prevailing Rating resulting from a publicly announced change in the Credit Ratings shall be effective during the period commencing on the date that is 3 Business Days after the date of the public announcement thereof and ending on the date immediately preceding the effective date of the next such change. It is hereby understood and agreed that the Applicable Margin with respect to ABR Loans, Eurocurrency Loans, Term Benchmark Loans, Daily Simple CORRA Loans, Daily Simple SOFR Loans and SONIA Loans shall be adjusted from time to time based upon the Sustainability Rate Adjustment (to be calculated and applied as set forth in subsection 2.28); provided that in no event shall the Applicable Margin be less than zero. “ Approved Borrower Portal ”: has the meaning assigned to it in subsection 9.12. “ Attributable Debt ”: as defined in subsection 6.2(b)(ii). “ Australian Dollars ”: the lawful currency of Australia. “ Available Commitment ”: as to any Bank at any time, an amount equal to the excess, if any, of (a) such Bank’s Commitment then in effect over (b) such Bank’s Loans then outstanding. “ Available Tenor ”: as of any date of determination and with respect to the then-current Benchmark in respect of Loans denominated in such Currency, as applicable, any tenor for such Benchmark or payment period for interest calculated with reference to such Benchmark, as applicable, that is or may be used for determining the length of an Interest Period with respect to Loans denominated in the applicable Currency pursuant to this Agreement as of such date and not including, for the avoidance of doubt, any tenor for such Benchmark that is then-removed from the definition of “Interest Period” pursuant to clause (e) of subsection 2.11. “ Bail-In Action ”: the exercise of any Write-Down and Conversion Powers by the applicable Resolution Authority in respect of any liability of an Affected Financial Institution. ​ 4 ​ ​ ​ “ Bail-In Legislation ”: (a) with respect to any EEA Member Country implementing Article 55 of Directive 2014/59/EU of the European Parliament and of the Council of the European Union, the implementing law, regulation, rule or requirement for such EEA Member Country from time to time which is described in the EU Bail-In Legislation Schedule and (b) with respect to the United Kingdom, Part I of the United Kingdom Banking Act 2009 (as amended from time to time) and any other law, regulation or rule applicable in the United Kingdom relating to the resolution of unsound or failing banks, investment firms or other financial institutions or their affiliates (other than through liquidation, administration or other insolvency proceedings). “ Bank ” and “ Banks ”: as defined in the preamble hereto. “ Benchmark ”: initially, with respect to any (i) SONIA Loan, Adjusted Daily Simple SONIA, (ii) Daily Simple CORRA Loan, Adjusted Daily Simple CORRA, (iii) Daily Simple SOFR Loan, Adjusted Daily Simple SOFR or (iv) Term Benchmark Loan or Eurocurrency Loan, the Relevant Rate for such Currency; provided that if a Benchmark Transition Event and the related Benchmark Replacement Date have occurred with respect to the applicable Relevant Rate or the then-current Benchmark with respect to Loans denominated in such Currency, then “Benchmark” means the applicable Benchmark Replacement to the extent that such Benchmark Replacement has replaced such prior benchmark rate pursuant to clause (b) of subsection 2.11. “ Benchmark Replacement ”: for any Available Tenor, the first alternative set forth in the order below that can be determined by the Administrative Agent for the applicable Benchmark Replacement Date; provided that in the case of any Loan denominated in a Foreign Currency (other than any Loan denominated in Canadian Dollars), “Benchmark Replacement” shall mean the alternative set forth in (2) below: (1) in the case of any Loan denominated in Dollars, the Adjusted Daily Simple SOFR and/or in the case of any Loan denominated Canadian Dollars, the Adjusted Daily Simple CORRA; (2) the sum of: (a) the alternate benchmark rate that has been selected by the Administrative Agent and the Company as the replacement for the then-current Benchmark for the applicable Corresponding Tenor with respect to Loans denominated in such Currency giving due consideration to (i) any selection or recommendation of a replacement benchmark rate or the mechanism for determining such a rate by the Relevant Governmental"
    },
    {
      "chunk_index": 4,
      "section": "item_1a",
      "start_char": 21577,
      "end_char": 28160,
      "word_count": 1000,
      "content": "forth in (2) below: (1) in the case of any Loan denominated in Dollars, the Adjusted Daily Simple SOFR and/or in the case of any Loan denominated Canadian Dollars, the Adjusted Daily Simple CORRA; (2) the sum of: (a) the alternate benchmark rate that has been selected by the Administrative Agent and the Company as the replacement for the then-current Benchmark for the applicable Corresponding Tenor with respect to Loans denominated in such Currency giving due consideration to (i) any selection or recommendation of a replacement benchmark rate or the mechanism for determining such a rate by the Relevant Governmental Body and/or (ii) any evolving or then-prevailing market convention for determining a benchmark rate as a replacement for the then-current Benchmark for syndicated credit facilities denominated in the applicable Currency at such time and (b) the related Benchmark Replacement Adjustment. If the Benchmark Replacement as determined pursuant to the above would be less than the Floor, the Benchmark Replacement will be deemed to be the Floor for the purposes of this Agreement and the other Loan Documents. “ Benchmark Replacement Adjustment ”: with respect to any replacement of the then-current Benchmark with respect to Loans denominated in any Currency with an Unadjusted Benchmark Replacement for any applicable Interest Period and Available Tenor for any setting of such Unadjusted Benchmark Replacement, the spread adjustment, or method for calculating or determining such spread adjustment, (which may be a positive or negative value or zero) that has been selected by the Administrative Agent and the Company for the applicable Corresponding Tenor giving due consideration to (i) any selection or recommendation of a spread adjustment, or method for calculating or determining such spread adjustment, for the replacement of such Benchmark with the applicable Unadjusted ​ 5 ​ ​ ​ Benchmark Replacement by the Relevant Governmental Body on the applicable Benchmark Replacement Date and/or (ii) any evolving or then-prevailing market convention for determining a spread adjustment, or method for calculating or determining such spread adjustment, for the replacement of such Benchmark with the applicable Unadjusted Benchmark Replacement for syndicated credit facilities denominated in the applicable Currency at such time. “ Benchmark Replacement Conforming Changes ”: with respect to any Benchmark Replacement in respect of Loans denominated in any Currency, any technical, administrative or operational changes (including changes to the definition of “ABR,” the definition of “Business Day,” the definition of “SONIA Business Day,” the definition of “U.S. Government Securities Business Day,” the definition of “Interest Period,” timing and frequency of determining rates and making payments of interest, timing of borrowing requests or prepayment, conversion or continuation notices, length of lookback periods, the applicability of breakage provisions, and other technical, administrative or operational matters) that the Administrative Agent decides in its reasonable discretion (in consultation with the Company) may be appropriate to reflect the adoption and implementation of such Benchmark Replacement and to permit the administration thereof by the Administrative Agent in a manner substantially consistent with market practice (or, if the Administrative Agent decides in its reasonable discretion that adoption of any portion of such market practice is not administratively feasible or if the Administrative Agent reasonably determines that no market practice for the administration of such Benchmark Replacement exists, in such other manner of administration as the Administrative Agent determines (in consultation with the Company) is reasonably necessary in connection with the administration of this Agreement and the other Loan Documents); provided that, notwithstanding anything herein to the contrary, no “Benchmark Replacement Conforming Changes” shall result in any material effect on the timing or amount of payments or borrowings without the consent of the Company. “ Benchmark Replacement Date ”: with respect to the Benchmark for any Loan denominated in any Currency, the earliest to occur of the following events with respect to such then-current Benchmark: (1) in the case of clause (1) or (2) of the definition of “Benchmark Transition Event,” the later of (a) the date of the public statement or publication of information referenced therein and (b) the date on which the administrator of such Benchmark (or the published component used in the calculation thereof) permanently or indefinitely ceases to provide all Available Tenors of such Benchmark (or such component thereof); or (2) in the case of clause (3) of the definition of “Benchmark Transition Event,” the first date on which such Benchmark (or the published component used in the calculation thereof) has been determined and announced by the regulatory supervisor for the administrator of such Benchmark (or such component thereof) to be no longer representative; provided, that such non-representativeness will be determined by reference to the most recent statement or publication referenced in such clause (3) and even if any Available Tenor of such Benchmark (or such component thereof) continues to be provided on such date. For the avoidance of doubt, (i) if the event giving rise to the Benchmark Replacement Date occurs on the same day as, but earlier than, the Reference Time in respect of any determination, the Benchmark Replacement Date will be deemed to have occurred prior to the Reference Time for such determination and (ii) the “Benchmark Replacement Date” will be deemed to have occurred in the case of clause (1) or (2) with respect to any Benchmark upon the occurrence of the applicable event or events set forth therein with respect to all then-current Available Tenors of such Benchmark (or the published component used in the calculation thereof). ​ 6 ​ ​ ​ “ Benchmark Transition Event ”: with respect to the Benchmark for any Loan denominated in any Currency, the occurrence of one or more of the following events with respect to such then-current Benchmark: (1) a public statement or publication of information by or on behalf of the administrator of such Benchmark (or the published component used in the calculation thereof) announcing that such administrator has ceased or will cease to provide all Available Tenors of such Benchmark (or such component thereof), permanently or indefinitely, provided that, at the time of such statement"
    },
    {
      "chunk_index": 5,
      "section": "item_1a",
      "start_char": 27540,
      "end_char": 33704,
      "word_count": 1000,
      "content": "the calculation thereof). ​ 6 ​ ​ ​ “ Benchmark Transition Event ”: with respect to the Benchmark for any Loan denominated in any Currency, the occurrence of one or more of the following events with respect to such then-current Benchmark: (1) a public statement or publication of information by or on behalf of the administrator of such Benchmark (or the published component used in the calculation thereof) announcing that such administrator has ceased or will cease to provide all Available Tenors of such Benchmark (or such component thereof), permanently or indefinitely, provided that, at the time of such statement or publication, there is no successor administrator that will continue to provide any Available Tenor of such Benchmark (or such component thereof); (2) a public statement or publication of information by the regulatory supervisor for the administrator of such Benchmark (or the published component used in the calculation thereof), the Federal Reserve Board, the NYFRB, the CME Term SOFR Administrator, the central bank for the Currency applicable to such Benchmark, an insolvency official with jurisdiction over the administrator for such Benchmark (or such component), a resolution authority with jurisdiction over the administrator for such Benchmark (or such component) or a court or an entity with similar insolvency or resolution authority over the administrator for such Benchmark (or such component), in each case, which states that the administrator of such Benchmark (or such component) has ceased or will cease to provide all Available Tenors of such Benchmark (or such component thereof) permanently or indefinitely; provided that, at the time of such statement or publication, there is no successor administrator that will continue to provide any Available Tenor of such Benchmark (or such component thereof); or (3) a public statement or publication of information by the regulatory supervisor for the administrator of such Benchmark (or the published component used in the calculation thereof) announcing that all Available Tenors of such Benchmark (or such component thereof) are no longer, or as of a specified future date will no longer be, representative. For the avoidance of doubt, a “Benchmark Transition Event” will be deemed to have occurred with respect to any Benchmark if a public statement or publication of information set forth above has occurred with respect to each then-current Available Tenor of such Benchmark (or the published component used in the calculation thereof). “ Benchmark Unavailability Period ”: with respect to the Benchmark for any Loan denominated in any Currency, the period (if any) (x) beginning at the time that a Benchmark Replacement Date pursuant to clauses (1) or (2) of that definition has occurred if, at such time, no Benchmark Replacement has replaced such then-current Benchmark for all purposes hereunder and under any Loan Document in accordance with subsection 2.11 and (y) ending at the time that a Benchmark Replacement has replaced such then-current Benchmark for all purposes hereunder and under any Loan Document in accordance with subsection 2.11. “ Beneficial Ownership Certificati on”: a certification regarding beneficial ownership or control as required by the Beneficial Ownership Regulation. “ Beneficial Ownership Regulation ”: 31 C.F.R. § 1010.230. “ benefitted Bank ”: as defined in subsection 10.6. “ Board ”: the Board of Governors of the Federal Reserve System of the United States (or any successor). ​ 7 ​ ​ ​ “ Borrower ”: the Company, the Capital Corporation or JD Luxembourg; collectively, the “ Borrowers ”. “ Borrowing Date ”: in respect of any Loan, the date such Loan is made. “ Business Day ”: a day other than a Saturday, Sunday or other day on which commercial banks in New York City or Chicago are authorized or required by law to close; provided , that (a) when used in connection with a Foreign Currency Loan, (in each case, other than in connection with any calculation or determination of interest rate in respect of a SONIA Loan or a Loan denominated in Euros), the term “Business Day” shall also exclude any day on which banks are authorized or required by law to be closed in the principal financial center for that currency, including without limitation, Toronto in respect of Loans denominated in Canadian Dollars, (b) in relation to any calculation or determination of interest rate in respect of a SONIA Loan, “Business Day” shall mean a SONIA Business Day, (c) in relation to any calculation or determination of interest rate in respect of any Loan denominated in Euros and in relation to the calculation or computation of the Eurocurrency Rate in respect thereof, “Business Day” shall mean any day which is a TARGET Day and (d) in relation to any calculation or determination of interest rate in respect of any Daily Simple SOFR Loan, “Business Day” shall mean any day which is a U.S. Government Securities Business Day. “ Calculation Date ”: with respect to each Foreign Currency, the last day of each calendar quarter (or, if such day is not a Business Day, the next succeeding Business Day) and such other days from time to time as the Administrative Agent shall reasonably designate as a “Calculation Date”; provided , that the second Business Day preceding each Borrowing Date with respect to, and preceding each date of any borrowing, conversion or continuation of, any Foreign Currency Loan shall also be a “Calculation Date” with respect to the relevant Foreign Currency; provided further that with respect to any SONIA Loan, Daily Simple SOFR Loan or Daily Simple CORRA Loan, each date that is on the numerically corresponding day in each calendar month that is one month after the borrowing of such Loan (or, if there is no such numerically corresponding day in such month, then the last day of such month) shall also be a “Calculation Date”. “ Calendar Quarter ”: a three-month period consisting of (i) each January, February and March, (ii) each April, May and June, (iii) each July, August and September or (iv) each October, November and December. “ Canadian Dollars ”: the lawful currency of Canada. “ Cancelled Bank"
    },
    {
      "chunk_index": 6,
      "section": "item_1a",
      "start_char": 33125,
      "end_char": 39043,
      "word_count": 1000,
      "content": "Loan or Daily Simple CORRA Loan, each date that is on the numerically corresponding day in each calendar month that is one month after the borrowing of such Loan (or, if there is no such numerically corresponding day in such month, then the last day of such month) shall also be a “Calculation Date”. “ Calendar Quarter ”: a three-month period consisting of (i) each January, February and March, (ii) each April, May and June, (iii) each July, August and September or (iv) each October, November and December. “ Canadian Dollars ”: the lawful currency of Canada. “ Cancelled Bank ”: (i) any Bank that has the whole or any part of its Commitment cancelled under subsection 2.13(a), (b) or (c), subsection 2.16(c) or subsection 2.17(b) or the Commitment of which has expired under subsection 2.16(a) and (ii) any Defaulting Bank that the Company designates in writing to such Bank and the Administrative Agent as a Cancelled Bank. “ Capital Corporation ”: as defined in the preamble hereto. “ CBR Loan ”: a Loan that bears interest at a rate determined by reference to the Central Bank Rate. “ CBR Spread ”: the Applicable Margin, applicable to such Loan that is replaced by a CBR Loan. “ Central Bank Rate ”: a rate equal to the greater of (i) (A) for any Loan denominated in (a) Pounds Sterling, the Bank of England (or any successor thereto)’s “Bank Rate” as published by the ​ 8 ​ ​ ​ Bank of England (or any successor thereto) from time to time, (b) Euros, one of the following three rates as may be selected by the Administrative Agent in its reasonable discretion (provided, that the Administrative Agent shall have generally selected such rate for similarly situated borrowers): (1) the fixed rate for the main refinancing operations of the European Central Bank (or any successor thereto), or, if that rate is not published, the minimum bid rate for the main refinancing operations of the European Central Bank (or any successor thereto), each as published by the European Central Bank (or any successor thereto) from time to time, (2) the rate for the marginal lending facility of the European Central Bank (or any successor thereto), as published by the European Central Bank (or any successor thereto) from time to time or (3) the rate for the deposit facility of the central banking system of the Participating Member States, as published by the European Central Bank (or any successor thereto) from time to time, and (c) subject to subsection 2.11 in respect of Term Benchmark Loans denominated in Canadian Dollars, any other Foreign Currency, a central bank rate as determined by the Administrative Agent in its reasonable discretion (provided, that the Administrative Agent shall have generally selected such rate for similarly situated borrowers), plus (B) the applicable Central Bank Rate Adjustment and (ii) the Floor. “ Central Bank Rate Adjustment ”: for any day, for any Loan denominated in (a) Euros, a rate equal to the difference (which may be a positive or negative value or zero) of (i) the average of the Eurocurrency Rate for Loans denominated in Euros for the five most recent Business Days preceding such day for which the EURIBOR Screen Rate was available (excluding, from such averaging, the highest and the lowest Eurocurrency Rate applicable during such period of five Business Days) minus (ii) the Central Bank Rate in respect of Euros in effect on the last Business Day in such period, (b) Pounds Sterling, a rate equal to the difference (which may be a positive or negative value or zero) of (i) the average of Adjusted Daily Simple SONIA for Loans in Pounds Sterling for the five most recent SONIA Business Days preceding such day for which SONIA was available (excluding, from such averaging, the highest and the lowest such Adjusted Daily Simple SONIA applicable during such period of five SONIA Business Days) minus (ii) the Central Bank Rate in respect of Pounds Sterling in effect on the last SONIA Business Day in such period, and (c) subject to Section 2.11 in respect of Term Benchmark Loans denominated in Canadian Dollars, any other Foreign Currency, a Central Bank Rate Adjustment as determined by the Administrative Agent in its reasonable discretion (provided, that the Administrative Agent shall have generally selected such rate for similarly situated borrowers). For purposes of this definition, (x) the term Central Bank Rate shall be determined disregarding clause (B) of the definition of such term and (y) the Eurocurrency Rate in respect of Loans denominated in Euros on any day shall be based on the EURIBOR Screen Rate on such day at approximately the time referred to in the definition of such term for deposits in Euros for a maturity of one month. “ Certificate of Non-Bank Status ”: a certificate substantially in the form and substance of Exhibit L. “ Closing Date ”: the date on which each of the conditions precedent specified in subsection 4.1 shall have been satisfied (or compliance therewith shall have been waived by the Majority Banks hereunder). “ CME Term SOFR Administrator ”: CME Group Benchmark Administration Limited as administrator of the forward-looking term Secured Overnight Financing Rate (SOFR) (or a successor administrator). “ Co-Syndication Agents ”: as defined in the preamble hereto. “ Code ”: the Internal Revenue Code of 1986, as amended from time to time. “ Code of Conduct ”: as defined in subsection 3.9. ​ 9 ​ ​ ​ “ Commitment ”: as to any Bank, the amount set opposite such Bank’s name on Schedule II or in any assignment pursuant to which such Bank becomes a party hereto with respect to any interest purchased therein, as such amount may be modified as provided herein; collectively, as to all Banks, the “ Commitments ”. “ Commitment Expiration Date ”: as defined in subsection 2.16(a). “ Commitment Fee Rate ”: the rate per annum set forth below in the column corresponding to the Prevailing Rating of the Company: ​"
    },
    {
      "chunk_index": 7,
      "section": "item_1a",
      "start_char": 38493,
      "end_char": 44656,
      "word_count": 1000,
      "content": "”: as defined in subsection 3.9. ​ 9 ​ ​ ​ “ Commitment ”: as to any Bank, the amount set opposite such Bank’s name on Schedule II or in any assignment pursuant to which such Bank becomes a party hereto with respect to any interest purchased therein, as such amount may be modified as provided herein; collectively, as to all Banks, the “ Commitments ”. “ Commitment Expiration Date ”: as defined in subsection 2.16(a). “ Commitment Fee Rate ”: the rate per annum set forth below in the column corresponding to the Prevailing Rating of the Company: ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ Level I Rating Level II Rating ​ Level III Rating Level IV Rating Level V Rating 0.03% .035% 0.04% .06% .10% ​ It is hereby understood and agreed that the Commitment Fee Rate shall be adjusted from time to time based upon the Sustainability Facility Fee Adjustment (to be calculated and applied as set forth in subsection 2.28). ​ “ Commitment Increase Notice ”: as defined in subsection 2.20(a). “ Commitment Increase Supplement ”: as defined in subsection 2.20(c). “ Commitment Percentage ”: as to any Bank at any time, the percentage which such Bank’s Commitment at such time constitutes of all the Commitments at such time or, at any time after the Commitments shall have expired or terminated, the percentage which the aggregate principal amount of such Bank’s Loans then outstanding constitutes of the aggregate principal amount of all Loans then outstanding; collectively, as to all the Banks, the “ Commitment Percentages ”; provided that when a Defaulting Bank shall exist, “ Commitment Percentage ” shall mean, when appropriate as determined by the Administrative Agent in order to provide ratable treatment at any time a Defaulting Bank exists (and without increasing the Commitment of any Bank), the percentage of the total Commitments (disregarding any Defaulting Bank’s Commitment) represented by such Bank’s Commitment. “ Commitment Period ”: as to any Bank at any time, the period from and including the Closing Date to but not including the Termination Date of such Bank or such earlier date on which the Commitments shall terminate as provided herein. “ Committed Rate Loans ”: each loan made pursuant to subsection 2.1. “ Commonly Controlled Entity ”: in relation to a Borrower, an entity, whether or not incorporated, which is under common control with such Borrower within the meaning of Section 414(b) or (c) of the Code. “ Company ”: as defined in the preamble hereto. “ Consolidated Capital Base ”: at a particular time for the Capital Corporation and its consolidated Subsidiaries, the sum of (a) the amount shown opposite the item “Total Stockholders’ Equity” on the consolidated balance sheet of the Capital Corporation and its consolidated Subsidiaries plus (b) all indebtedness of the Capital Corporation and its consolidated Subsidiaries for borrowed money subordinated (on terms no less favorable to the Administrative Agent and the Banks than the terms of subordination set forth on Schedule I) to the indebtedness which may be incurred hereunder by the ​ 10 ​ ​ ​ Capital Corporation, provided that the sum of clauses (a) and (b) hereof as at the end of a fiscal quarter of the Capital Corporation and its consolidated Subsidiaries (including the last quarter of a fiscal year of the Capital Corporation and its consolidated Subsidiaries) shall be determined by reference to the publicly available consolidated balance sheet of the Capital Corporation and its consolidated Subsidiaries as at the end of such fiscal quarter and after such adjustments, if any, as may be required so that the sum of the amounts referred to in clauses (a) and (b) is determined in accordance with GAAP. Notwithstanding the foregoing, for purposes of determining compliance with subsection 7.2, adjustments resulting from any accumulated other comprehensive income as reflected on the most recent publicly available consolidated balance sheet of the Capital Corporation and its consolidated Subsidiaries as at the end of any fiscal quarter of the Capital Corporation and its consolidated Subsidiaries (including the last quarter of any fiscal year of the Capital Corporation and its consolidated Subsidiaries) shall be deemed not to be included in Consolidated Capital Base. “ Consolidated Net Worth ”: as defined in subsection 6.2(b)(ii). “ Consolidated Senior Debt ”: at a particular time for the Capital Corporation and its consolidated Subsidiaries, indebtedness for borrowed money other than any indebtedness for borrowed money that is subordinated, on terms no less favorable to the Administrative Agent and the Banks than the terms of subordination set forth on Schedule I, to the indebtedness which may be incurred hereunder by the Capital Corporation, provided that the amount of such indebtedness for borrowed money (other than such subordinated indebtedness) as at the end of a fiscal quarter of the Capital Corporation and its consolidated Subsidiaries (including the last quarter of a fiscal year of the Capital Corporation and its consolidated Subsidiaries) shall be determined by reference to the publicly available consolidated balance sheet of the Capital Corporation and its consolidated Subsidiaries as at the end of such fiscal quarter and after such adjustments, if any, as may be required so that such amount is determined in accordance with GAAP. Notwithstanding the foregoing, for purposes of determining compliance with subsection 7.2, indebtedness for borrowed money in respect of any Securitization Indebtedness shall be deemed not included in Consolidated Senior Debt. “ Contractual Obligation ”: as to any Person, any provision of any security issued by such Person or of any agreement, instrument or undertaking to which such Person is a party or by which it or any of its property is bound. “ CORRA ”: the Canadian Overnight Repo Rate Average administered and published by the CORRA Administrator. “ CORRA Administrator ”: the Bank of Canada (or any successor administrator). “ CORRA Determination Date ”: as defined in the definition of Daily Simple CORRA. “ CORRA Rate Day ”: as defined in the definition of Daily Simple CORRA. “ Corresponding Tenor"
    },
    {
      "chunk_index": 8,
      "section": "item_1a",
      "start_char": 44073,
      "end_char": 49717,
      "word_count": 1000,
      "content": "Contractual Obligation ”: as to any Person, any provision of any security issued by such Person or of any agreement, instrument or undertaking to which such Person is a party or by which it or any of its property is bound. “ CORRA ”: the Canadian Overnight Repo Rate Average administered and published by the CORRA Administrator. “ CORRA Administrator ”: the Bank of Canada (or any successor administrator). “ CORRA Determination Date ”: as defined in the definition of Daily Simple CORRA. “ CORRA Rate Day ”: as defined in the definition of Daily Simple CORRA. “ Corresponding Tenor ”: with respect to any Available Tenor, as applicable, either a tenor (including overnight) or an interest payment period having approximately the same length (disregarding business day adjustment) as such Available Tenor. “ Credit Rating ”: as of any date, (a) as to any Person, the rating assigned to the relevant long term senior unsecured (and non-credit enhanced) Debt obligations of such Person by Moody’s, S&P or Fitch, in each case as of the close of business on such date and (b) if no rating for such Debt described in clause (a) is available, the corporate credit rating of such Person as announced by Moody’s, S&P or Fitch, in each case as of the close of business on such date. ​ 11 ​ ​ ​ “ Currency ”: any Dollars and any Foreign Currency. “ Daily Simple CORRA ”: for any day (a “CORRA Rate Day”), a rate per annum equal to CORRA for the day (such day “CORRA Determination Date”) that is five (5) Business Days prior to (i) if such CORRA Rate Day is a Business Day, such CORRA Rate Day or (ii) if such CORRA Rate Day is not an Business Day, the Business Day immediately preceding such CORRA Rate Day, in each case, as such CORRA is published by the CORRA Administrator on the CORRA Administrator’s website. Any change in Daily Simple CORRA due to a change in CORRA shall be effective from and including the effective date of such change in CORRA without notice to the Borrower. If by 5:00 p.m. (Toronto time) on any given CORRA Determination Date, CORRA in respect of such CORRA Determination Date has not been published on the CORRA Administrator’s website and a Benchmark Replacement Date with respect to the Daily Simple CORRA has not occurred, then CORRA for such CORRA Determination Date will be CORRA as published in respect of the first preceding Business Day for which such CORRA was published on the CORRA Administrator’s website, so long as such first preceding Business Day is not more than five (5) Business Days prior to such CORRA Determination Day. “ Daily Simple CORRA Loan ”: a Loan that bears interest at a rate based on the Adjusted Daily Simple CORRA. “ Daily Simple SOFR ”: for any day (a “ SOFR Rate Day ”), a rate per annum equal to (a) SOFR for the day (such day “ SOFR Determination Date ”) that is five U.S. Government Securities Business Days prior to (i) if such SOFR Rate Day is a U.S. Government Securities Business Day, such SOFR Rate Day or (ii) if such SOFR Rate Day is not a U.S. Government Securities Business Day, the U.S. Government Securities Business Day immediately preceding such SOFR Rate Day, in each case, as such SOFR is published by the SOFR Administrator on the SOFR Administrator’s Website or (b) if SOFR is not available for the SOFR Determination Date determined pursuant to clause (a) above, by 5:00 p.m., New York City time, on any day of determination of Daily Simple SOFR, then Daily Simple SOFR for such day will be SOFR as published in respect of the first preceding U.S. Government Securities Business Day prior to the SOFR Determination Date for which SOFR was published on the SOFR Administrator’s Website; provided that Daily Simple SOFR determined pursuant to this clause (b) shall be utilized for purposes of calculation of Daily Simple SOFR for no more than three consecutive SOFR Rate Days and thereafter subsection 2.11(a) shall govern. Any change in Daily Simple SOFR due to a change in SOFR shall be effective from and including the effective date of such change in SOFR without notice to the Borrower. “ Daily Simple SOFR Loan ”: a Loan that bears interest at a rate based on the Adjusted Daily Simple SOFR. “ Daily Simple SONIA ”: for any day (a “ SONIA Interest Day ”), an interest rate per annum equal to (a) SONIA for the day that is five SONIA Business Days (such fifth SONIA Business Day determined pursuant to each of subclauses (i) and (ii), the “ SONIA Lookback Day ”) prior to (i) if such SONIA Interest Day is a SONIA Business Day, such SONIA Interest Day or (ii) if such SONIA Interest Day is not a SONIA Business Day, the SONIA Business Day immediately preceding such SONIA Interest Day or (b) if SONIA is not available for the SONIA Lookback Day determined pursuant to clause (a) above, by 5:00 p.m., London time on any day of determination of Daily Simple SONIA, then Daily Simple SONIA for such day will be SONIA as published in respect of the first preceding SONIA Business Day prior to the SONIA Lookback Day for which SONIA was published on the SONIA Administrator’s Website; provided that Daily Simple SONIA determined pursuant to this clause (b) shall be utilized for purposes of calculation of Daily Simple SONIA for no more than three consecutive SONIA Interest Days and thereafter subsection 2.11(a) shall govern. Any change in Daily Simple SONIA due to ​ 12 ​ ​ ​ a change in SONIA shall be effective from and including the effective date of such change in SONIA without notice to the Borrower. “ Deal Year ”: as defined in subsection 2.16(c). “ Debt ”: as defined in subsection 6.2. “ Default ”: any of the events specified in Section 8, whether or not"
    },
    {
      "chunk_index": 9,
      "section": "item_1a",
      "start_char": 49161,
      "end_char": 55022,
      "word_count": 1000,
      "content": "SONIA determined pursuant to this clause (b) shall be utilized for purposes of calculation of Daily Simple SONIA for no more than three consecutive SONIA Interest Days and thereafter subsection 2.11(a) shall govern. Any change in Daily Simple SONIA due to ​ 12 ​ ​ ​ a change in SONIA shall be effective from and including the effective date of such change in SONIA without notice to the Borrower. “ Deal Year ”: as defined in subsection 2.16(c). “ Debt ”: as defined in subsection 6.2. “ Default ”: any of the events specified in Section 8, whether or not any requirement for the giving of notice, the lapse of time, or both, or any other condition, event or act has been satisfied. “ Defaulting Bank ”: any Bank that has (a) failed to fund any portion of its Loans within two Business Days of the date required to be funded by it hereunder, unless such Bank has notified the Administrative Agent and the Borrower that such failure is the result of such Bank’s good faith determination that one or more conditions precedent to funding has not been satisfied; (b) notified the Company, the Administrative Agent, any Bank in writing that it does not intend to comply with any of its funding obligations under this Agreement or has made a public statement to the effect that it does not intend to comply with its funding obligations under this Agreement or generally under other agreements in which it commits to extend credit; (c) failed, within three Business Days after written request by the Administrative Agent, to confirm that it will comply with the terms of this Agreement relating to its obligations to fund prospective Loans; provided that such Bank shall cease to be a Defaulting Bank pursuant to this clause (c) upon receipt of such written confirmation by the Administrative Agent and the Borrower; (d) otherwise failed to pay over to the Administrative Agent or any other Bank any other amount required to be paid by it hereunder within three Business Days of the date when due, unless the subject of a good faith dispute; or (e) (i) become or is insolvent or has a parent company that has become or is insolvent, (ii) become the subject of a bankruptcy or insolvency proceeding, or has had a receiver, conservator, trustee or custodian appointed for it, or has taken any action in furtherance of, or indicating its consent to, approval of or acquiescence in any such proceeding or appointment or has a parent company that has become the subject of a bankruptcy or insolvency proceeding, or has had a receiver, conservator, trustee or custodian appointed for it, or has taken any action in furtherance of, or indicating its consent to, approval of or acquiescence in any such proceeding or appointment or (iii) become or has a parent company that has become the subject of a Bail-In Action; provided that a Bank shall not be a Defaulting Bank solely by virtue of the ownership or acquisition of any equity interest in that Bank or any direct or indirect parent company thereof by a Governmental Authority so long as such ownership interest does not result in or provide such Bank with immunity from the jurisdiction of courts within the United States or from the enforcement of judgments or writs of attachment on its assets or permit such Bank (or such Governmental Authority) to reject, repudiate, disavow or disaffirm any contracts or agreements made with such Bank. If any Bank shall become a Defaulting Bank, the Company shall have the right, so long as no Event of Default has occurred and is then continuing, upon giving written notice to the Administrative Agent and such Bank in accordance with subsection 2.6, notwithstanding subsection 2.12(b), to prepay in full the Loans of such Bank, together with accrued interest thereon, any amounts payable to such Bank pursuant to subsections 2.13, 2.14, 2.15 and 2.17 and any accrued and unpaid commitment fee or other amount payable to such Bank hereunder and/or, upon giving not less than three Business Days’ notice to such Bank and the Administrative Agent, to cancel the whole or part of the Commitment of any such Bank. “ Designated Person ”: a Person (i) listed in the annex to, or otherwise the subject of the provisions of, any Executive Order; ​ 13 ​ ​ ​ (ii) named as a “Specially Designated National and Blocked Person” on the most current list published by OFAC at its official website or any replacement website or other replacement official publication of such list (each, an “SDN”), or is otherwise the subject of any Sanctions Laws and Regulations; or (iii) in which an SDN has a controlling interest of 50% or greater ownership interest. “ Dividing Person ”: as defined in the definition of Division. “ Division ”: the statutory division of the assets, liabilities and/or obligations of a Person (the “ Dividing Person ”) among two or more Persons (whether pursuant to a “plan of division” or similar arrangement) pursuant to Section 18-217 of the Delaware Limited Liability Company Act, which may or may not include the Dividing Person and pursuant to which the Dividing Person may or may not survive. “ Division Successor ”: any person that, upon the consummation of a Division of a Dividing Person, holds all or substantially all of the assets, liabilities and/or obligations previously held by such Dividing Person immediately prior to the consummation of such Division. “ Dollar Equivalent ”: at any time as to any amount denominated in a Foreign Currency, the equivalent amount in Dollars as reasonably determined by the Administrative Agent at such time on the basis of the Exchange Rate for the purchase of Dollars with such Foreign Currency on (a) in the case of a determination made pursuant to subsection 2.11(g), the date of such conversion and (b) in the case of any other determination, the most recent Calculation Date for such Foreign Currency. “ Dollar Loan ”:"
    },
    {
      "chunk_index": 10,
      "section": "item_1a",
      "start_char": 54435,
      "end_char": 60429,
      "word_count": 1000,
      "content": "held by such Dividing Person immediately prior to the consummation of such Division. “ Dollar Equivalent ”: at any time as to any amount denominated in a Foreign Currency, the equivalent amount in Dollars as reasonably determined by the Administrative Agent at such time on the basis of the Exchange Rate for the purchase of Dollars with such Foreign Currency on (a) in the case of a determination made pursuant to subsection 2.11(g), the date of such conversion and (b) in the case of any other determination, the most recent Calculation Date for such Foreign Currency. “ Dollar Loan ”: any Committed Rate Loan denominated in Dollars. “ Dollars ” and “ $ ”: dollars in lawful currency of the United States of America. “ Domestic Bank ”: any Bank organized under the laws of the United States of America, any State thereof or the District of Columbia. “ EEA Financial Institution ”: (a) any credit institution or investment firm established in any EEA Member Country which is subject to the supervision of an EEA Resolution Authority, (b) any entity established in an EEA Member Country which is a parent of an institution described in clause (a) of this definition, or (c) any financial institution established in an EEA Member Country which is a subsidiary of an institution described in clauses (a) or (b) of this definition and is subject to consolidated supervision with its parent. “ EEA Member Country ”: any of the member states of the European Union, Iceland, Liechtenstein, and Norway. “ EEA Resolution Authority ”: any public administrative authority or any Person entrusted with public administrative authority of any EEA Member Country (including any delegee) having responsibility for the resolution of any EEA Financial Institution. “ Electronic Signature ”: an electronic sound, symbol, or process attached to, or associated with, a contract or other record and adopted by a Person with the intent to sign, authenticate or accept such contract or record. “ EMU ”: the Economic and Monetary Union as contemplated in the Treaty. ​ 14 ​ ​ ​ “ Engaged Acres ”: the number of unique acres with at least one operation pass documented in the Company’s proprietary online farm management system in the 12 months prior to the end of the fiscal year. “ Equipment Operations ”: those business segments of the Company and its consolidated Subsidiaries that are primarily engaged in the manufacture and distribution of equipment, parts and related attachments. “ Equipment Operations Debt ”: at a particular time, the sum of short-term and long-term indebtedness for borrowed money that is or would be shown on a balance sheet of Equipment Operations (with Financial Services reflected only on an equity basis), which balance sheet was or would be prepared on the basis of the most recent publicly available consolidated balance sheet of the Company and its consolidated Subsidiaries as at the end of any fiscal quarter of the Company and its consolidated Subsidiaries (including the last quarter of any fiscal year of the Company and its consolidated Subsidiaries). “ ERISA ”: the Employee Retirement Income Security Act of 1974, as amended from time to time. “ EU Bail-In Legislation Schedule ”: the EU Bail-In Legislation Schedule published by the Loan Market Association (or any successor Person), as in effect from time to time. “ Euro ”: the single currency of Participating Member States of the EMU introduced in accordance with the provisions of Article 123 of the Treaty and, in respect of all payments to be made under this Agreement in Euro, means immediately available, freely transferable funds in such currency. “ EURIBOR Screen Rate ”: as defined in the definition of Eurocurrency Rate. “ Eurocurrency Loans ”: Committed Rate Loans at such time as they are made and/or being maintained at a rate of interest based upon a Eurocurrency Rate. “ Eurocurrency Rate ”: (a) with respect to each day during each Interest Period pertaining to a Eurocurrency Loan denominated in Australian Dollars, the rate per annum equal to the average bid reference rate as administered by the Australian Financial Markets Association (or any other Person that takes over the administration of that rate) for Australian Dollar bills of exchange with a tenor equal in length to such Interest Period (or as close to such Interest Period as possible), displayed on page BBSY of the Reuters Screen (or, in the event such rate does not appear on such Reuters page, on any successor or substitute page on such screen or service that displays such rate, or other appropriate page of such other information service that publishes such rate as shall be selected from time to time by the Administrative Agent in consultation with the Borrowers; in each case, the “ BBSY Screen Rate ”) at approximately 11:00 A.M., Local Time, two Business Days prior to the beginning of such Interest Period (or such other day as is generally treated as the rate fixing day by market practice in such interbank market, as determined by the Administrative Agent); provided , that, if the BBSY Screen Rate shall not be available at such time for such Interest Period, the Administrative Agent may substitute such rate with an alternative published interest rate reasonably acceptable to the applicable Borrower (or other rate basis agreed by the applicable Borrower and the Administrative Agent). (b) with respect to each day during each Interest Period pertaining to a Eurocurrency Loan denominated in New Zealand Dollars, the rate per annum equal to the average bid reference rate as administered by the New Zealand Financial Markets Association (or any other Person that takes over the administration of that rate) for New Zealand Dollar bills of exchange with a tenor equal in length to such ​ 15 ​ ​ ​ Interest Period (or as close to such Interest Period as possible), displayed on page BKBM of the Reuters Screen (or, in the event such rate does not appear on such Reuters page, on any successor or substitute page on such"
    },
    {
      "chunk_index": 11,
      "section": "item_1a",
      "start_char": 59869,
      "end_char": 66016,
      "word_count": 1000,
      "content": "a Eurocurrency Loan denominated in New Zealand Dollars, the rate per annum equal to the average bid reference rate as administered by the New Zealand Financial Markets Association (or any other Person that takes over the administration of that rate) for New Zealand Dollar bills of exchange with a tenor equal in length to such ​ 15 ​ ​ ​ Interest Period (or as close to such Interest Period as possible), displayed on page BKBM of the Reuters Screen (or, in the event such rate does not appear on such Reuters page, on any successor or substitute page on such screen or service that displays such rate, or other appropriate page of such other information service that publishes such rate as shall be selected from time to time by the Administrative Agent in consultation with the Borrowers; in each case, the “ BKBM Screen Rate ”) at approximately 11:00 A.M., Local Time, on the first day of such Interest Period (or such other day as is generally treated as the rate fixing day by market practice in such interbank market, as determined by the Administrative Agent); provided , that, if the BKBM Screen Rate shall not be available at such time for such Interest Period, the Administrative Agent may substitute such rate with an alternative published interest rate reasonably acceptable to the applicable Borrower (or other rate basis agreed by the applicable Borrower and the Administrative Agent). (c) with respect to each day during each Interest Period pertaining to a Eurocurrency Loan denominated in Euros, the rate per annum equal to the interbank offered rate administered by the European Money Markets Institute (or any other Person that takes over the administration of such rate) for a tenor equal in length to such Interest Period as displayed on page on Reuters Page EURIBOR01 (or, in the event such rate does not appear on such Reuters page, on any successor or substitute page on such screen or service that displays such rate, or other appropriate page of such other information service that publishes such rate as shall be selected from time to time by the Administrative Agent in consultation with the Borrowers; in each case, the “ EURIBOR Screen Rate ”) at approximately 11:00 a.m., Local Time, two Business Days prior to the beginning of such Interest Period; provided , that, if the EURIBOR Screen Rate shall not be available at such time for such Interest Period, the Administrative Agent may substitute such rate with an alternative published interest rate reasonably acceptable to the applicable Borrower (or other rate basis agreed by the applicable Borrower and the Administrative Agent). Notwithstanding the above, in no event shall the Eurocurrency Rate be less than the Floor. “ Event of Default ”: any of the events specified in Section 8, provided that any requirement for the giving of notice, the lapse of time, or both, or any other condition, event or act has been satisfied. “ Exchange Rate ”: on any day, the rate at which the starting Currency may be exchanged into the other relevant Currency, as set forth at approximately 10:00 A.M., Local Time, on such date on the Reuters World Spots page for such starting Currency. In the event that such rate does not appear on any Reuters World Spots page, the Exchange Rate shall be determined by reference to such other publicly available service for displaying exchange rates reasonably selected by the Administrative Agent. “ Existing Pricing Certificate ”: as defined in the definition of Pricing Certificate. “ Exposure ”: (a) with respect to an Objecting Bank at any time, the aggregate amount of such Bank’s Loans then outstanding and (b) with respect to any other Bank at any time, the Commitment of such Bank then in effect or, if the Commitments have been terminated, the amount of such Bank’s Loans then outstanding. “ Extension Request ”: each request by the Borrowers made pursuant to subsection 2.16 for the Banks to extend this Agreement, which shall contain the information in respect of such extension specified in Exhibit E and shall be delivered to the Administrative Agent in writing. “ FATCA ”: Sections 1471 through 1474 of the Code (and any comparable successor provisions), any effective regulations published thereunder or official interpretations thereof issued by ​ 16 ​ ​ ​ any Governmental Authority charged with the administration thereof, any agreements entered into pursuant to Section 1471(b)(1) of the Code, any applicable intergovernmental agreements with respect thereto, and any treaty, law, regulations, or other official guidance enacted in any other jurisdiction relating to such intergovernmental agreement. “ Federal Funds Effective Rate ”: for any day, the rate calculated by the NYFRB based on such day’s federal funds transactions by depositary institutions, as determined in such manner as shall be set forth on the NYFRB’s Website from time to time, and published on the next succeeding Business Day by the NYFRB as the effective federal funds rate; provided that if the Federal Funds Effective Rate as so determined would be less than zero, such rate shall be deemed to be zero for the purposes of this Agreement. “ Federal Reserve Board ”: the Board of Governors of the Federal Reserve System of the United States of America. “ Financial Services ”: the businesses of the Company (including the credit businesses) that are not primarily engaged in Equipment Operations. “ Fitch ”: Fitch Ratings Inc. “ Fixed Charges ”: for any particular period for the Capital Corporation and its consolidated Subsidiaries, all of the Capital Corporation’s and its consolidated Subsidiaries’ consolidated interest on indebtedness for borrowed money, amortization of discounts of indebtedness for borrowed money, the portion of rentals under financing leases deemed to represent interest and rentals under operating leases; provided , that, notwithstanding the foregoing, (i) consolidated interest on Securitization Indebtedness and amortization of Securitization Indebtedness shall be deemed not included in Fixed Charges and (ii) any unrealized gains or losses in respect of any Hedging Transaction entered into for the purpose of"
    },
    {
      "chunk_index": 12,
      "section": "item_1a",
      "start_char": 65301,
      "end_char": 71780,
      "word_count": 1000,
      "content": "“ Fixed Charges ”: for any particular period for the Capital Corporation and its consolidated Subsidiaries, all of the Capital Corporation’s and its consolidated Subsidiaries’ consolidated interest on indebtedness for borrowed money, amortization of discounts of indebtedness for borrowed money, the portion of rentals under financing leases deemed to represent interest and rentals under operating leases; provided , that, notwithstanding the foregoing, (i) consolidated interest on Securitization Indebtedness and amortization of Securitization Indebtedness shall be deemed not included in Fixed Charges and (ii) any unrealized gains or losses in respect of any Hedging Transaction entered into for the purpose of hedging interest rate risk shall be deemed not included in Fixed Charges; provided , further , that such amounts (but not any amounts constituting consolidated interest on, or amortization of, Securitization Indebtedness) of the Capital Corporation and its consolidated Subsidiaries shall be determined by reference to the publicly available consolidated statements of income of the Capital Corporation and its consolidated Subsidiaries for or covering such period and after such adjustments, if any, as may be required so that such amounts are determined in accordance with GAAP. “ Floor ” the benchmark rate floor, if any, provided in this Agreement initially (as of the execution of this Agreement, the modification, amendment or renewal of this Agreement or otherwise) with respect to the Eurocurrency Rate, Adjusted Term CORRA Rate, Adjusted Term SOFR Rate, Adjusted Daily Simple SOFR, Adjusted Daily Simple SONIA, Adjusted Daily Simple CORRA or the Central Bank Rate, as applicable. For the avoidance of doubt, the initial Floor for each of the Central Bank Rate, Eurocurrency Rate, Adjusted Term CORRA Rate, Adjusted Term SOFR Rate, Adjusted Daily Simple SOFR, Adjusted Daily Simple SONIA and Adjusted Daily Simple CORRA shall be 0.0%. “ Foreign Bank ”: any Bank that is not a Domestic Bank. “ Foreign Currency ”: (a) Euros, Pounds Sterling, Australian Dollars and Canadian Dollars, (b) upon (i) confirmation by Deutsche Bank AG, New York Branch to the Administrative Agent that it (or a branch or affiliate thereof) can fund in New Zealand Dollars and (ii) confirmation by Sumitomo Mitsui Banking Corporation to the Administrative Agent that it (or a branch or affiliate thereof) can fund in New Zealand Dollars (provided, that, such confirmation from either Deutsche Bank AG, New York Branch or Sumitomo Mitsui Banking Corporation shall not be required if such Bank ceases to be a Bank hereunder), New Zealand Dollars and (c) as agreed by the Administrative Agent, any ​ 17 ​ ​ ​ other Currency which is freely traded and convertible into Dollars in the London interbank market and for which the Dollar Equivalent thereof can be calculated from time to time. “ Foreign Currency Equivalent ”: at the time of determination or conversion thereof, as applicable, as to any amount denominated or expressed in Dollars, the equivalent amount in the applicable Foreign Currency as reasonably determined by the Administrative Agent at such time on the basis of the Exchange Rate for the purchase of such Foreign Currency with Dollars on such date. “ Foreign Currency Loan ”: each Loan denominated in a Foreign Currency. “ GAAP ”: generally accepted accounting principles in the United States of America as applied in the preparation of financial statements of the Company or the Capital Corporation, respectively, as of the fiscal year ended October 29, 2023, except with respect to capital lease obligations, in which case the generally accepted accounting principles in the United States of America as applied in the preparation of financial statements of the Company or the Capital Corporation, respectively, as of January 1, 2015 shall apply. “ GHG Protocol ”: the internationally recognized standard for greenhouse gas accounting of companies, defining the methodologies for calculating direct and indirect emissions according to the World Resources Institute (WRI) and World Business Council for Sustainable Development (WBCSD) Greenhouse Gas Protocol Corporate Accounting and Reporting Standard, as such GHG Protocol may be revised, amended or supplemented from time to time. For the avoidance of doubt, in the event an updated version of the GHG Protocol is published, the Borrowers may elect at their sole discretion and option to apply such revised version for the purposes of calculating Scope 1 Emissions and Scope 2 Emissions. “ Governmental Authority ”: any nation or government, any state or other political subdivision thereof, and any entity exercising executive, legislative, judicial, regulatory or administrative functions of or pertaining to government. “ Hedging Transaction ”: any swap transaction, interest rate protection agreement (including any interest rate swap, interest “cap” or “collar” or any other interest rate hedging device entered into by the Capital Corporation or one or more of its Subsidiaries), option agreement, short or long position in equity or debt instruments, commodities, futures and forward transactions, outperformance agreement or other similar transaction, agreement or arrangement entered into by the Capital Corporation or one or more of its Subsidiaries. “ IBA ”: has the meaning assigned to such term in subsection 1.4. “ Important Property ”: (a) any manufacturing plant, including land, all buildings and other improvements thereon, and all manufacturing machinery and equipment located therein, owned and used by the Company or a Restricted Subsidiary primarily for the manufacture of products to be sold by the Company or such Restricted Subsidiary, (b) the executive office and administrative building of the Company in Moline, Illinois, and (c) research and development facilities, including land and buildings and other improvements thereon and research and development machinery and equipment located therein, in each case, owned and used by the Company or a Restricted Subsidiary; except in any case property of which the aggregate fair value as determined by the Board of Directors of the Company does not at the time exceed 1% of Consolidated Net Worth. “ Increasing Bank ”: as defined in subsection 2.20(c). “ Indemnified Person ”: as defined in subsection 10.4(b). ​ 18 ​ ​ ​ “ Indemnified Taxes ”: as defined in subsection 2.17(a). “ Index Debt ”: any senior, unsecured, non-credit enhanced"
    },
    {
      "chunk_index": 13,
      "section": "item_1a",
      "start_char": 71183,
      "end_char": 77093,
      "word_count": 1000,
      "content": "buildings and other improvements thereon and research and development machinery and equipment located therein, in each case, owned and used by the Company or a Restricted Subsidiary; except in any case property of which the aggregate fair value as determined by the Board of Directors of the Company does not at the time exceed 1% of Consolidated Net Worth. “ Increasing Bank ”: as defined in subsection 2.20(c). “ Indemnified Person ”: as defined in subsection 10.4(b). ​ 18 ​ ​ ​ “ Indemnified Taxes ”: as defined in subsection 2.17(a). “ Index Debt ”: any senior, unsecured, non-credit enhanced long-term debt issued by the Company. “ Interest Payment Date ”: (a) as to any ABR Loan, the last Business Day of each March, June, September and December, commencing on the first of such days to occur after such ABR Loan is made or a Eurocurrency Loan or Term Benchmark Loan is converted to an ABR Loan, (b) as to any Eurocurrency Loan or Term Benchmark Loan, the last day of each Interest Period applicable thereto, provided that as to any Eurocurrency Loan or Term Benchmark Loan in respect of which a Borrower has selected an Interest Period of greater than three months, interest shall also be paid on the day which is three months after the beginning of such Interest Period, (c) as to any SONIA Loan, Daily Simple CORRA Loan or Daily Simple SOFR Loan, each date that is on the numerically corresponding day in each calendar month that is one month after the Borrowing Date of such Loan (or if there is no numerically corresponding day in such later month, then the last day of such month) and (d) the Termination Date. “ Interest Period ”: (a) with respect to any Eurocurrency Loan or Term Benchmark Loan, the period commencing on the Borrowing Date, the date any ABR Loan is converted to a Eurocurrency Loan or Term Benchmark Loan, as applicable or the date any Eurocurrency Loan or Term Benchmark Loan, as applicable is continued as a Eurocurrency Loan or Term Benchmark, as applicable, as the case may be, with respect to such Eurocurrency Loan or Term Benchmark Loan, as applicable and ending one, three or six months thereafter in the case of any Eurocurrency Loan or Term Benchmark Loan denominated in any Currency other than Canadian Dollars (or, with the consent of all relevant Banks, twelve months thereafter, or a period of less than one month thereafter if all relevant Banks consent to such period) (in each case, subject to the availability for the Benchmark applicable to the relevant Loan or Commitment), or one or three months thereafter in the case of any Term Benchmark Loan denominated in Canadian Dollars, as selected by a Borrower in its notice of borrowing, conversion or continuance as provided in subsection 2.1(c) or 2.9; and (b) with respect to any Negotiated Rate Loan, the period or periods commencing on the Borrowing Date with respect to such Negotiated Rate Loan or the last day of any Interest Period with respect thereto and ending on the dates as shall be mutually agreed upon between the relevant Borrower and the relevant Bank; provided , that all of the foregoing provisions relating to Interest Periods are subject to the following: (i) if any Interest Period pertaining to a Eurocurrency Loan would otherwise end on a day which is not a Working Day, that Interest Period shall be extended to the next succeeding Working Day unless the result of such extension would be to carry such Interest Period into another calendar month in which event such Interest Period shall end on the immediately preceding Working Day; (ii) if any Interest Period pertaining to a Negotiated Rate Loan or a Term Benchmark Loan would otherwise end on a day which is not a Business Day, that Interest Period shall be extended to the next succeeding Business Day; (iii) any Interest Period pertaining to a Eurocurrency Loan or Term Benchmark Loan having an Interest Period of one, three or six months, that begins on the last Working Day (or, in the case of Term Benchmark Loans, the last Business Day) of a calendar month (or on a day for which there is no ​ 19 ​ ​ ​ numerically corresponding day in the calendar month at the end of such Interest Period) shall end on the last Working Day or Business Day, as applicable of a calendar month; (iv) Interest Periods shall be deemed available only if the Required Banks shall not have advised the Administrative Agent that the Eurocurrency Rate, the Adjusted Term CORRA Rate or the Adjusted Term SOFR Rate, as applicable determined by the Administrative Agent on the basis of the applicable quotes will not adequately and fairly reflect the cost to such Banks of maintaining or funding their Committed Rate Loans bearing interest based on the Eurocurrency Rate, Adjusted Term CORRA Rate or the Adjusted Term SOFR Rate, as applicable determined for such Interest Period. The Administrative Agent shall notify the Borrowers and each Bank promptly after having been advised by the Required Banks that a Eurocurrency Rate, Adjusted Term CORRA Rate or the Adjusted Term SOFR Rate, as applicable will not so adequately and fairly reflect such Banks’ costs as aforesaid. If a requested Interest Period shall be unavailable in accordance with the foregoing sentence, the proposed Borrower may (A) in accordance with the provisions (including any requirements for notification) of subsection 2.1 request, at its option, that the requested Committed Rate Loans denominated in Dollars be made or maintained as ABR Loans or (B) withdraw the request for such Committed Rate Loans for which the Interest Period was unavailable by giving notice of such election to the Administrative Agent in accordance with subsection 2.11; provided , that if the Administrative Agent does not receive any notice hereunder with respect to requested Committed Rate Loans denominated in Dollars, such Borrower shall be deemed to have requested ABR Loans; (v) with respect to"
    },
    {
      "chunk_index": 14,
      "section": "item_1a",
      "start_char": 76454,
      "end_char": 81765,
      "word_count": 1000,
      "content": "with the provisions (including any requirements for notification) of subsection 2.1 request, at its option, that the requested Committed Rate Loans denominated in Dollars be made or maintained as ABR Loans or (B) withdraw the request for such Committed Rate Loans for which the Interest Period was unavailable by giving notice of such election to the Administrative Agent in accordance with subsection 2.11; provided , that if the Administrative Agent does not receive any notice hereunder with respect to requested Committed Rate Loans denominated in Dollars, such Borrower shall be deemed to have requested ABR Loans; (v) with respect to Loans made by an Objecting Bank, no Interest Periods with respect to such Loans shall end after such Objecting Bank’s Commitment Expiration Date; and (vi) no Interest Period shall end after the Termination Date. “ IRS ”: as defined in subsection 2.17(c). “ ISDA Definitions ”: the 2006 ISDA Definitions published by the International Swaps and Derivatives Association, Inc. or any successor thereto, as amended or supplemented from time to time, or any successor definitional booklet for interest rate derivatives published from time to time by the International Swaps and Derivatives Association, Inc. or such successor thereto. “ JD Luxembourg ”: as defined in the preamble hereto. “ JPMorgan Chase Bank, N.A. ”: JPMorgan Chase Bank, N.A., a national association. “ Judgment Currency ”: as defined in subsection 2.24. “ KPI 1 ”: for any fiscal year, the sum of the Scope 1 Emissions and the Scope 2 Emissions (on a market basis) for such fiscal year. “ KPI 1 Applicable Rate Adjustment Amount ”: with respect to any period between Sustainability Pricing Adjustment Dates, (a) positive 0.025%, if the KPI 1 for such period as set forth in the KPI Metrics Report is more than the KPI 1 Threshold A for such period, (b) 0.000%, if the KPI 1 for such period as set forth in the KPI Metrics Report is less than or equal to the KPI 1 Threshold A for such period but more than the KPI 1 Target A for such period and (c) negative 0.025%, if the KPI 1 for such period as set forth in the KPI Metrics Report is less than or equal to KPI 1 Target A for such period. “ KPI 1 Commitment Fee Adjustment Amount ”: with respect to any period between Sustainability Pricing Adjustment Dates, (a) positive 0.005%, if the KPI 1 for such period as set forth in ​ 20 ​ ​ ​ the KPI Metrics Report is more than the KPI 1 Threshold A for such period, (b) 0.000%, if the KPI 1 for such period as set forth in the KPI Metrics Report is less than or equal to the KPI 1 Threshold A for such period but more than the KPI 1 Target A for such period and (c) negative 0.005%, if the KPI 1 for such period as set forth in the KPI Metrics Report is less than or equal to KPI 1 Target A for such period. “ KPI 1 Target A ”: with respect to any fiscal year, the KPI 1 Target A for such fiscal year as set forth in the Sustainability Table. “ KPI 1 Threshold A ”: with respect to any fiscal year, the KPI 1 Threshold A for such fiscal year as set forth in the Sustainability Table. “ KPI 2 ”: for any fiscal year, the number of Engaged Acres for such fiscal year. “ KPI 2 Applicable Rate Adjustment Amount ”: with respect to any period between Sustainability Pricing Adjustment Dates, (a) positive 0.025%, if the KPI 2 for such period as set forth in the KPI Metrics Report is less than the KPI 2 Threshold B for such period, (b) 0.000%, if the KPI 2 for such period as set forth in the KPI Metrics Report is more than or equal to the KPI 2 Threshold B for such period but less than the KPI 2 Target B for such period and (c) negative 0.025%, if the KPI 2 for such period as set forth in the KPI Metrics Report is more than or equal to KPI 2 Target B for such period. “ KPI 2 Commitment Fee Adjustment Amount ”: with respect to any period between Sustainability Pricing Adjustment Dates, (a) positive 0.005%, if the KPI 2 for such period as set forth in the KPI Metrics Report is less than the KPI 2 Threshold B for such period, (b) 0.000%, if the KPI 2 for such period as set forth in the KPI Metrics Report is more than or equal to the KPI 2 Threshold B for such period but less than the KPI 2 Target B for such period and (c) negative 0.005%, if the KPI 2 for such period as set forth in the KPI Metrics Report is more than or equal to KPI 2 Target B for such period. “ KPI 2 Target B ”: with respect to any fiscal year, the KPI 2 Target B for such fiscal year as set forth in the Sustainability Table. “ KPI 2 Threshold B ”: with respect to any fiscal year, the KPI 2 Threshold B for such fiscal year as set forth in the Sustainability Table. “ KPI Metrics ”: collectively, KPI 1 and KPI 2 (each, a “ KPI Metric ”). “ KPI Metrics Report ”: an annual report (it being understood that this annual report may take the form of the annual Sustainability Report) attached to the Pricing Certificate that sets forth the calculations for each KPI Metric for a specific fiscal year. “ KPI Targets ”: collectively, each KPI 1 Target A and each KPI 2 Target B. “ KPI Thresholds ”: collectively, each KPI 1 Threshold A and each KPI 2 Threshold B. “ Level ”: Level I Rating, Level II Rating, Level III Rating, Level IV Rating or Level V Rating, as the context shall require. “ Level I Rating ”: as of any date, such"
    },
    {
      "chunk_index": 15,
      "section": "item_1a",
      "start_char": 81224,
      "end_char": 87069,
      "word_count": 1000,
      "content": "being understood that this annual report may take the form of the annual Sustainability Report) attached to the Pricing Certificate that sets forth the calculations for each KPI Metric for a specific fiscal year. “ KPI Targets ”: collectively, each KPI 1 Target A and each KPI 2 Target B. “ KPI Thresholds ”: collectively, each KPI 1 Threshold A and each KPI 2 Threshold B. “ Level ”: Level I Rating, Level II Rating, Level III Rating, Level IV Rating or Level V Rating, as the context shall require. “ Level I Rating ”: as of any date, such Level shall apply if the Company’s assigned Credit Rating as of such date is Aa3 or higher by Moody’s, AA- or higher by S&P and AA- or higher by Fitch. “ Level II Rating ”: as of any date, such Level shall apply if the Company’s assigned Credit Rating as of such date is A1 by Moody’s, A+ by S&P and A+ by Fitch. ​ 21 ​ ​ ​ “ Level III Rating ”: as of any date, such Level shall apply if the Company’s assigned Credit Rating as of such date is A2 by Moody’s, A by S&P and A by Fitch. “ Level IV Rating ”: as of any date, such Level shall apply if the Company’s assigned Credit Rating as of such date is A3 by Moody’s, A- by S&P and A- by Fitch. “ Level V Rating ”: as of any date, such Level shall apply if the Company’s assigned Credit Rating as of such date is below A3 by Moody’s, below A- by S&P and below A- by Fitch. “ Loan Account ”: as defined in subsection 2.3; collectively, the “ Loan Accounts ”. “ Loan Assignees ”: as defined in subsection 10.5(c). “ Loan Assignment ”: an Assignment and Assumption, substantially in the form of Exhibit B. “ Loan Documents ”: this Agreement, including schedules and exhibits hereto, and the Notes. “ Loans ”: the collective reference to the Committed Rate Loans and the Negotiated Rate Loans. “ Local Time ”: (a) in the case of Foreign Currency Loans denominated in Canadian Dollars, Toronto, Ontario time, (b) in the case of Foreign Currency Loans denominated in Australian Dollars, Sydney, Australia time, (c) in the case of Foreign Currency Loans denominated in New Zealand Dollars, Wellington, New Zealand time, (d) in the case of Foreign Currency Loans denominated in Euros, Brussels time, (e) in the case of all other Foreign Currency Loans, London time and (f) in all other cases, New York time. “ Losses ”: as defined in subsection 10.4(b). “ Luxembourg Obligations ”: the collective reference to the unpaid principal of and interest on the Loans made to JD Luxembourg and all other obligations and liabilities of JD Luxembourg (including, without limitation, interest accruing at the then applicable rate provided herein after the maturity of such Loans and interest accruing at the then applicable rate provided herein after the filing of any petition in bankruptcy, or the commencement of any insolvency, reorganization or like proceeding, relating to JD Luxembourg, whether or not a claim for post-filing or post-petition interest is allowed in such proceeding) to the Administrative Agent or any Bank, whether direct or indirect, absolute or contingent, due or to become due, or now existing or hereafter incurred, which may arise under, out of, or in connection with, this Agreement or any other document made, delivered or given in connection with any of the foregoing, in each case whether on account of principal, interest, reimbursement obligations, fees, indemnities, costs, expenses or otherwise (including, without limitation, all fees and disbursements of counsel to the Administrative Agent or to the Banks that are required to be paid by JD Luxembourg pursuant to the terms of any of the foregoing agreements). “ Majority Banks ”: at any particular time, Banks having Commitment Percentages aggregating more than fifty percent; provided that (a) at any time after the termination of all the Commitments, “Majority Banks” shall mean Banks holding Loans aggregating more than fifty percent in principal amount of all outstanding Loans and (b) at any time after the Commitment Expiration Date with respect to any Objecting Bank (but prior to the termination of all the Commitments), “ Majority Banks ” ​ 22 ​ ​ ​ shall mean Banks whose Exposure aggregates more than fifty percent of the aggregate Exposure of all the Banks. “ Margin Stock ”: as defined in Regulation U of the Board. “ Moody’s ”: Moody’s Investor Service, Inc. “ Mortgage ”: as defined in subsection 6.2. “ Negotiated Rate Loan ”: each Loan made to the Company or the Capital Corporation by a Bank pursuant to a Negotiated Rate Loan Request in such principal amount, for such number of Interest Periods (subject to the proviso to the definition of “Interest Period” in this subsection 1.1) and having such interest rate(s) and repayment terms as shall, in each case, be mutually agreed upon between such Borrower and such Bank. “ Negotiated Rate Loan Request ”: each request by the Company or the Capital Corporation for a Bank to make Negotiated Rate Loans, which shall be delivered to such Bank in writing, by facsimile transmission, or by telephone, immediately confirmed in writing, and which shall specify the amount to be borrowed and the proposed Borrowing Date. “ Net Earnings Available for Fixed Charges ”: for any particular period for the Capital Corporation and its consolidated Subsidiaries, the sum of (i) consolidated net earnings of the Capital Corporation and such Subsidiaries for such period without deduction of Fixed Charges and without deduction of federal, state or other income taxes; provided that such net earnings of the Capital Corporation and its consolidated Subsidiaries shall be determined by reference to the publicly available statements of income of the Capital Corporation and its consolidated Subsidiaries for or covering such period and after such adjustments, if any, as may be required so that such net earnings are determined in"
    },
    {
      "chunk_index": 16,
      "section": "item_1a",
      "start_char": 86416,
      "end_char": 92318,
      "word_count": 1000,
      "content": "for any particular period for the Capital Corporation and its consolidated Subsidiaries, the sum of (i) consolidated net earnings of the Capital Corporation and such Subsidiaries for such period without deduction of Fixed Charges and without deduction of federal, state or other income taxes; provided that such net earnings of the Capital Corporation and its consolidated Subsidiaries shall be determined by reference to the publicly available statements of income of the Capital Corporation and its consolidated Subsidiaries for or covering such period and after such adjustments, if any, as may be required so that such net earnings are determined in accordance with GAAP, except that earned investment tax credits may be included as revenue in the consolidated income statement of the Capital Corporation and its consolidated Subsidiaries, rather than as an offset against the provision for income taxes; provided , further , that such consolidated net earnings of the Capital Corporation and its Consolidated Subsidiaries for such period shall not include any unrealized gains or losses in respect of any Hedging Transaction entered into for the purpose of hedging interest rate risk and (ii) Support Payments received by the Capital Corporation in or in respect of such period. “ New Bank ”: as defined in subsection 2.20(b). “ New Bank Supplement ”: as defined in subsection 2.20(b). “ New Zealand Dollars ”: the lawful currency of New Zealand. “ Non-Qualifying Bank ”: as defined in subsection 2.17(e). “ Notes ”: the collective reference to any promissory note evidencing Loans. “ NYFRB ”: the Federal Reserve Bank of New York. “ NYFRB Rate ”: for any day, the greater of (a) the Federal Funds Effective Rate in effect on such day and (b) the Overnight Bank Funding Rate in effect on such day (or for any day that is not a Business Day, for the immediately preceding Business Day); provided that if none of such rates are published for any day that is a Business Day, the term “NYFRB Rate” means the rate for a federal funds transaction quoted at 11:00 a.m. on such day received by the Administrative Agent from a federal funds ​ 23 ​ ​ ​ broker of recognized standing selected by it; provided , further , that if any of the aforesaid rates as so determined be less than zero, such rate shall be deemed to be zero for purposes of this Agreement. “ NYFRB’s Website ”: the website of the NYFRB at http://www.newyorkfed.org, or any successor source. “ Objecting Banks ”: as defined in subsection 2.16(a). “ Offered Increase Amount ”: as defined in subsection 2.20(a). “ Overnight Bank Funding Rate ”: for any day, the rate comprised of both overnight federal funds and overnight Eurodollar borrowings by U.S.-managed banking offices of depository institutions, as such composite rate shall be determined by the NYFRB as set forth on its public website from time to time, and published on the next succeeding Business Day by the NYFRB as an overnight bank funding rate. “ Overnight Rate ”: for any day, (a) with respect to any amount denominated in Dollars, the Federal Funds Effective Rate, and (b) with respect to any amount denominated in a Foreign Currency, at a rate reasonably determined by the Administrative Agent to be the cost to it of funding such amounts. “ Participant Register ”: as defined in subsection 10.5(b). “ Participants ”: as defined in subsection 10.5(b). “ Participating Member State ”: any member state of the European Community that adopts or has adopted the Euro as its lawful currency in accordance with legislation of the European Community relating to Economic and Monetary Union. “ Payment ”: as defined in subsection 9.4(b). “ Payment Notice ”: as defined in subsection 9.4(b). “ Periodic Term CORRA Determination Day ”: as defined in the definition of Term CORRA. “ Person ”: an individual, partnership, corporation, business trust, joint stock company, trust, unincorporated association, joint venture, Governmental Authority or other entity of whatever nature, provided that for purposes of subsection 8(h), Person shall also include two or more entities acting as a syndicate or any other group for the purpose of acquiring, holding or disposing of securities of the Company. “ Plan ”: any pension plan which is covered by Title IV of ERISA and in respect of which either Borrower or a Commonly Controlled Entity is an “employer” as defined in Section 3(5) of ERISA. “ Pounds ” or “ £ ” or “ Pounds Sterling ”: the lawful currency of the United Kingdom. “ Prevailing Rating ”: at any date of determination, the Level then applicable; provided that for purposes of determining the applicable Level when the assigned Credit Ratings of the Company by all three Ratings Agencies do not fall within the same Level: (i) if the Credit Ratings of the Company assigned by S&P and Moody’s fall within the same Level, the Prevailing Rating shall be such Level, (ii) if the Credit Ratings of the Company assigned by S&P and Moody’s do not fall within the same Level ​ 24 ​ ​ ​ and the ratings differential is one Level, the Prevailing Rating shall be determined solely by reference to the higher of (x) the Credit Rating of the Company assigned by S&P and (y) the Credit Rating of the Company assigned by Moody’s and (iii) if the Credit Ratings of the Company assigned by S&P and Moody’s do not fall within the same Level and the ratings differential is more than one Level, the Prevailing Rating shall be the Level one notch lower than the Level determined solely by reference to the higher of (x) the Credit Rating of the Company assigned by S&P and (y) the Credit Rating of the Company assigned by Moody’s. “ Pricing Certificate ”: a certificate substantially in the form of Exhibit M executed by a Responsible Officer of each of the Borrowers and attaching (a) true and correct copies of the KPI Metrics Report for the most recently ended fiscal year and setting forth"
    },
    {
      "chunk_index": 17,
      "section": "item_1a",
      "start_char": 91746,
      "end_char": 97862,
      "word_count": 1000,
      "content": "within the same Level and the ratings differential is more than one Level, the Prevailing Rating shall be the Level one notch lower than the Level determined solely by reference to the higher of (x) the Credit Rating of the Company assigned by S&P and (y) the Credit Rating of the Company assigned by Moody’s. “ Pricing Certificate ”: a certificate substantially in the form of Exhibit M executed by a Responsible Officer of each of the Borrowers and attaching (a) true and correct copies of the KPI Metrics Report for the most recently ended fiscal year and setting forth the Sustainability Rate Adjustment and the Sustainability Commitment Fee Adjustment, in each case for the period covered thereby and computations in reasonable detail in respect thereof and (b) a limited assurance verification statement of the Sustainability Assurance Provider confirming that the Sustainability Assurance Provider is not aware of any modifications that should be made to the KPI Metrics in order for them to be presented in all material respects in conformity with the Standard for Sustainability Reporting (it being understood that any Pricing Certificate delivered under the Existing Credit Agreement for the most recently ended fiscal year of the Borrowers in accordance with the requirements thereunder (an “ Existing Pricing Certificate ”) shall be deemed to be a Pricing Certificate delivered in respect of such fiscal year hereunder). “ Prime Rate ”: the rate of interest last quoted by The Wall Street Journal as the “Prime Rate” in the U.S. or, if The Wall Street Journal ceases to quote such rate, the highest per annum interest rate published by the Federal Reserve Board in Federal Reserve Statistical Release H.15 (519) (Selected Interest Rates) as the “bank prime loan” rate or, if such rate is no longer quoted therein, any similar rate quoted therein (as determined by the Administrative Agent) or any similar release by the Federal Reserve Board (as determined by the Administrative Agent). Each change in the Prime Rate shall be effective from and including the date such change is publicly announced or quoted as being effective. “ Purchasing Banks ”: as defined in subsection 10.5(d). “ Ratings Agencies ”: S&P, Moody’s and Fitch. “ Re-Allocation Date ”: as defined in subsection 2.20(e). “ Reference Time ”: with respect to any setting of the then-current Benchmark means (1) if such Benchmark is the Term SOFR Rate, 5:00 a.m. (Chicago time) on the day that is two Business Days preceding the date of such setting, (2) if such Benchmark is the Eurocurrency Rate in respect of Loans denominated in Euros, 11:00 a.m. Brussels time two TARGET Days preceding the date of such setting, (3) if such Benchmark is SONIA, then four SONIA Business Days prior to such setting, (4) if such Benchmark is Daily Simple SOFR, then four Business Days prior to such setting, (5) if such Benchmark is Daily Simple CORRA, then four Business Days prior to such setting, (6) if such Benchmark is the Term CORRA Rate, 1:00 p.m. Toronto local time on the day that is two Business Days preceding the date of such setting and (7) if such Benchmark is none of the Term SOFR Rate, the EURIBOR Rate, SONIA, Daily Simple SOFR, Daily Simple CORRA or the Term CORRA, the time determined by the Administrative Agent in its reasonable discretion. “ Register ”: as defined in subsection 10.5(e). “ Related Parties ”: means, with respect to any specified Person, such Person’s affiliates and the respective directors, officers, employees, agents and advisors of such Person and such Person’s affiliates. ​ 25 ​ ​ ​ “ Relevant Governmental Body ”: (a) with respect to a Benchmark Replacement in respect of Loans denominated in Dollars, the Federal Reserve Board and/or the NYFRB, the CME Term SOFR Administrator, as applicable, or a committee officially endorsed or convened by the Federal Reserve Board and/or the NYFRB or, in each case, any successor thereto, (b) with respect to a Benchmark Replacement in respect of Loans denominated in Pounds Sterling, the Bank of England, or a committee officially endorsed or convened by the Bank of England or, in each case, any successor thereto, (c) with respect to a Benchmark Replacement in respect of Loans denominated in Euros, the European Central Bank, or a committee officially endorsed or convened by the European Central Bank or, in each case, any successor thereto (d) with respect to Benchmark Replacement in respect of Loans denominated in Canadian Dollars, the Bank of Canada, or a committee officially endorsed or convened by the Bank of Canada, or any successor thereto, and (e) with respect to a Benchmark Replacement in respect of Loans denominated in any Foreign Currency (other than Pounds Sterling, Euros or Canadian Dollars), (i) the central bank for the Foreign Currency in which such Benchmark Replacement is denominated or any central bank or other supervisor which is responsible for supervising either (1) such Benchmark Replacement or (2) the administrator of such Benchmark Replacement or (ii) any working group or committee officially endorsed or convened by (1) the central bank for the Foreign Currency in which such Benchmark Replacement is denominated, (2) any central bank or other supervisor that is responsible for supervising either (A) such Benchmark Replacement or (B) the administrator of such Benchmark Replacement, (3) a group of those central banks or other supervisors or (4) the Financial Stability Board or any part thereof. “ Relevant Rate ”: with respect to (i) any Term Benchmark Borrowing denominated in Dollars, the Term SOFR Rate, (ii) any Eurocurrency Loan denominated in any Currency, the Eurocurrency Rate applicable thereto, (iii) any Loan denominated in Pounds Sterling, Daily Simple SONIA, (iv) any Daily Simple SOFR Loan, Daily Simple SOFR, (v) any Term Benchmark Borrowing denominated in Canadian Dollars, the Term CORRA and (vi) any Daily Simple CORRA Loan, Daily Simple CORRA. “ Report Period ”: as defined in subsection 2.18. “ Reportable Event ”: any of the events set forth in Section 4043(c) of ERISA or the regulations thereunder."
    },
    {
      "chunk_index": 18,
      "section": "item_1a",
      "start_char": 97238,
      "end_char": 99871,
      "word_count": 437,
      "content": "Relevant Rate ”: with respect to (i) any Term Benchmark Borrowing denominated in Dollars, the Term SOFR Rate, (ii) any Eurocurrency Loan denominated in any Currency, the Eurocurrency Rate applicable thereto, (iii) any Loan denominated in Pounds Sterling, Daily Simple SONIA, (iv) any Daily Simple SOFR Loan, Daily Simple SOFR, (v) any Term Benchmark Borrowing denominated in Canadian Dollars, the Term CORRA and (vi) any Daily Simple CORRA Loan, Daily Simple CORRA. “ Report Period ”: as defined in subsection 2.18. “ Reportable Event ”: any of the events set forth in Section 4043(c) of ERISA or the regulations thereunder. “ Required Banks ”: at a particular time, Banks having Commitment Percentages aggregating at least 66-2/3%; provided that (a) at any time after the termination of all the Commitments, “ Required Banks ” means Banks holding Loans aggregating at least 66-2/3% in principal amount of all outstanding Loans and (b) at any time after the Commitment Expiration Date with respect to any Objecting Bank (but prior to the termination of all the Commitments), “ Required Banks ” means Banks whose Exposure aggregates at least 66-2/3% of the aggregate Exposure of all the Banks. “ Requirement of Law ”: as to any Person, the Certificate of Incorporation and By-Laws or other organizational or governing documents of such Person, and any law, treaty, rule or regulation, or determination of an arbitrator or a court or other Governmental Authority, in each case applicable to or binding upon such Person or any of its property or to which such Person or any of its property is subject. “ Reserves ”: as defined in subsection 2.13(c). “ Resolution Authority ”: an EEA Resolution Authority or, with respect to any UK Financial Institution, a UK Resolution Authority. ​ 26 ​ ​ ​ “ Responsible Officer ”: of a Borrower, the Chairman, the President, any Executive, Senior or other Vice President, the Treasurer, any Assistant Secretary and any Assistant Treasurer of such Borrower. “ Restricted Margin Stock ”: any Margin Stock, the sale, pledge or other disposition of which by the Company or any of its Subsidiaries is in any way restricted by an arrangement with any Bank or any affiliate thereof to the extent that the value thereof (determined in accordance with Regulation U of the Board) does not exceed 25% of the value (determined in accordance with such Regulation U) of all the assets subject to such restriction. “ Restricted Subsidiary ”: any Subsidiary of the Company incorporated in the United States of America or Canada (a) which is engaged in, or whose principal assets consist of property used by the Compa"
    }
  ],
  "created_at": "2026-02-03T22:30:25.751090+00:00"
}